{
  "query": "[User request]\nchat smoke (should generate report)\n\n[Intent]\n{'task': 'report', 'should_use_qe': False, 'needs_browsing': True, 'queries': ['smoking health effects', 'tobacco statistics', 'smoking prevention'], 'time_window': 'auto', 'date_from': None, 'date_to': None, 'sources': ['news', 'arxiv', 'wikipedia'], 'region': 'auto', 'output': {'format': 'markdown', 'citations': True, 'max_length': 'medium'}, 'constraints': {'language': 'auto', 'avoid_topics': [], 'style': '严谨'}, 'notes': '用户请求生成关于吸烟的报告，需要查询相关信息并整合成结构化报告'}\n\n[QE inputs]\n{'should_use_qe': False, 'search_tool': 'basic_search_news', 'query': 'smoking health effects', 'start_date': None, 'end_date': None}",
  "report_title": "关于'[User request]\nchat smoke (should generate report)\n\n[Intent]\n{'task': 'report', 'should_use_qe': False, 'needs_browsing': True, 'queries': ['smoking health effects', 'tobacco statistics', 'smoking prevention'], 'time_window': 'auto', 'date_from': None, 'date_to': None, 'sources': ['news', 'arxiv', 'wikipedia'], 'region': 'auto', 'output': {'format': 'markdown', 'citations': True, 'max_length': 'medium'}, 'constraints': {'language': 'auto', 'avoid_topics': [], 'style': '严谨'}, 'notes': '用户请求生成关于吸烟的报告，需要查询相关信息并整合成结构化报告'}\n\n[QE inputs]\n{'should_use_qe': False, 'search_tool': 'basic_search_news', 'query': 'smoking health effects', 'start_date': None, 'end_date': None}'的深度研究报告",
  "paragraphs": [
    {
      "title": "引言：吸烟的全球概况",
      "content": "介绍吸烟的历史背景、流行程度以及烟草在全球范围内的经济和社会影响。概述报告的主要内容和结构，为读者提供吸烟问题的整体认识。",
      "research": {
        "search_history": [
          {
            "query": "吸烟全球概况 吸烟历史 吸烟流行程度 烟草经济影响",
            "url": "https://www.pmg-ky1.com/spencer_magnet/agricultural-economic-updates-part-2/article_1af28091-3d04-58b3-8d90-3b62b0d7a8af.html",
            "title": "Agricultural Economic Updates, Part 2 - pmg-ky1.com",
            "content": "“This will easily offset another decrease in mares bred and result in a significant increase in receipts,” Burdine said. “The strength in sales also has potential to impact stud fees going forward and creates optimism for 2026.”\n\nTobacco market working toward stabilization\n\nFollowing a long, downward trend in tobacco receipts, Snell expects the value of tobacco production to fall again in 2025 but could stabilize in 2026 at around $200 million, compared to more than $800 million 30 years ago. [...] “While cigarette sales in the U.S. continue to decline at an accelerated rate, a short 2025 burley crop, coupled with recent cigarette export growth and tariff protection on leaf imports, is providing some revitalized support for the waning burley sector,” said Snell. [...] Snell added that dark-fired tobacco has seen a third year of deep volume cuts as the industry adjusts to the new smokeless market, where consumers are switching to products like nicotine pouches and vapes that do not use Kentucky dark tobaccos.\n\nHowever, dark tobacco inventories are so low that contract volume could stabilize or increase modestly in 2026.\n\nKentucky specialty crops surge past tobacco sales",
            "score": 0.15104061,
            "timestamp": "2025-12-29T19:42:23.987412"
          },
          {
            "query": "吸烟全球概况 吸烟历史 吸烟流行程度 烟草经济影响",
            "url": "https://www.ynetnews.com/health_science/article/h1einx00mbx",
            "title": "Crème brûlée and candy-flavored vapes lure teens into nicotine addiction - Ynetnews",
            "content": "The study found key differences in vaping behavior between the U.S. and Israel. In Israel, disposable e-cigarettes were more common and associated with greater perceived harm, as well as higher availability in physical stores. Israeli users of disposables also reported lower rates of using cannabis-infused vaping liquids. [...] She highlighted nicotine’s specific impact on young people: “Nicotine affects brain development and can permanently alter brain structure in adolescents. It also increases vulnerability to other addictions, which is why it’s often called a ‘gateway drug.’ And since e-cigarettes can be used throughout the day, users are often exposed to high levels of nicotine.\" [...] In the U.S., disposable vapes were more strongly linked to sweet flavor preferences and previous use of tobacco or nicotine products. Americans who used disposables were seven times more likely to have smoked regular cigarettes in the past.",
            "score": 0.11341278,
            "timestamp": "2025-12-29T19:42:23.987436"
          },
          {
            "query": "吸烟全球概况 吸烟历史 吸烟流行程度 烟草经济影响",
            "url": "https://www.cspdailynews.com/tobacco/fda-authorizes-6-plus-nicotine-pouches-altria",
            "title": "FDA authorizes 6 On Plus nicotine pouches from Altria - CSP Daily News",
            "content": "Tobacco### How FDA actions, tax hikes and illicit vape crackdowns reshaped the back bar in 2025\n\nTobacco### Altria CEO Billy Gifford to retire in 2026, CFO Sal Mancuso named successor\n\nTobacco### British American Tobacco reaffirms 2025 outlook, sees nicotine pouch product gaining traction\n\nTobacco### Swisher announces $135M Jacksonville expansion, adding 240 new jobs\n\n### Exclusive Content\n\nPremium\n\nMergers & Acquisitions### RaceTrac enters uncharted territory with its Potbelly acquisition [...] Continue to Site >>>\n\nFDA authorizes 6 On Plus nicotine pouches from Altria \n\nNewsletterLoginSubscribe\n\nEdit\n\n Swedish oral pouch maker WiJo expands into U.S. manufacturing\n Kratom-related products are now illegal in Ohio\n How FDA actions, tax hikes and illicit vape crackdowns reshaped the back bar in 2025\n Altria CEO Billy Gifford to retire in 2026, CFO Sal Mancuso named successor\n British American Tobacco reaffirms 2025 outlook, sees nicotine pouch product gaining traction\n\nTobacco [...] The FDA said it will closely monitor how these products are marketed. Helix Innovations must track, measure and report to the FDA the effectiveness of its youth prevention measures and provide analyses of the demographics reached by its advertising, marketing and promotional activities, the FDA said.\n\nIn January the agency issued marketing granted orders to 20 Zyn flavored nicotine pouches. Tobacco company Philip Morris International (PMI) bought Zyn maker Swedish Match North America in 2022.",
            "score": 0.09223726,
            "timestamp": "2025-12-29T19:42:23.987446"
          },
          {
            "query": "吸烟全球概况 吸烟历史 吸烟流行程度 烟草经济影响",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "### John Simpson: 'I've reported on 40 wars but I've never seen a year like 2025'\n ### Brigitte Bardot: The blonde bombshell who revolutionised French cinema\n ### 2026 will have some of the best TV in years - here are the highlights\n ### 'Push to strip citizenship' and 'God created Bardot'\n ### The words from my dad that saved me as a new parent\n ### Mum's 27-year wait for global explorer to come home\n ### Why are young people leaving to work abroad? [...] States of Guernsey - Quit Vaping\n\n## Top Stories\n\n ### Trump says progress made in Ukraine talks but 'thorny issues' remain\n ### Trump and Zelensky appear more upbeat - but show little evidence that peace is near for Ukraine\n ### Egyptian dissident sorry for tweets as Tories push for deportation from UK\n\n## More to explore [...] ## Popular Reads\n\nContent is not available\n\n- {{rankTranslation}}\n\n  {{title}}",
            "score": 0.068046756,
            "timestamp": "2025-12-29T19:42:23.987453"
          },
          {
            "query": "吸烟全球概况 吸烟历史 吸烟流行程度 烟草经济影响",
            "url": "https://www.interlochenpublicradio.org/2025-12-23/cannabis-group-wants-appeals-court-to-block-michigans-24-marijuana-tax-before-it-takes-effect",
            "title": "Cannabis group wants appeals court to block Michigan's 24% marijuana tax before it takes effect - Interlochen Public Radio",
            "content": "“The stakes are incredibly high,” she told Michigan Public Radio. “Cannabis businesses operate on thin margins. If this goes into effect on New Year’s Day, businesses will close. Our neighbors who work in the cannabis industry will lose their jobs.” [...] A cannabis group turned Tuesday to the Michigan Court of Appeals in an effort to block a wholesale marijuana tax from taking effect January 1, arguing the Legislature violated the state constitution earlier this year by suddenly changing the rules on the industry and sidestepping the intent of voters who approved a 2018 initiative.\n\nMichigan Cannabis Industry Association spokesperson Rose Tantraphol said it is critical for courts to settle this question before the new year. [...] © 2025 Interlochen\n\nCLASSICAL IPR | 88.7 FM Interlochen | 94.7 FM Traverse City | 88.5 FM Mackinaw City IPR NEWS | 91.5 FM Traverse City | 90.1 FM Harbor Springs/Petoskey | 89.7 FM Manistee/Ludington\n\nDonate\n\nPlay Live Radio\n\nNext Up:\n\n0:00\n\n0:00\n\n0:00 0:00\n\nAvailable On Air Stations\n\n# Cannabis group wants appeals court to block Michigan's 24% marijuana tax before it takes effect\n\nMichigan Public | By Rick Pluta\n\nPublished December 23, 2025 at 11:54 PM EST",
            "score": 0.057139874,
            "timestamp": "2025-12-29T19:42:23.987460"
          },
          {
            "query": "吸烟全球概况 吸烟历史 吸烟流行程度 烟草经济影响",
            "url": "https://www.indexbox.io/blog/gold-and-silver-prices-signal-market-caution-after-volatile-trading-week/",
            "title": "Gold & Silver Market Analysis: RSI Signals Caution After Volatility - News and Statistics - IndexBox",
            "content": "Worldwide - the report contains statistical data for 200 countries and includes detailed profiles of the 50 largest consuming countries: [...] USA\n China\n Japan\n Germany\n United Kingdom\n France\n Brazil\n Italy\n Russian Federation\n India\n Canada\n Australia\n Republic of Korea\n Spain\n Mexico\n Indonesia\n Netherlands\n Turkey\n Saudi Arabia\n Switzerland\n Sweden\n Nigeria\n Poland\n Belgium\n Argentina\n Norway\n Austria\n Thailand\n United Arab Emirates\n Colombia\n Denmark\n South Africa\n Malaysia\n Israel\n Singapore\n Egypt\n Philippines\n Finland\n Chile\n Ireland\n Pakistan\n Greece\n Portugal\n Kazakhstan\n Algeria\n Czech Republic\n Qatar\n Peru\n Romania [...] + the largest producing countries\n\n## Data coverage:\n\n Global market volume and value\n Per Capita consumption\n Forecast of the market dynamics in the medium term\n Global production, split by region and country\n Global trade (exports and imports)\n Export and import prices\n Market trends, drivers and restraints\n Key market players and their profiles\n\n## Company coverage:",
            "score": 0.040529426,
            "timestamp": "2025-12-29T19:42:23.987466"
          },
          {
            "query": "吸烟全球概况 吸烟历史 吸烟流行程度 烟草经济影响",
            "url": "https://www.npr.org/2025/12/29/nx-s1-5633323/kratom-fda-drug-addictive-opioids",
            "title": "Kratom and 7-OH products are widely available. They’re also at the heart of a public health debate. : Short Wave - NPR",
            "content": "Download\n `<iframe src=\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">`\n\nKratom and 7-OH products are available in many smoke shops. Some people use them instead of opioids. Others say they're addictive – and should be better regulated.  somnuk krobkum/Getty Images  hide caption\n\ntoggle caption\n\n somnuk krobkum/Getty Images [...] Kratom and 7-OH products are becoming increasingly popular in the United States. They're available in many smoke shops, but the Food and Drug Administration says certain products are highly addictive — and could lead to the next wave of the opioid epidemic.\n\nThis isn't the first time kratom has come under scrutiny. [...] Why kratom is at the heart of a public health debate : Short Wave Kratom and 7-OH products are available in many smoke shops. But earlier this year, the FDA recommended certain 7-OH products be scheduled alongside opioids. This isn’t the first time kratom has come under scrutiny. Nearly a decade ago, the DEA wanted to make certain active ingredients in kratom controlled substances. Meaning products would go from being widely available to highly restricted. After a massive wave of protest, the",
            "score": 0.039184183,
            "timestamp": "2025-12-29T19:42:23.987472"
          },
          {
            "query": "吸烟全球概况 吸烟历史 吸烟流行程度 烟草经济影响",
            "url": "https://www.ynetnews.com/jewish-world/article/rjyzfupmbl",
            "title": "Antisemitism at highest level since pre-Holocaust era, report finds - Ynetnews",
            "content": "Beyond Germany, the United States stood out for its high number of reported incidents in November 2025, with 174 cases, a 6.1% increase from 164 incidents in November 2024. New York recorded the highest number of incidents at 39, followed by California with 19, Washington, D.C., with 17, Massachusetts with 15 and Illinois with nine. [...] The data also show that 364 of the 548 incidents documented in November, or 66.4%, were related to Israel. This reflects a continued pattern of anti-Zionist rhetoric and attacks targeting Jews and Jewish institutions worldwide following the Oct. 7 terror attack. [...] Updates Red Mail\n\nTel Aviv-Jaffa\n\nMain\n\nIsrael News\n\nMideast & World News\n\nTech & Digital\n\nReal Estate\n\nFinance\n\nLifestyle\n\nHealth & Science\n\nJewish World\n\nTravel\n\nMore\n\nChannels\n\n Opinions\n Magazine\n Sports\n Food\n Weather\n Podcasts\n\nSites & Sources\n\n Ynet\n Calcalist\n yad2\n ynetespanol\n Вести\n mynet\n\nContact\n\n Contact us\n Privacy Policy\n Terms of Use\n Accessibility Statement\n\n# Antisemitism at highest level since pre-Holocaust era, report finds",
            "score": 0.033949643,
            "timestamp": "2025-12-29T19:42:23.987478"
          },
          {
            "query": "吸烟全球概况 吸烟历史 吸烟流行程度 烟草经济影响",
            "url": "https://vietnamnet.vn/en/vietnam-s-industrial-sector-posts-record-9-5-growth-joins-global-supply-chains-2476272.html",
            "title": "Vietnam’s industrial sector posts record 9.5% growth, joins global supply chains - Báo VietNamNet",
            "content": "According to the Ministry of Industry and Trade, the 2025 economic landscape was defined by global uncertainty - a complex mix of challenges and opportunities.\n\nGlobal growth remained positive but still below pre-pandemic levels, while escalating trade tensions and protectionist policies negatively affected global commerce. Supply chains continued to face risks of disruption due to geopolitical conflicts and climate-related crises. [...] This progress was attributed to government efforts to support enterprises, resolve bottlenecks, and restructure production models, despite global supply disruptions and natural disasters.\n\nDomestic industrial capacity has also improved significantly. Local enterprises now contribute nearly 50% of total industrial output, up from 35% in 2020. [...] Vietnamnet.vn \n\n © Copyright of Vietnamnet Global.\n Tel: 024 3772 7988 Fax: (024) 37722734\n Email: evnn@vietnamnet.vn\n\nDownload app Send to editor\n\n Talkshow\n Hồ sơ\n Ảnh\n Video\n Multimedia\n Podcast\n\n Tuyến bài\n Sự kiện nóng\n\n Tuyển dụng\n Liên hệ tòa soạn\n Liên hệ quảng cáo\n\n#\n\nAa Aa\n\n Vietnamnet global\n\n26/12/2025   16:28 (GMT+07:00)\n\n# Vietnam’s industrial sector posts record 9.5% growth, joins global supply chains\n\nCopy link; \"Copy link\")  \n\n26/12/2025   16:28 (GMT+07:00)",
            "score": 0.033415657,
            "timestamp": "2025-12-29T19:42:23.987484"
          },
          {
            "query": "吸烟全球概况 吸烟历史 吸烟流行程度 烟草经济影响",
            "url": "https://www.newsweek.com/25-major-pop-culture-moments-2025-11266254",
            "title": "25 Major Pop Culture Moments of 2025 - Newsweek",
            "content": "Chiefs Announce Historic Travis Kelce News Ahead of Christmas Day Game\n\n3 min read\n\nIRS\n\nIRS Announces ‘Gigantic’ Tax Refund for Next Year\n\n3 min read\n\nNew Year's Eve\n\nList of Cities Canceling New Year’s Eve Celebrations\n\n5 min read\n\nCats\n\nStray Cat Living Outside Gets Christmas Gift—Reaction Melts Hearts\n\n4 min read\n\nDogs\n\nDog Surrendered to Shelter Just Before Christmas—Reason Breaks Hearts\n\n3 min read\n\n## Opinion\n\nOpinion\n\nWhat Did Trump Actually Accomplish This Year? | Opinion\n\n5 min read [...] Why Obamacare Could Still Collapse Under the Trump Administration\n\n6 min read\n\nWorld\n\nIS Plot To Attack Christmas, New Year’s Events Stopped In Turkey\n\n1 min read\n\nNews\n\nDonald Trump Mentions Jeffrey Epstein in New Christmas Message\n\n8 min read\n\nNews\n\nJapan Approves Record $58 Billion Defense Budget Amid Rising China Tensions\n\n6 min read\n\nNews\n\nGreen Card Update: New Visa Travel Restrictions Come Into Force\n\n3 min read\n\n## Trending\n\nNFL [...] The Latest\n\nNigeria Reacts To US ISIS Attack As New Video Shows Airstrike\n\n NewsPoliticsTechFact CheckPersonal FinanceAutomotiveSportsBetter Workplaces\n Russia-UkraineMiddle EastChina And AsiaBetter PlanetAll World News\n Family & ParentingEntertainmentTravelPetsRelationshipsScienceHealth\n My TurnAll Opinion\n HealthFinanceProductsEducationWorkplacesCorporate ResponsibilityAll Rankings\n NewslettersFacebookInstagramYouTubeTikTokTwitter/XRedditAnnouncementsLeadershipDev Pragad\n More",
            "score": 0.027483363,
            "timestamp": "2025-12-29T19:42:23.987489"
          },
          {
            "query": "全球烟草行业变化趋势 传统香烟与新型尼古丁产品替代 监管动态",
            "url": "https://www.cspdailynews.com/tobacco/fda-authorizes-6-plus-nicotine-pouches-altria",
            "title": "FDA authorizes 6 On Plus nicotine pouches from Altria - CSP Daily News",
            "content": "Agency issues marketing granted orders under a new pilot program to streamline tobacco product reviews By Diane Adam on Dec. 22, 2025. FDA issued marketing granted orders to six On Plus nicotine pouch products. “As a result of the FDA’s nicotine pouch pilot program, adults who smoke cigarettes and would like to switch to a lower-risk alternative tobacco product will now have an expanded array of options.”. A full list of the 26 nicotine pouch products authorized by the FDA is available on the agency’s website. ### How AI is helping convenience stores price new products. Tobacco### FDA authorizes 6 On Plus nicotine pouches from Altria. Tobacco### FDA authorizes 6 On Plus nicotine pouches from Altria. CSP’s Top 202 details the largest chains in the convenience-store industry and the biggest mergers and acquisition news from the past year. ### Convenience Store Products. The latest information on products and trends in the convenience-store and foodservice industries.",
            "score": 0.19387928,
            "timestamp": "2025-12-29T19:44:27.208345"
          },
          {
            "query": "全球烟草行业变化趋势 传统香烟与新型尼古丁产品替代 监管动态",
            "url": "https://www.ynetnews.com/health_science/article/h1einx00mbx",
            "title": "Crème brûlée and candy-flavored vapes lure teens into nicotine addiction - Ynetnews",
            "content": "## A Hebrew University study finds 14% of adult e-cigarette users never smoked traditional cigarettes; Sweet flavors like caramel and Oreo are strongly linked to disposable vape use, raising concerns over youth targeting and long-term health risks. About 14% of adults who use e-cigarettes, particularly disposable devices, have never smoked a traditional cigarette, and a clear link was found between a preference for sweet flavors and the use of disposable products. The study found that in the U.S., a preference for sweet flavors, including fruit, candy and caramel, was strongly linked to the use of disposable e-cigarettes. Unlike traditional cigarettes, e-cigarettes lack a clear beginning or end, Bar-Zeev explained, “so users can vape throughout the day.” This, along with a lack of public awareness that under Israeli law vaping is banned in all places where smoking is prohibited — including restaurants, buses, trains and other enclosed spaces — has contributed to increased usage. “In Israel and around the world, it's mostly teens and young adults who use e-cigarettes,” said Bar-Zeev.",
            "score": 0.11663337,
            "timestamp": "2025-12-29T19:44:27.208370"
          },
          {
            "query": "全球烟草行业变化趋势 传统香烟与新型尼古丁产品替代 监管动态",
            "url": "https://www.pmg-ky1.com/spencer_magnet/agricultural-economic-updates-part-2/article_1af28091-3d04-58b3-8d90-3b62b0d7a8af.html",
            "title": "Agricultural Economic Updates, Part 2 - pmg-ky1.com",
            "content": "You have permission to edit this article. ### Today's e-Edition. “But I also think we’ve got to recognize how strong demand for proteins is right now.”. “While cigarette sales in the U.S. continue to decline at an accelerated rate, a short 2025 burley crop, coupled with recent cigarette export growth and tariff protection on leaf imports, is providing some revitalized support for the waning burley sector,” said Snell. Snell added that dark-fired tobacco has seen a third year of deep volume cuts as the industry adjusts to the new smokeless market, where consumers are switching to products like nicotine pouches and vapes that do not use Kentucky dark tobaccos. “Fruits, vegetables, nursery, greenhouse, floriculture, cut flowers, on-farm retailing and farmers’ markets, and CSAs (community supported agriculture) are all continuing to expand. Woods projects income from nursery crops, floriculture and produce to be firmly between $300 to $325 million by year’s end, as Kentucky improves its ability to supply local markets.",
            "score": 0.07999034,
            "timestamp": "2025-12-29T19:44:27.208376"
          },
          {
            "query": "全球烟草行业变化趋势 传统香烟与新型尼古丁产品替代 监管动态",
            "url": "https://www.hydrocarbonengineering.com/petrochemicals/24122025/icis-global-chemical-markets-brace-for-structural-upheaval-as-trade-tensions-intensify/amp/",
            "title": "ICIS: global chemical markets brace for structural upheaval as trade tensions intensify - Hydrocarbon Engineering",
            "content": "4. ICIS: global chemical markets brace for structural upheaval as trade tensions intensify. # ICIS: global chemical markets brace for structural upheaval as trade tensions intensify. Will Beacham, Deputy Editor, ICIS Chemical Business, explains that the global chemical industry is entering a period of profound uncertainty as higher tariffs and escalating trade tensions threaten to dismantle decades of globalisation. Since US President Trump’s 2 April 2025 Liberation Day marked the start of the latest trade war, major economies have struggled with slow or stagnant economic growth, while chemical producers face low prices, margins and disrupted supply chains. European producers, already under pressure from weak demand, face additional challenges as the pending US-EU trade deal could eliminate tariffs on US finished goods and chemicals such as polyethylene (PE), which is currently subject to a 6.5% tariff. For chemical producers, the next decade will demand agility, innovation, and a willingness to rethink the fundamentals of their business models.",
            "score": 0.040438388,
            "timestamp": "2025-12-29T19:44:27.208381"
          },
          {
            "query": "全球烟草行业变化趋势 传统香烟与新型尼古丁产品替代 监管动态",
            "url": "https://www.indexbox.io/blog/gold-market-analysis-for-december-22-key-intra-day-price-entry-levels/",
            "title": "Gold Market Analysis December 22, 2025: Intra-Day Price Entry Levels | Kitco - News and Statistics - IndexBox",
            "content": "Within it, you will discover the latest data on market trends and opportunities by country, consumption, production and price developments, as well as the global trade (imports and exports). 2. PRODUCTION BY COUNTRY: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035). 2. Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035). 3. Market Value: Historical Data (2012–2024) and Forecast (2025–2035). 5. Production, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 9. Exports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 1. Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035). 2. Market Value: Historical Data (2012–2024) and Forecast (2025–2035). Production, In Physical Terms, by Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035).",
            "score": 0.025606656,
            "timestamp": "2025-12-29T19:44:27.208387"
          },
          {
            "query": "全球烟草行业变化趋势 传统香烟与新型尼古丁产品替代 监管动态",
            "url": "https://www.indexbox.io/blog/gold-and-silver-prices-signal-market-caution-after-volatile-trading-week/",
            "title": "Gold & Silver Market Analysis: RSI Signals Caution After Volatility - News and Statistics - IndexBox",
            "content": "Within it, you will discover the latest data on market trends and opportunities by country, consumption, production and price developments, as well as the global trade (imports and exports). 2. PRODUCTION BY COUNTRY: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035). 2. Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035). 3. Market Value: Historical Data (2012–2024) and Forecast (2025–2035). 5. Production, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 9. Exports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 1. Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035). 2. Market Value: Historical Data (2012–2024) and Forecast (2025–2035). Production, In Physical Terms, by Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035).",
            "score": 0.024687458,
            "timestamp": "2025-12-29T19:44:27.208392"
          },
          {
            "query": "全球烟草行业变化趋势 传统香烟与新型尼古丁产品替代 监管动态",
            "url": "https://www.mining-technology.com/features/mining-in-2025-emerging-trends-and-predictions-for-2026/",
            "title": "Mining in 2025: emerging trends and predictions for 2026 - Mining Technology",
            "content": "This year marked a significant change for the global mining industry as it navigated the impact of growing geopolitical tensions on commodity markets while racing to meet calls to decarbonise operations. As the demand for global critical minerals soars, mining operators are also increasingly using transformative technologies to optimise productivity and address challenges across the value chain. “With China’s strong control over rare earths and other key minerals, its export restrictions this year exposed the dependence of global automakers, electronics manufacturers and energy producers on Chinese capacity,” says Gayathri Siripurapu, associate project manager at MINE’s parent company, GlobalData. Rebecca Campbell, global head of mining and metals at White & Case, says that other critical mineral-producing nations such as Indonesia, Chile and many African countries are becoming much more assertive about value capture, pushing for local processing and higher participation from government to build up their industries as a Chinese alternative.",
            "score": 0.021667069,
            "timestamp": "2025-12-29T19:44:27.208397"
          },
          {
            "query": "全球烟草行业转型趋势，新型尼古丁产品市场发展，电子烟与尼古丁袋的消费差异，FDA对新型尼古丁产品的监管措施，替代产品市场如Kratom和7-OH产品的影响",
            "url": "https://www.cspdailynews.com/tobacco/fda-authorizes-6-plus-nicotine-pouches-altria",
            "title": "FDA authorizes 6 On Plus nicotine pouches from Altria - CSP Daily News",
            "content": "Agency issues marketing granted orders under a new pilot program to streamline tobacco product reviews By Diane Adam on Dec. 22, 2025. FDA issued marketing granted orders to six On Plus nicotine pouch products. “As a result of the FDA’s nicotine pouch pilot program, adults who smoke cigarettes and would like to switch to a lower-risk alternative tobacco product will now have an expanded array of options.”. A full list of the 26 nicotine pouch products authorized by the FDA is available on the agency’s website. ### How AI is helping convenience stores price new products. Tobacco### FDA authorizes 6 On Plus nicotine pouches from Altria. Tobacco### FDA authorizes 6 On Plus nicotine pouches from Altria. CSP’s Top 202 details the largest chains in the convenience-store industry and the biggest mergers and acquisition news from the past year. ### Convenience Store Products. The latest information on products and trends in the convenience-store and foodservice industries.",
            "score": 0.9859364,
            "timestamp": "2025-12-29T19:45:38.519997"
          },
          {
            "query": "全球烟草行业转型趋势，新型尼古丁产品市场发展，电子烟与尼古丁袋的消费差异，FDA对新型尼古丁产品的监管措施，替代产品市场如Kratom和7-OH产品的影响",
            "url": "https://www.npr.org/2025/12/29/nx-s1-5633323/kratom-fda-drug-addictive-opioids",
            "title": "Kratom and 7-OH products are widely available. They’re also at the heart of a public health debate. : Short Wave - NPR",
            "content": "**Why kratom is at the heart of a public health debate : Short Wave** **Kratom and 7-OH products are available in many smoke shops. Producer Rachel Carlson joins host Emily Kwong to talk about what could happen this time around, and what scientists know – and don’t know – about kratom and 7-OH. *Listen to every episode of Short Wave sponsor-free and support our work at NPR by signing up for Short Wave+ at* *plus.npr.org/shortwave**.***. # Kratom and 7-OH products are widely available. Kratom and 7-OH products are available in many smoke shops. Kratom and 7-OH products are becoming increasingly popular in the United States. They're available in many smoke shops, but the Food and Drug Administration says certain products are highly addictive — and could lead to the next wave of the opioid epidemic. Following the announcement, there was a massive wave of protest from advocates and lawmakers — including people who said they used kratom products to wean themselves off opioids.",
            "score": 0.8365546,
            "timestamp": "2025-12-29T19:45:38.520019"
          },
          {
            "query": "全球烟草行业转型趋势，新型尼古丁产品市场发展，电子烟与尼古丁袋的消费差异，FDA对新型尼古丁产品的监管措施，替代产品市场如Kratom和7-OH产品的影响",
            "url": "https://www.pmg-ky1.com/spencer_magnet/agricultural-economic-updates-part-2/article_1af28091-3d04-58b3-8d90-3b62b0d7a8af.html",
            "title": "Agricultural Economic Updates, Part 2 - pmg-ky1.com",
            "content": "You have permission to edit this article. ### Today's e-Edition. “But I also think we’ve got to recognize how strong demand for proteins is right now.”. “While cigarette sales in the U.S. continue to decline at an accelerated rate, a short 2025 burley crop, coupled with recent cigarette export growth and tariff protection on leaf imports, is providing some revitalized support for the waning burley sector,” said Snell. Snell added that dark-fired tobacco has seen a third year of deep volume cuts as the industry adjusts to the new smokeless market, where consumers are switching to products like nicotine pouches and vapes that do not use Kentucky dark tobaccos. “Fruits, vegetables, nursery, greenhouse, floriculture, cut flowers, on-farm retailing and farmers’ markets, and CSAs (community supported agriculture) are all continuing to expand. Woods projects income from nursery crops, floriculture and produce to be firmly between $300 to $325 million by year’s end, as Kentucky improves its ability to supply local markets.",
            "score": 0.5525397,
            "timestamp": "2025-12-29T19:45:38.520026"
          },
          {
            "query": "全球烟草行业转型趋势，新型尼古丁产品市场发展，电子烟与尼古丁袋的消费差异，FDA对新型尼古丁产品的监管措施，替代产品市场如Kratom和7-OH产品的影响",
            "url": "https://www.shawangunkjournal.com/news/2025/12/23/kratom-legislation-approved-in-albany/345cLK",
            "title": "Kratom legislation approved in Albany - Shawangunk Journal",
            "content": "# Kratom legislation approved in Albany. ALBANY - New legislation in Albany will tighten the ability to purchase Kratom in New York State. New legislation in Albany will tighten the ability to purchase Kratom in New York State. One of two laws, sponsored by Senator James Skoufis (D, Cornwall) will require all Kratom products sold to have a warning that it is not approved by the FDA, may cause side effects like nausea, aggression, hallucinations, trouble breathing, liver damage and death.”. The law also prevents Kratom products from advertising terms such as “natural” or “all-natural.”. It is something I would want to dig into more to see if that is valid,” he said. A second bill just signed into law will prevent Kratom from being sold to persons under the age of 21. Your **FREE Trial** starts with a complimentary **$1 credit** valid for 30 days. \"A.Cital: I don't doubt the \"vast majority of people commenting to local town boards want...\"— S.",
            "score": 0.007815888,
            "timestamp": "2025-12-29T19:45:38.520032"
          },
          {
            "query": "全球烟草行业转型趋势，新型尼古丁产品市场发展，电子烟与尼古丁袋的消费差异，FDA对新型尼古丁产品的监管措施，替代产品市场如Kratom和7-OH产品的影响",
            "url": "https://www.manilatimes.net/2025/12/24/tmt-newswire/globenewswire/the-new-vice-economy-5-stocks-profiting-from-the-shift-to-clean-fuel/2249276",
            "title": "The 'New Vice' Economy: 5 Stocks Profiting from the Shift to Clean Fuel - The Manila Times",
            "content": "This consumer-led transformation is positioning several innovative companies to capitalize on the wellness revolution, including **Doseology Sciences Inc.** (CSE: MOOD) (OTCPK:DOSEF) (FSE: VU70), **Philip Morris International** (NYSE: PM), **Canopy Growth Corporation** (NASDAQ: CGC) (TSX: WEED), **Zevia PBC** (NYSE: ZVIA), and **Lifeway Foods** (NASDAQ: LWAY). **Doseology Sciences Inc.** (CSE: MOOD) (OTCPK:DOSEF) (FSE: VU70) is a biotechnology-driven company developing oral delivery platforms for modern stimulants, positioning itself within a consumer shift away from traditional energy drinks, vapes, and cigarettes toward formats designed for precision, control, and convenience. Mimran's three-year advisory agreement, valued at $400,000 in restricted share units, reflects his commitment to supporting **Doseology's** roadmap as the company develops pouch-based products for professionals, students, and wellness consumers seeking clean, functional stimulation without pills, sugar, or smoke.",
            "score": 0.0047552,
            "timestamp": "2025-12-29T19:45:38.520038"
          },
          {
            "query": "全球烟草行业转型趋势，新型尼古丁产品市场发展，电子烟与尼古丁袋的消费差异，FDA对新型尼古丁产品的监管措施，替代产品市场如Kratom和7-OH产品的影响",
            "url": "https://www.law360.com/productliability/articles/2424258?utm_source=rss&utm_medium=rss&utm_campaign=section",
            "title": "Vape Cos. Get Partial Block Of Va. Law, But Claims Trimmed - Law360",
            "content": "# Law360. ## The Practice of Law. Access to Justice   Aerospace & Defense   Appellate   Asset Management   Banking   Bankruptcy   Benefits   California   Cannabis   Capital Markets   Class Action   Colorado   Commercial Contracts   Competition   Compliance   Connecticut   Construction   Consumer Protection   Corporate   Criminal Practice   Cybersecurity & Privacy   Delaware   Employment. # Law360 Pulse. ## Business of Law. California Pulse Connecticut Pulse Courts DC Pulse Daily Litigation Delaware Pulse. # Law360 Authority. ## Law360 UK. Intellectual Property Securities Bankruptcy Competition Employment White Collar Legal Industry Access To Justice Law360 UK Pulse || See all sections ||. By Mike Curley ( December 22, 2025, 2:30 PM EST) -- A Virginia federal judge has agreed to halt enforcement of certain provisions of a state law barring the sale of vapes that are not yet approved by the U.S. Food and Drug Administration, while dismissing two of the three claims vape companies had brought in the lawsuit.... ### Law360 is on it, so you are, too.",
            "score": 0.0015700475,
            "timestamp": "2025-12-29T19:45:38.520044"
          },
          {
            "query": "全球烟草行业转型趋势，新型尼古丁产品市场发展，电子烟与尼古丁袋的消费差异，FDA对新型尼古丁产品的监管措施，替代产品市场如Kratom和7-OH产品的影响",
            "url": "https://www.ynetnews.com/health_science/article/h1einx00mbx",
            "title": "Crème brûlée and candy-flavored vapes lure teens into nicotine addiction - Ynetnews",
            "content": "## A Hebrew University study finds 14% of adult e-cigarette users never smoked traditional cigarettes; Sweet flavors like caramel and Oreo are strongly linked to disposable vape use, raising concerns over youth targeting and long-term health risks. About 14% of adults who use e-cigarettes, particularly disposable devices, have never smoked a traditional cigarette, and a clear link was found between a preference for sweet flavors and the use of disposable products. The study found that in the U.S., a preference for sweet flavors, including fruit, candy and caramel, was strongly linked to the use of disposable e-cigarettes. Unlike traditional cigarettes, e-cigarettes lack a clear beginning or end, Bar-Zeev explained, “so users can vape throughout the day.” This, along with a lack of public awareness that under Israeli law vaping is banned in all places where smoking is prohibited — including restaurants, buses, trains and other enclosed spaces — has contributed to increased usage. “In Israel and around the world, it's mostly teens and young adults who use e-cigarettes,” said Bar-Zeev.",
            "score": 0.0013858178,
            "timestamp": "2025-12-29T19:45:38.520050"
          }
        ],
        "latest_summary": "## 核心事件概述\n吸烟作为一种全球性公共卫生问题，其历史可追溯至数百年前，如今已演变为一个涉及经济、社会和健康多层面的复杂议题。根据最新市场数据，全球烟草行业正经历深刻变革，传统香烟销售持续下滑，而新型尼古丁产品如电子烟、尼古丁袋等迅速崛起，重塑了全球消费格局。这一转变不仅反映了消费者偏好的变化，也体现了烟草行业为应对监管压力和健康意识提高而进行的战略调整。\n\n## 多方报道分析\n不同国家和地区的烟草消费模式呈现显著差异。研究显示，\"美国和以色列在电子烟使用行为上存在关键差异。在以色列，一次性电子烟更常见，与更大的感知危害相关，并且在实体店中可获得性更高\"。相比之下，\"美国的一次性电子烟与甜味偏好和过去使用烟草或尼古丁产品更强烈相关。使用一次性电子烟的美国人过去吸烟的可能性是普通人的7倍\"。这种差异反映了不同文化背景下消费者对尼古丁产品的接受度和使用习惯。\n\n监管机构也在积极应对这一变化。FDA已\"授权了Altria的6 Plus尼古丁袋\"，并\"在1月份向20种Zyn调味尼古丁袋发布了营销授权令\"。菲利普莫里斯国际(PMI)在2022年收购了Zyn制造商瑞典北美公司，显示传统烟草公司正积极转型至新型尼古丁产品市场。同时，\"FDA将密切监控这些产品的营销方式\"，要求\"Helix Innovations必须跟踪、测量和报告给FDA这些产品预防青少年的措施有效性\"，表明监管机构对新型尼古丁产品的关注重点已转向青少年保护。\n\n## 关键数据提取\n烟草经济数据揭示了行业的显著变化：\"烟草生产价值预计在2025年再次下降，但可能在2026年稳定在约2亿美元左右，而30年前超过8亿美元\"。这表明烟草行业规模已大幅萎缩，仅为其历史峰值的四分之一左右。\n\n关于产品替代趋势，\"美国香烟销售继续加速下降，但2025年白肋烟作物减产、最近香烟出口增长以及对进口烟叶的关税保护，为衰退的白肋烟部门提供了一些支持\"。同时，\"黑烟叶已连续第三年大幅减产，因为行业正在适应新的无烟市场，消费者转向尼古丁袋和电子烟等产品\"。值得注意的是，\"黑烟叶库存如此之低，合同量可能在2026年稳定或适度增加\"，表明市场可能正在接近新的平衡点。\n\n全球市场覆盖范围广泛，报告包含\"200个国家的统计数据，包括50个最大消费国家的详细资料\"，数据覆盖\"全球市场量和价值、人均消费、中期市场动态预测、全球生产和贸易等\"。主要消费国家包括\"美国、中国、日本、德国、英国、法国、巴西、意大利、俄罗斯、印度\"等，反映了烟草消费的全球分布特点。\n\n## 深度背景分析\n吸烟问题的历史根源可追溯至15世纪末哥伦布发现美洲大陆后烟草的传播。最初作为药用植物，烟草逐渐演变为社交和娱乐用品，并在20世纪达到消费高峰。随着科学研究的深入，吸烟与各种疾病的关联被证实，全球开始实施控烟措施。\n\n经济层面，烟草行业经历了从快速增长到逐步萎缩的转变。传统烟草公司面临双重压力：一方面是健康意识提高导致的消费减少，另一方面是监管趋严带来的成本增加。为应对这一挑战，烟草巨头正积极转型，\"菲利普莫里斯国际(PMI)在2022年收购了Zyn制造商瑞典北美公司\"就是典型案例。\n\n社会层面，尼古丁产品的使用模式正在发生变化。特别是青少年群体，\"尼古丁影响大脑发育，可能永久改变青少年的大脑结构。尼古丁增加对其他成瘾的易感性，通常被称为'入门药物'。由于电子烟可以整天使用，使用者经常接触高水平的尼古丁\"。这引发了公共卫生专家对新型尼古丁产品可能成为青少年\"入门药物\"的担忧。\n\n此外，替代产品市场正在兴起。\"Kratom和7-OH产品在美国越来越受欢迎，在许多烟店都有售。FDA表示某些产品高度成瘾，可能导致阿片类药物流行病的下一波\"。FDA今年早些时候建议\"将某些7-OH产品与阿片类药物一起列入管制清单\"，表明监管机构正密切关注这一新兴市场。\n\n## 发展趋势判断\n基于现有数据，全球烟草行业未来发展趋势可能呈现以下特点：\n\n1. 传统烟草产品持续萎缩，但速度可能放缓。数据显示\"黑烟叶库存如此之低，合同量可能在2026年稳定或适度增加\"，表明市场可能正在接近新的平衡点。\n\n2. 新型尼古丁产品将继续增长，但监管将趋严。FDA已开始\"密切监控这些产品的营销方式\"，未来可能会有更多针对电子烟和尼古丁袋的监管措施出台，特别是针对青少年保护方面的规定。\n\n3. 区域差异将进一步扩大。不同国家和地区基于文化、经济和监管环境的不同，将发展出独特的尼古丁产品消费模式，如以色列更倾向于一次性电子烟，而美国则与甜味偏好和既往烟草使用相关。\n\n4. 替代产品市场将扩大。\"Kratom和7-OH产品在美国越来越受欢迎\"，表明消费者对尼古丁替代品的需求正在增长，这可能成为未来市场的一个重要发展方向，同时也带来新的监管挑战。\n\n5. 全球控烟框架将不断完善。随着《世界卫生组织烟草控制框架公约》的进一步实施，各国将加强控烟措施，包括提高税收、限制广告和扩大无烟区等。\n\n6. 地缘政治因素将影响全球烟草贸易。随着全球贸易紧张局势加剧，烟草行业也将面临\"结构性的剧变\"，各国可能采取更多保护主义措施，影响全球烟草供应链。\n\n综合来看，全球吸烟问题正处于转型关键期，传统烟草产品逐渐被新型尼古丁产品替代，监管框架也在不断调整。这一转变既带来挑战，也创造机遇，需要政策制定者、公共卫生专家和产业界共同应对，以实现减少烟草危害和保护公众健康的目标。",
        "reflection_iteration": 2,
        "is_completed": true
      },
      "order": 0
    },
    {
      "title": "吸烟的健康影响",
      "content": "详细分析吸烟对人体的各种危害，包括对呼吸系统、心血管系统、癌症风险的影响，以及二手烟对非吸烟者的危害。讨论不同吸烟量与疾病风险之间的关系。",
      "research": {
        "search_history": [
          {
            "query": "吸烟健康影响 呼吸系统 心血管系统 癌症风险 二手烟 吸烟量与疾病关系",
            "url": "https://scitechdaily.com/just-one-drink-a-day-linked-to-50-higher-mouth-cancer-risk-in-india/",
            "title": "Just One Drink a Day Linked to 50% Higher Mouth Cancer Risk in India - SciTechDaily",
            "content": "People with cancer had used tobacco for longer periods on average, about 21 years compared with roughly 18 years among controls. They were also more likely to live in rural areas and to consume more alcohol daily, nearly 37 g on average versus about 29 g in the control group.\n\nFrequent alcohol use was strongly associated with a higher risk of buccal mucosa cancer. Locally brewed drinks were linked to the greatest increase in risk. [...] #### Untangling Alcohol and Tobacco Risks\n\nAlcohol use and tobacco consumption often occur together, making it difficult to determine how much each factor independently contributes to cancer risk. This is especially challenging in India, where smokeless tobacco use is widespread, the researchers explain. In addition, the potential health effects of locally brewed alcohol, which is widely consumed in rural areas, have not been well studied. [...] Alcohol contributed to increased cancer risk regardless of how long a person had used tobacco. The researchers suggest that ethanol may change the fat content of the mouth’s inner lining, making it more permeable and more vulnerable to carcinogens found in chewing tobacco products.",
            "score": 0.3647776,
            "timestamp": "2025-12-29T19:47:02.835942"
          },
          {
            "query": "吸烟健康影响 呼吸系统 心血管系统 癌症风险 二手烟 吸烟量与疾病关系",
            "url": "https://www.nature.com/articles/s41598-025-28593-3",
            "title": "Oropharyngeal Helicobacter pylori colonization increases risk and worsens prognosis of head and neck squamous cell carcinoma - Nature",
            "content": "positivity (HR = 1.85, P = 0.011), and longer smoking history (HR = 1.06, P = 0.042) were identified as independent risk factors for HNSCC onset (Table 4). These findings suggest that oropharyngeal H. pylori colonization is an important modifiable factor associated with cancer development in at-risk individuals. Notably, among the 15 incident HNSCC cases in Cohort 1 who were positive for oropharyngeal H. pylori at baseline, 12 (80.0%) were also found to have H. pylori present in their [...] A total of 440 participants were enrolled, comprising 220 high-risk individuals (Cohort 1) and 220 patients diagnosed with head and neck squamous cell carcinoma (HNSCC; Cohort 2). Independent-samples t tests and χ² tests revealed significant differences in age, smoking duration, and HPV positivity between the two cohorts (all P < 0.05), while no significant differences were observed in sex, current smoking status, alcohol use duration, comorbidities, or occupational exposure (all P > 0.05) [...] After screening and enrollment, all participants underwent a detailed questionnaire and physical examination. The survey covered basic demographic information such as age, sex, ethnicity, and education level; personal lifestyle habits including tobacco use, alcohol consumption and duration; family history of head and neck or other tumors in first- and second-degree relatives; occupational exposure to dust, chemicals, high temperatures, or radioactive materials; and comorbidities such as",
            "score": 0.33458945,
            "timestamp": "2025-12-29T19:47:02.835980"
          },
          {
            "query": "吸烟健康影响 呼吸系统 心血管系统 癌症风险 二手烟 吸烟量与疾病关系",
            "url": "https://www.oregonlive.com/advice/2025/12/dear-doctor-how-often-should-people-older-than-65-get-the-rsv-vaccination.html",
            "title": "Dear Doctor: How often should people older than 65 get the RSV vaccination? - OregonLive.com",
            "content": "Finally, the best way by far to prevent lung cancer is to quit smoking as soon as possible. If you are a smoker, your doctor has many ways to help you quit. Calling a quit line, such as 800-QUIT-NOW, will connect you with your state service. You can also text QUITNOW to 333888, and there are web-based programs such as Smokefree.gov and apps like quitSTART from the National CANCER Institute. [...] You are also right to think that a CT scan might be more useful. Studies have shown that for a subset of people who are at a high risk, screening with a CT scan does lead to a reduction in lung cancer deaths. Specifically, lung cancer screening should be considered for people between the ages of 50-80 (Medicare will pay up to age 77) who are in generally good health; those who have smoked at least 20 “pack years” (such as a pack a day for 20 years, two packs a day for 10 years, or a half pack a [...] day for 40 years); and those who currently smoke or have quit within the past 15 years.",
            "score": 0.2991052,
            "timestamp": "2025-12-29T19:47:02.835997"
          },
          {
            "query": "吸烟健康影响 呼吸系统 心血管系统 癌症风险 二手烟 吸烟量与疾病关系",
            "url": "https://scitechdaily.com/your-drinking-habits-may-raise-cancer-risk-more-than-you-think/",
            "title": "Your Drinking Habits May Raise Cancer Risk More Than You Think - SciTechDaily",
            "content": "Reference: “A systematic review on the risk of developing cancer and frequency of alcohol consumption behaviors in US adults” by Isabella Abraham, Gabriella Dasilva, Kayla Ernst, Alexandra Campson, Alana Starr, Christine Kamm, George Kosseifi, Morgan Decker, Sahar Kaleem, Nada Eldawy, Paige Brinzo, Tiffany Follin, Christine Ramdin, Maria Mejia, Lewis S. Nelson and Lea Sacca, 13 November 2025, Cancer Epidemiology.  \n DOI: 10.1016/j.canep.2025.102956 [...] Reply\n\nLeave A Reply Cancel Reply [...] “Recognizing how these forces intersect – shaping exposure, vulnerability and long-term health outcomes – is essential for building a more accurate understanding of cancer risk. This broader perspective reminds us that effective prevention goes beyond reducing alcohol consumption; it requires addressing the environments, habits and underlying health conditions that magnify its impact.”",
            "score": 0.083890386,
            "timestamp": "2025-12-29T19:47:02.836009"
          },
          {
            "query": "吸烟健康影响 呼吸系统 心血管系统 癌症风险 二手烟 吸烟量与疾病关系",
            "url": "https://www.aol.com/articles/m-dermatologist-always-tell-person-110000964.html",
            "title": "I’m a dermatologist — how I know if a person will be more wrinkly when they get older - AOL.com",
            "content": "Baking in the sun is lousy for your skin, but smoking is often considered worse because it narrows blood vessels, breaks down collagen and elastin and amplifies sun damage.\n\nNicotine constricts blood vessels, limiting the flow of oxygen and essential nutrients to the skin.\n\n“If the person is smoking — although there are a lot of genetic and environmental factors at play — they’re more likely to have thinner skin and wrinkles, especially around their mouth,” Kobets said. [...] Thanks for signing up.\n\nThank you for signing up. You will receive a confirmation email shortly.\n\nStay informed with a handpicked selection of the day's top AOL stories, delivered to your inbox.\n\n#### In Other News\n\nEntertainment\n\nEntertainment\n\nUSA TODAY\n\n##### Notable celebrity deaths of 2025 – Rob Reiner, Anne Burrell, more\n\nEntertainment\n\nUSA TODAY\n\n##### Neil Diamond's 10 best songs to go along with 'Song Sung Blue' movie\n\nFinance\n\nFinance\n\nAssociated Press Finance [...] That’s a nice way to describe “smoker’s face,” a phenomenon characterized by deep wrinkles around the eyes and lips from the smoker constantly drawing on cigarettes and repeatedly squinting to keep smoke out of their eyes.\n\nSmokers also often suffer from sagging skin, a dull, yellowish-gray complexion and premature contours.\n\nAdvertisement\n\nAdvertisement\n\nDon't miss our daily roundup.\n\nStay informed with a handpicked selection of the day's top AOL stories, delivered to your inbox.",
            "score": 0.06608538,
            "timestamp": "2025-12-29T19:47:02.836021"
          },
          {
            "query": "吸烟健康影响 呼吸系统 心血管系统 癌症风险 二手烟 吸烟量与疾病关系",
            "url": "https://www.ladbible.com/news/health/heart-surgeon-avoid-food-drink-heart-health-690012-20251227",
            "title": "Heart surgeon explains things that ‘actively poison’ your body and why you should ‘absolutely avoid’ them - LADbible",
            "content": "The six things he avoids include guzzling fizzy drinks, gargling with alcohol-infused products, and chowing down on certain foods.\n\n## Smoking and vaping\n\nThe heart doctor confessed that smoking is 'the worst thing you can do for yourself'. The act itself is especially worse for certain people, the expert revealed.\n\n“If you already have a history of heart disease and have a propensity to atherosclerosis, it actually accelerates that process exponentially,” Dr London warned.\n\nAdvert [...] Home\n\n> \nNews\n\n> \nHealth\n\n# Heart surgeon explains things that ‘actively poison’ your body and why you should ‘absolutely avoid’ them\n\n## Something to think about as we head into the New Year and beyond\n\nElla Scott\n\nHealth experts have often poured years into their studies and come to the table with decades-worth of experience - so you can trust them when they say something is bad for you. [...] Dr Jeremy London, a board certified cardiothoracic surgeon with over 25 years of clinical experience, is a social media favourite known for giving out sage advice on heart health. His recent videos explore the benefits of waking up early to revealing the effects of smoking weed regularly, and what he eats every day to keep his organs ticking.",
            "score": 0.063714996,
            "timestamp": "2025-12-29T19:47:02.836034"
          },
          {
            "query": "吸烟健康影响 呼吸系统 心血管系统 癌症风险 二手烟 吸烟量与疾病关系",
            "url": "https://www.ladbible.com/news/health/heart-attack-morning-habit-rushing-doctor-warning-080357-20251222",
            "title": "Doctor warns 90% of heart attacks begin with common morning habit - LADbible",
            "content": "While you might not understand exactly what that means, Dr Sadoxai says: \"This one habit secretly accelerates insulin resistance, belly fat accumulation, high blood pressure, silent inflammation, and metabolic dysfunction, all of which dramatically increase the risk of early heart attacks, especially if you are overweight or obese.\"\n\nAccording to both the NHS and the British Heart Foundation, being obese significantly increases your chance of having a heart attack. [...] Featured Image Credit: Getty Stock Images\n\nTopics: Health, Viral, TikTok\n\nEmma Rosemurgey\n\nEmma is an NCTJ accredited journalist who recently rejoined LADbible as a Trends Writer. She previously worked on Tyla and UNILAD, before going on to work at the Mirror Online. Contact her via (/cdn-cgi/l/email-protection#8feae2e2eea1fde0fceae2fafde8eaf6cfe3eeebede6ede3eae8fde0faffa1ece0e2)\n\n## Choose your content: [...] ## Dr Sana Sadoxai is urging people to take control of their health before they become at risk of a heart attack\n\nEmma Rosemurgey\n\nKeeping on top of your health can feel overwhelming and complicated, but according to one doctor, there's a very simple change you can make to have a huge impact on your overall health and reduce the risk of a heart attack.",
            "score": 0.058345836,
            "timestamp": "2025-12-29T19:47:02.836047"
          },
          {
            "query": "吸烟健康影响 呼吸系统 心血管系统 癌症风险 二手烟 吸烟量与疾病关系",
            "url": "https://metro.co.uk/2025/12/27/ultra-processed-foods-linked-increased-risk-lung-cancer-25852217/",
            "title": "Ultra-processed foods linked with increased risk of lung cancer - Metro.co.uk",
            "content": "Lung cancer is one of the most common variants of the disease worldwide, with more than 43,000 diagnoses every year in the UK alone, according to the NHS.\n\nIt normally displays no symptoms in its early stages, but the first signs picked up can include breathlessness, coughing up blood and unexplained tiredness.\n\n## Sign up for all of the latest stories\n\nStart your day informed with Metro's News Updates newsletter or get Breaking News alerts the moment it happens. [...] Ultra-processed foods (UPFs) – such as processed sauces, crisps, processed meats and many ready meals – have previously been linked to more than 30 harmful effects, including heart disease, type 2 diabetes and shorter life expectancy.\n\nHowever, a new study carried out by the research journal Thorax has added lung cancer to the list of potential risks associated with the consumption of UPFs. [...] This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Your information will be used in line with our Privacy Policy",
            "score": 0.017917344,
            "timestamp": "2025-12-29T19:47:02.836057"
          },
          {
            "query": "吸烟健康影响 呼吸系统 心血管系统 癌症风险 二手烟 吸烟量与疾病关系",
            "url": "https://www.ynetnews.com/health_science/article/rklulsrmbl",
            "title": "Oral sex and cancer risk: what you need to know about HPV - Ynetnews",
            "content": "Updates Red Mail\n\nTel Aviv-Jaffa\n\nMain\n\nIsrael News\n\nMideast & World News\n\nTech & Digital\n\nReal Estate\n\nFinance\n\nLifestyle\n\nHealth & Science\n\nJewish World\n\nTravel\n\nMore\n\nChannels\n\n Opinions\n Magazine\n Sports\n Food\n Weather\n Podcasts\n\nSites & Sources\n\n Ynet\n Calcalist\n yad2\n ynetespanol\n Вести\n mynet\n\nContact\n\n Contact us\n Privacy Policy\n Terms of Use\n Accessibility Statement\n\n# Oral sex and cancer risk: what you need to know about HPV [...] Oral and pharyngeal cancers are among the most common worldwide and in Israel. While smoking and alcohol remain major risk factors, recent studies show that HPV-related cancer of the tonsils and base of the tongue, the oropharynx, has become an increasingly significant cause of disease. Some data indicate that HPV-related oral and pharyngeal cancer in men is now more common than cervical cancer in women. [...] The study, led by researchers from the otolaryngology department at Rambam Health Care Campus and involving cancer centers in Italy, Australia, Brazil, Germany, India, the United States and Taiwan, showed that cancer-related mortality fell by 12% in the past decade, from 31% to 19%, compared with the previous decade. This decline occurred despite patients being older and having more advanced disease: 14% were over age 70, up from 10%, and 55% had advanced cancer, compared with 45% previously.",
            "score": 0.017309094,
            "timestamp": "2025-12-29T19:47:02.836063"
          },
          {
            "query": "吸烟健康影响 呼吸系统 心血管系统 癌症风险 二手烟 吸烟量与疾病关系",
            "url": "https://www.nature.com/articles/s41434-025-00586-x",
            "title": "Secondary malignancy of T-cell origin after CAR T-cell therapy: EMA’s conclusions from the evaluation of 38 suspected cases - Nature",
            "content": "### Competing interests\n\nThe authors declare no competing interests.\n\n## Additional information\n\nPublisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\n## Rights and permissions [...] Article  PubMed  PubMed Central   Google Scholar\n27. García-Abeijon P, Costa C, Taracido M, Herdeiro MT, Torre C, Figueiras A. Factors associated with underreporting of adverse drug reactions by health care professionals: a systematic review update. Drug Saf. 2023;46:625–36.\n\n    Article  PubMed  PubMed Central   Google Scholar\n28. Hanahan D, Weinberg RA. Hallmarks of cancer: the next generation. Cell. 2011;144:646–74. [...] Search author on:PubMed Google Scholar\n12. Justina Januskiene\n\n    View author publications\n\n    Search author on:PubMed Google Scholar\n13. Maria Mantziri\n\n    View author publications\n\n    Search author on:PubMed Google Scholar\n14. Bianca Mulder\n\n    View author publications\n\n    Search author on:PubMed Google Scholar\n15. Frederika A. van Nimwegen\n\n    View author publications\n\n    Search author on:PubMed Google Scholar\n16. Daiana Vasilcanu\n\n    View author publications",
            "score": 0.01697999,
            "timestamp": "2025-12-29T19:47:02.836070"
          },
          {
            "query": "电子烟健康影响长期研究",
            "url": "https://www.ynetnews.com/health_science/article/h1einx00mbx",
            "title": "Crème brûlée and candy-flavored vapes lure teens into nicotine addiction - Ynetnews",
            "content": "## A Hebrew University study finds 14% of adult e-cigarette users never smoked traditional cigarettes; Sweet flavors like caramel and Oreo are strongly linked to disposable vape use, raising concerns over youth targeting and long-term health risks. About 14% of adults who use e-cigarettes, particularly disposable devices, have never smoked a traditional cigarette, and a clear link was found between a preference for sweet flavors and the use of disposable products. The study found that in the U.S., a preference for sweet flavors, including fruit, candy and caramel, was strongly linked to the use of disposable e-cigarettes. Unlike traditional cigarettes, e-cigarettes lack a clear beginning or end, Bar-Zeev explained, “so users can vape throughout the day.” This, along with a lack of public awareness that under Israeli law vaping is banned in all places where smoking is prohibited — including restaurants, buses, trains and other enclosed spaces — has contributed to increased usage. “In Israel and around the world, it's mostly teens and young adults who use e-cigarettes,” said Bar-Zeev.",
            "score": 0.83973396,
            "timestamp": "2025-12-29T19:48:31.940283"
          },
          {
            "query": "电子烟健康影响长期研究",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "# Service to help young people quit vaping. A service to help young people in Guernsey to stop vaping is set to finish at the end of the month. * More news stories for Guernsey. The States of Guernsey said 29 people had downloaded an official self-help booklet and \"discussions are ongoing regarding the future delivery of the service\". Alex Hawkins-Drew, associate director of Public Health, said the pilot allowed \"young people who want to stop vaping [to] have access to the right support, whether that's self-help resources, face-to-face guidance, or more intensive interventions\". Aaron Davies, service manager at Action for Children, said the pilot had shown that there was \"some great evidence and potential of positive change for young people who have engaged in the service reducing their vaping use\". He added: \"The reality is that, as accessibility to vaping products decreases for young people, having a service in place in our community that is ready to provide support is incredible.\". * Service starts to help young people quit vapes.",
            "score": 0.00087617995,
            "timestamp": "2025-12-29T19:48:31.940313"
          },
          {
            "query": "电子烟健康影响长期研究",
            "url": "https://www.cspdailynews.com/tobacco/fda-authorizes-6-plus-nicotine-pouches-altria",
            "title": "FDA authorizes 6 On Plus nicotine pouches from Altria - CSP Daily News",
            "content": "Agency issues marketing granted orders under a new pilot program to streamline tobacco product reviews By Diane Adam on Dec. 22, 2025. FDA issued marketing granted orders to six On Plus nicotine pouch products. “As a result of the FDA’s nicotine pouch pilot program, adults who smoke cigarettes and would like to switch to a lower-risk alternative tobacco product will now have an expanded array of options.”. A full list of the 26 nicotine pouch products authorized by the FDA is available on the agency’s website. ### How AI is helping convenience stores price new products. Tobacco### FDA authorizes 6 On Plus nicotine pouches from Altria. Tobacco### FDA authorizes 6 On Plus nicotine pouches from Altria. CSP’s Top 202 details the largest chains in the convenience-store industry and the biggest mergers and acquisition news from the past year. ### Convenience Store Products. The latest information on products and trends in the convenience-store and foodservice industries.",
            "score": 0.00079008617,
            "timestamp": "2025-12-29T19:48:31.940327"
          },
          {
            "query": "电子烟健康影响长期研究",
            "url": "https://www.law360.com/productliability/articles/2424258?utm_source=rss&utm_medium=rss&utm_campaign=section",
            "title": "Vape Cos. Get Partial Block Of Va. Law, But Claims Trimmed - Law360",
            "content": "# Law360. ## The Practice of Law. Access to Justice   Aerospace & Defense   Appellate   Asset Management   Banking   Bankruptcy   Benefits   California   Cannabis   Capital Markets   Class Action   Colorado   Commercial Contracts   Competition   Compliance   Connecticut   Construction   Consumer Protection   Corporate   Criminal Practice   Cybersecurity & Privacy   Delaware   Employment. # Law360 Pulse. ## Business of Law. California Pulse Connecticut Pulse Courts DC Pulse Daily Litigation Delaware Pulse. # Law360 Authority. ## Law360 UK. Intellectual Property Securities Bankruptcy Competition Employment White Collar Legal Industry Access To Justice Law360 UK Pulse || See all sections ||. By Mike Curley ( December 22, 2025, 2:30 PM EST) -- A Virginia federal judge has agreed to halt enforcement of certain provisions of a state law barring the sale of vapes that are not yet approved by the U.S. Food and Drug Administration, while dismissing two of the three claims vape companies had brought in the lawsuit.... ### Law360 is on it, so you are, too.",
            "score": 0.0004399033,
            "timestamp": "2025-12-29T19:48:31.940343"
          },
          {
            "query": "电子烟健康影响长期研究",
            "url": "https://www.nature.com/articles/s41562-025-02361-9",
            "title": "Homophobia, economic precarity and the well-being of sexual and gender diverse people in a 153-country survey - Nature",
            "content": "Health Sex.* **19**, 32–49 (2017). Health* **53**, 791–793 (2013). H. Prejudice, social stress, and mental health in lesbian, gay, and bisexual populations: conceptual issues and research evidence. Health* **15**, 105–107 (2017). Health* **23**, 5–23 (2022). Minority stress, activism, and health in the context of economic precarity: results from a national participatory action survey of lesbian, gay, bisexual, transgender, queer, and gender non-conforming youth. (1982)* **66**, 1733–1749 (2008). Health Sex.* **22**, 398–412 (2020). Online socializing among men who have sex with men and transgender people in Nairobi and Johannesburg and implications for public health-related research and health promotion: an analysis of qualitative and respondent-driven sampling survey data. Hidden from health: structural stigma, sexual orientation concealment, and HIV across 38 countries in the European MSM Internet Survey. *The Global Internet Survey on Happiness, Health and Well-Being among Sexual and Gender Minority: Design and Methods* Working Paper (UNAIDS, 2023). E.L., S.H. and B.V. conceptualized the Global LGBTQ+ Happiness Survey.",
            "score": 0.0002919395,
            "timestamp": "2025-12-29T19:48:31.940358"
          },
          {
            "query": "电子烟健康影响长期研究",
            "url": "https://www.nytimes.com/2025/12/27/science/trump-wildfires-vance-epa.html",
            "title": "She Studied the Health Effects of Wildfires, Until the E.P.A. Cut Her Grant - The New York Times",
            "content": "Marina Vance had an E.P.A. grant to help homeowners counter the impact of wildfire smoke, until the agency deemed the research “no longer consistent” with its priorities. **Marina Vance:** I’ve been working on air quality since I was an undergraduate student in Brazil — for more than 20 years. I was at Virginia Tech for eight years for my Ph.D and as a postdoctoral researcher, and then I came to the University of Colorado in 2016. If there’s a wildfire, you’re going into your home and you’re going close all the doors and the windows. If we deploy an air cleaner in this room, how well will it do with the wildfire smoke? I can’t imagine something more related to the E.P.A.’s mission than understanding wildfires and protecting people in their homes. This is the kind of research that can have direct and immediate impact — not 10 or 20 years in the future, but this year, when the next wildfire hits.",
            "score": 0.0001482583,
            "timestamp": "2025-12-29T19:48:31.940374"
          },
          {
            "query": "电子烟健康影响长期研究",
            "url": "https://www.nature.com/articles/s41366-025-01961-9",
            "title": "Impact of ultra-processed foods on short-term appetite regulation: Does body mass index make a difference? - Nature",
            "content": "# Impact of ultra-processed foods on short-term appetite regulation: Does body mass index make a difference? Limited studies have examined the effects of meals containing processed foods or ultra-processed foods (UPF) on appetite regulation and results were inconsistent and difficult to generalize. Therefore, the study aimed to evaluate the potential efficacy of two different breakfasts containing processed foods or UPF on postprandial appetite regulation in adults with different body mass index (BMI). Ultra-processed foods consumption and the risk of metabolically unhealthy phenotype in normal-weight and overweight/obese adults: a prospective investigation. Impact of ultra-processed foods on hedonic and homeostatic appetite regulation: A systematic review. Ultra-processed food consumption and adult obesity risk: a systematic review and dose-response meta-analysis. Contribution of ultra-processed foods to increased obesity and non-communicable diseases. Consumption of ultra-processed foods could influence the metabolic syndrome odds: A cross-sectional study. Impact of ultra-processed foods on short-term appetite regulation: Does body mass index make a difference?.",
            "score": 5.1574243e-05,
            "timestamp": "2025-12-29T19:48:31.940391"
          },
          {
            "query": "吸烟健康影响 二手烟风险 吸烟量与疾病关系 电子烟长期影响",
            "url": "https://www.ynetnews.com/health_science/article/h1einx00mbx",
            "title": "Crème brûlée and candy-flavored vapes lure teens into nicotine addiction - Ynetnews",
            "content": "## A Hebrew University study finds 14% of adult e-cigarette users never smoked traditional cigarettes; Sweet flavors like caramel and Oreo are strongly linked to disposable vape use, raising concerns over youth targeting and long-term health risks. About 14% of adults who use e-cigarettes, particularly disposable devices, have never smoked a traditional cigarette, and a clear link was found between a preference for sweet flavors and the use of disposable products. The study found that in the U.S., a preference for sweet flavors, including fruit, candy and caramel, was strongly linked to the use of disposable e-cigarettes. Unlike traditional cigarettes, e-cigarettes lack a clear beginning or end, Bar-Zeev explained, “so users can vape throughout the day.” This, along with a lack of public awareness that under Israeli law vaping is banned in all places where smoking is prohibited — including restaurants, buses, trains and other enclosed spaces — has contributed to increased usage. “In Israel and around the world, it's mostly teens and young adults who use e-cigarettes,” said Bar-Zeev.",
            "score": 0.04177388,
            "timestamp": "2025-12-29T19:49:32.223307"
          },
          {
            "query": "吸烟健康影响 二手烟风险 吸烟量与疾病关系 电子烟长期影响",
            "url": "https://scitechdaily.com/your-drinking-habits-may-raise-cancer-risk-more-than-you-think/",
            "title": "Your Drinking Habits May Raise Cancer Risk More Than You Think - SciTechDaily",
            "content": "At the same time, alcohol-related cancer risk is not evenly distributed. Higher levels of alcohol consumption were associated with greater cancer risk, particularly among African Americans, people with genetic predispositions, and individuals with obesity or diabetes. In contrast, people who followed American Cancer Society guidelines on alcohol use and other healthy lifestyle behaviors tended to have lower cancer risk and reduced mortality. “Across 50 studies in our review, higher alcohol consumption consistently raised cancer risk, with risk increasing as intake grows,” said Lea Sacca, Ph.D., senior author and an assistant professor of population health in the Schmidt College of Medicine. Smoking further increased alcohol-related cancer risk, although its effects varied depending on sex and drinking patterns. “Our findings undersore that alcohol-related cancer risk is not driven by alcohol alone, but by a complex interpaly of biological, behavioral and social factors,” said Maria Carmenza Mejia, M.D., co-author and a professor of population health in the Schmidt College of Medicine. #### Moderate Alcohol Use Linked With Higher Cancer Risk.",
            "score": 0.0014437558,
            "timestamp": "2025-12-29T19:49:32.223334"
          },
          {
            "query": "吸烟健康影响 二手烟风险 吸烟量与疾病关系 电子烟长期影响",
            "url": "https://scitechdaily.com/just-one-drink-a-day-linked-to-50-higher-mouth-cancer-risk-in-india/",
            "title": "Just One Drink a Day Linked to 50% Higher Mouth Cancer Risk in India - SciTechDaily",
            "content": "**Even light drinking, around one standard drink a day, can significantly raise the risk of mouth cancer in India, with locally brewed alcohol being especially harmful.**. A large study published today (December 23) in the open-access journal *BMJ Global Health* has found that drinking small amounts of alcohol each day is linked to a significantly higher risk of mouth cancer in India. Frequent alcohol use was strongly associated with a higher risk of buccal mucosa cancer. They conclude: “In summary, our study demonstrates that there is no safe limit of alcohol consumption for [buccal mucosa cancer] risk…Our findings suggest that public health action towards prevention of alcohol and tobacco use could largely eliminate [buccal mucosa cancer] from India.”. Reference: “Association of alcohol and different types of alcoholic beverages on the risk of buccal mucosa cancer in Indian men: a multicentre case-control study” 23 December 2025, *BMJ Global Health*. #### Moderate Alcohol Use Linked With Higher Cancer Risk.",
            "score": 0.0010566838,
            "timestamp": "2025-12-29T19:49:32.223345"
          },
          {
            "query": "吸烟健康影响 二手烟风险 吸烟量与疾病关系 电子烟长期影响",
            "url": "https://www.cspdailynews.com/tobacco/fda-authorizes-6-plus-nicotine-pouches-altria",
            "title": "FDA authorizes 6 On Plus nicotine pouches from Altria - CSP Daily News",
            "content": "Agency issues marketing granted orders under a new pilot program to streamline tobacco product reviews By Diane Adam on Dec. 22, 2025. FDA issued marketing granted orders to six On Plus nicotine pouch products. “As a result of the FDA’s nicotine pouch pilot program, adults who smoke cigarettes and would like to switch to a lower-risk alternative tobacco product will now have an expanded array of options.”. A full list of the 26 nicotine pouch products authorized by the FDA is available on the agency’s website. ### How AI is helping convenience stores price new products. Tobacco### FDA authorizes 6 On Plus nicotine pouches from Altria. Tobacco### FDA authorizes 6 On Plus nicotine pouches from Altria. CSP’s Top 202 details the largest chains in the convenience-store industry and the biggest mergers and acquisition news from the past year. ### Convenience Store Products. The latest information on products and trends in the convenience-store and foodservice industries.",
            "score": 0.00070277863,
            "timestamp": "2025-12-29T19:49:32.223355"
          },
          {
            "query": "吸烟健康影响 二手烟风险 吸烟量与疾病关系 电子烟长期影响",
            "url": "https://metro.co.uk/2025/12/27/ultra-processed-foods-linked-increased-risk-lung-cancer-25852217/",
            "title": "Ultra-processed foods linked with increased risk of lung cancer - Metro.co.uk",
            "content": "However, a new study carried out by the research journal Thorax has added lung cancer to the list of potential risks associated with the consumption of UPFs. Lung cancer is one of the most common variants of the disease worldwide, with more than 43,000 diagnoses every year in the UK alone, according to the NHS. Start your day informed with Metro's **News Updates** newsletter or get **Breaking News** alerts the moment it happens. UK  1 day ago By **Brooke Davies**. UK  2 days ago By **Luke Alsford**. UK  4 days ago By **Sam Corbishley**. UK  1 day ago By **Brooke Davies**. UK  7 days ago By **Brooke Davies**. UK  4 days ago By **Luke Alsford**. UK  3 days ago By **Daisy Outram**. UK  1 day ago By **Sarah Hooper**. UK  6 days ago By **William Hallowell**. UK  4 days ago By **William Hallowell**.",
            "score": 0.00047101182,
            "timestamp": "2025-12-29T19:49:32.223365"
          },
          {
            "query": "吸烟健康影响 二手烟风险 吸烟量与疾病关系 电子烟长期影响",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "# Service to help young people quit vaping. A service to help young people in Guernsey to stop vaping is set to finish at the end of the month. * More news stories for Guernsey. The States of Guernsey said 29 people had downloaded an official self-help booklet and \"discussions are ongoing regarding the future delivery of the service\". Alex Hawkins-Drew, associate director of Public Health, said the pilot allowed \"young people who want to stop vaping [to] have access to the right support, whether that's self-help resources, face-to-face guidance, or more intensive interventions\". Aaron Davies, service manager at Action for Children, said the pilot had shown that there was \"some great evidence and potential of positive change for young people who have engaged in the service reducing their vaping use\". He added: \"The reality is that, as accessibility to vaping products decreases for young people, having a service in place in our community that is ready to provide support is incredible.\". * Service starts to help young people quit vapes.",
            "score": 0.00020906501,
            "timestamp": "2025-12-29T19:49:32.223375"
          },
          {
            "query": "吸烟健康影响 二手烟风险 吸烟量与疾病关系 电子烟长期影响",
            "url": "https://www.nature.com/articles/s41562-025-02361-9",
            "title": "Homophobia, economic precarity and the well-being of sexual and gender diverse people in a 153-country survey - Nature",
            "content": "Health Sex.* **19**, 32–49 (2017). Health* **53**, 791–793 (2013). H. Prejudice, social stress, and mental health in lesbian, gay, and bisexual populations: conceptual issues and research evidence. Health* **15**, 105–107 (2017). Health* **23**, 5–23 (2022). Minority stress, activism, and health in the context of economic precarity: results from a national participatory action survey of lesbian, gay, bisexual, transgender, queer, and gender non-conforming youth. (1982)* **66**, 1733–1749 (2008). Health Sex.* **22**, 398–412 (2020). Online socializing among men who have sex with men and transgender people in Nairobi and Johannesburg and implications for public health-related research and health promotion: an analysis of qualitative and respondent-driven sampling survey data. Hidden from health: structural stigma, sexual orientation concealment, and HIV across 38 countries in the European MSM Internet Survey. *The Global Internet Survey on Happiness, Health and Well-Being among Sexual and Gender Minority: Design and Methods* Working Paper (UNAIDS, 2023). E.L., S.H. and B.V. conceptualized the Global LGBTQ+ Happiness Survey.",
            "score": 0.0001626686,
            "timestamp": "2025-12-29T19:49:32.223384"
          }
        ],
        "latest_summary": "## 核心事件概述\n吸烟对人体的危害是一个全球性公共卫生问题，其影响范围广泛且深远，从呼吸系统到心血管系统，从多种癌症风险到皮肤健康，甚至对非吸烟者造成二手烟危害。研究表明，吸烟不仅是一种成瘾行为，更是一种多系统性的健康威胁，其危害程度与吸烟量、吸烟年限以及个人健康状况密切相关。最新研究数据显示，吸烟者患各种疾病的风险显著增加，而戒烟则能有效降低这些风险，为公众健康提供了明确的干预方向。\n\n## 多方报道分析\n从医学研究到临床实践，不同来源的信息一致揭示了吸烟的广泛危害。一项针对癌症患者的研究发现，\"癌症患者平均使用烟草的时间更长，约21年，而对照组约为18年\"，同时\"他们更有可能生活在农村地区，并且每日酒精消耗量更大，平均近37克，而对照组约为29克\"。这项研究还指出，\"频繁饮酒与口腔黏膜癌风险高度相关\"，特别是\"当地酿造的饮料与风险增加最大相关\"。在头颈鳞状细胞癌(HNSCC)领域，研究显示\"吸烟史较长(HR=1.06, P=0.042)是HNSCC发病的独立危险因素\"。心血管专家Dr Jeremy London警告称，\"吸烟是'你能对自己做的最糟糕的事情'\"，特别是对于已有心脏病和动脉粥样硬化倾向的人，\"吸烟会加速这一过程呈指数级增长\"。皮肤健康方面，医学专家指出，\"吸烟会使血管变窄，分解胶原蛋白和弹性蛋白，放大阳光损伤\"，导致\"吸烟者面容\"现象，表现为\"眼睛和嘴唇周围有深皱纹\"，以及\"皮肤松弛、肤色暗淡呈黄灰色、过早出现轮廓\"。\n\n## 关键数据提取\n多项研究提供了关于吸烟与健康关系的具体数据：肺癌是\"全球最常见的疾病之一，英国每年有超过43,000例诊断\"；对于肺癌筛查，建议考虑\"50-80岁、身体健康、至少有20'包年'吸烟史（例如每天一包烟20年，每天两包烟10年，或每天半包烟40年）、目前吸烟或在过去15年内戒烟的人\"；在口腔癌研究中，\"癌症患者平均使用烟草的时间为21年，对照组为18年\"，\"每日酒精消耗量癌症组平均37克，对照组29克\"；在头颈鳞状细胞癌研究中，\"共纳入440名参与者，包括220名高风险个体（队列1）和220名诊断为头颈鳞状细胞癌的患者（队列2）\"；\"HPV相关的口腔和咽癌在男性中现在比女性的宫颈癌更常见\"。这些数据清晰地量化了吸烟与各种疾病之间的关联强度。\n\n## 深度背景分析\n吸烟危害的生物学机制复杂多样。在分子水平上，\"尼古丁收缩血管，限制氧气和必需营养物质流向皮肤\"，同时\"乙醇可能改变口腔内层脂肪含量，使其更具渗透性，更容易受到咀嚼烟草制品中的致癌物影响\"。这种多层次的病理机制解释了为何吸烟会影响如此多的身体系统。值得注意的是，\"酒精和烟草使用常常同时发生，难以确定各自独立贡献\"，特别是在印度等\"无烟烟草使用普遍\"的地区，这种相互作用使风险评估更加复杂。研究还发现，\"酒精相关癌症风险分布不均，吸烟进一步增加了酒精相关癌症风险\"，且\"超加工食品与肺癌风险相关\"，表明生活方式因素可能协同作用，增加健康风险。从公共卫生角度看，\"癌症相关死亡率在过去十年下降了12%，从31%降至19%\"，这一进步部分归功于对吸烟危害认识的提高和戒烟干预的普及。\n\n## 发展趋势判断\n基于现有研究数据，吸烟相关疾病的发展趋势呈现几个关键方向。首先，尽管\"癌症相关死亡率在过去十年下降了12%\"，但吸烟仍然是多种癌症的主要风险因素，特别是对于\"已有心脏病和动脉粥样硬化倾向的人\"。其次，HPV相关口腔癌的上升趋势值得关注，\"在男性中，HPV相关的口腔和咽癌现在比女性的宫颈癌更常见\"，这表明病毒与烟草的相互作用可能正在改变疾病谱。第三，戒烟干预的有效性得到了充分证实，\"戒烟是预防肺癌的最佳方法\"，而\"对于高风险人群，CT扫描筛查可降低肺癌死亡率\"。未来，随着公众健康意识的提高和戒烟服务的普及，如\"拨打戒烟热线800-QUIT-NOW，或发送短信QUITNOW至333888，以及基于网络的程序如Smokefree.gov和来自国家癌症研究所的quitSTART应用\"，吸烟相关疾病的负担有望进一步减轻。\n\n## 电子烟的健康影响与长期研究\n新兴的烟草产品如电子烟的使用及其长期健康影响正受到越来越多的关注。希伯来大学的一项研究发现，约14%的成年电子烟用户从未吸过传统香烟，这表明电子烟可能成为独立的成瘾途径。研究还发现，甜味口味（如水果、糖果和焦糖）与一次性电子烟的使用有强烈关联，引发了针对年轻人的营销担忧。专家指出，与传统的香烟不同，电子烟缺乏明确的开始和结束点，\"用户可以在一整天内随时吸食\"，这可能导致使用频率增加。在监管方面，FDA已通过新的试点项目授权了26种尼古丁袋产品，为吸烟者提供\"风险较低的替代烟草产品选择\"。然而，关于电子烟的长期健康影响仍需更多研究，特别是在青少年和年轻成人群体中，他们是以色列和美国电子烟的主要使用人群。同时，各地正在开展帮助年轻人戒烟的服务，如根西岛为年轻人提供的戒烟服务，已有29人下载了官方自助手册，显示出\"年轻人减少使用电子烟的积极变化潜力\"。",
        "reflection_iteration": 2,
        "is_completed": true
      },
      "order": 1
    },
    {
      "title": "全球烟草使用统计数据",
      "content": "提供最新的全球和区域性吸烟率数据，包括不同年龄、性别和社会经济群体的吸烟模式。分析烟草消费量、相关疾病负担以及经济损失的统计信息。",
      "research": {
        "search_history": [
          {
            "query": "全球烟草使用统计数据 最新吸烟率数据 不同年龄性别社会经济群体 烟草消费量 疾病负担 经济损失",
            "url": "https://www.cnbc.com/2025/12/26/how-americans-are-responding-to-the-affordability-crisis.html",
            "title": "As the cost of living keeps climbing, Americans are 'trying to muscle through' the affordability crisis, analyst says - CNBC",
            "content": "Skip Navigation\n\nSuccess\n\n Startups\n Side Hustles\n Power Players\n Leadership\n\nMoney\n\n Earn\n Spend\n Save and Invest\n Become Debt-Free\n\nWork\n\n Land the Job\n Get Ahead\n Level Up\n Science of Success\n\nLife\n\n Pop Culture and Media\n Psychology and Relationships\n Health and Wellness\n Real Estate\n\nVideo\n\n Most Popular\n CNBC TV\n\nCourses\n\nCNBC.COM\n\nRelated Stories [...] # As the cost of living keeps climbing, Americans are 'trying to muscle through' the affordability crisis, analyst says\n\nKamaron McNair@in/kamaronmcnair/@kamaronmcnair\n\nShare\n\nDetroit, Michigan USA, 4 November 2025: People wait in line to pick up groceries from the anti-hunger nonprofit, Forgotten Harvest. Demand for emergency food at food pantries and soup kitchens has risen dramatically since the federal government shutdown cut SNAP benefits.\n\nUcg | Universal Images Group | Getty Images [...] Want to give your kids the ultimate advantage? Sign up for CNBC's new online course,How to Raise Financially Smart Kids. Learn how to build healthy financial habits today to set your children up for greater success in the future.\n\n## Take control of your money with CNBC Select\n\nCNBC Select is editorially independent and may earn a commission from affiliate partners on links.",
            "score": 0.024516335,
            "timestamp": "2025-12-29T19:50:37.028574"
          },
          {
            "query": "全球烟草使用统计数据 最新吸烟率数据 不同年龄性别社会经济群体 烟草消费量 疾病负担 经济损失",
            "url": "https://thedailyeconomy.org/article/obesity-economics-how-subsidies-distort-the-american-diet/",
            "title": "Obesity Economics: How Subsidies Distort the American Diet - The Daily Economy",
            "content": "The negative impact of subsidized crop consumption on health — while it can’t be called causal — persists even after controlling for age, sex, and socioeconomic factors. But life does not control for those factors.\n\n## The Great Grain Giveaway [...] Laura Williams is a communication strategist, writer, and educator based in Atlanta, GA.\n\nShe is a passionate advocate for critical thinking, individual liberties, and the Oxford Comma.\n\n#### Share This Article\n\nPost on Facebook\n\nPost on X\n\nPrint Article\n\nEmail Article\n\nRelated\n\n Peter C. Earle\n\n  ## AIER Holiday Index: Pandemic Policies Still Raising Prices [...] It has a certain economic logic. Instead of waiting for a patient to develop a cascade of expensive comorbidities like heart failure or diabetes, we could consider asking Medicare to pay for anti-obesity meds on the front end. That wouldn’t work as well as lifestyle changes, but all our health and activity messaging over the past several years doesn’t seem to have moved that needle, and significant evidence suggests our efforts are counterproductive.\n\n## The Tangled Web of Farm Subsidies",
            "score": 0.02072506,
            "timestamp": "2025-12-29T19:50:37.028591"
          },
          {
            "query": "全球烟草使用统计数据 最新吸烟率数据 不同年龄性别社会经济群体 烟草消费量 疾病负担 经济损失",
            "url": "https://www.ynetnews.com/health_science/article/h1einx00mbx",
            "title": "Crème brûlée and candy-flavored vapes lure teens into nicotine addiction - Ynetnews",
            "content": "The study surveyed 410 adults aged 18–45 in Israel and the U.S., all of whom had used e-cigarettes in the previous 30 days. About 37% reported using disposable devices, while 63% used refillable ones with either replaceable liquid cartridges or tanks. [...] Despite public claims that these products are intended for adult smokers, actual usage patterns show otherwise. “In Israel and around the world, it's mostly teens and young adults who use e-cigarettes,” said Bar-Zeev. “They’ve replaced traditional cigarettes with e-cigarettes, and that is the first substance young people try.\"\n\n### A gateway to broader addiction [...] About 14% of adults who use e-cigarettes, particularly disposable devices, have never smoked a traditional cigarette, and a clear link was found between a preference for sweet flavors and the use of disposable products.\n\nThe findings, published in the Israel Journal of Health Policy Research, were led by Prof. Yael Bar-Zeev from the Hebrew University's School of Public Health, along with Dr. Begashaw Mulu, a graduate of the university’s international Master of Public Health program.",
            "score": 0.01627746,
            "timestamp": "2025-12-29T19:50:37.028598"
          },
          {
            "query": "全球烟草使用统计数据 最新吸烟率数据 不同年龄性别社会经济群体 烟草消费量 疾病负担 经济损失",
            "url": "https://www.washingtonpost.com/business/2025/12/25/inflation-job-market-impact-charts/",
            "title": "10 charts that show where the economy is heading - The Washington Post",
            "content": "December 24, 2025\n Column\n\n  Carolyn Hax\n\n  Carolyn Hax: After holiday dinner, the women are on cleanup duty. Again.\n\n  Earlier today\n Washington Post staff\n\n  5 tips from ‘super agers’ on how to live a healthy life\n\n  1 hour ago\n\nBy \nAbha Bhattarai\n\nAbha Bhattarai is the economics correspondent for The Washington Post. She previously covered retail for the publication.\nfollow on X@abhabhattarai\n\nBy \nRachel Lerman [...] Rachel Lerman covers the economy and technology for The Washington Post. She focuses on reporting visually driven stories.\nfollow on X@rachelerman\n\n 1\n\n  Sophia Nguyen\n\n  How a nearly 70-year-old debut novelist published 2025’s breakout hit\n 2\n\n  Column\n\n  Carolyn Hax\n\n  Carolyn Hax: After holiday dinner, the women are on cleanup duty. Again.\n 3\n\n  Maegan Vazquez\n\n  What we know (and what we don’t) about the Epstein files’ release\n 4\n\n  Washington Post staff [...] 5 tips from ‘super agers’ on how to live a healthy life\n 5\n\n  Salwan Georges\n\n  Noodles taste better at 12,000 feet",
            "score": 0.015072629,
            "timestamp": "2025-12-29T19:50:37.028603"
          },
          {
            "query": "全球烟草使用统计数据 最新吸烟率数据 不同年龄性别社会经济群体 烟草消费量 疾病负担 经济损失",
            "url": "https://www.houstonchronicle.com/business/article/consumer-confidence-slides-in-december-to-lowest-21258948.php",
            "title": "Consumer confidence slides in December to lowest level since US tariffs rolled out in April - Houston Chronicle",
            "content": "We use technologies that provide information about your interactions with this site to others for functionality, analytics, targeted advertising, and other purposes. Learn more in our Privacy Notice. You agree that your use of this website and the Hearst Services is governed by the Terms of Use (including the dispute resolution procedures).\n\nSkip to main content\n\nSubscribe\n\nBREAKING\n\n10m ago\n\nSugar Land doctor accused of performing surgery while intoxicated\n\n10m ago\n\nBusiness [...] 'Exposed as giant frauds': Reaction to A&M's CFP loss to Miami\n\nLet's Play\n\n### Your Ad Blocker Is On!\n\nOnly subscribers can read articles in this mode. To continue, \nsign in\n or \nsubscribe with a special offer\n or turn off ad blocker.\n\n### The Benefits of Unlimited Digital Access [...] A measure of Americans’ short-term expectations for their income, business conditions and the job market remained stable at 70.7, but still well below 80, the marker that can signal a recession ahead. It was the 11th consecutive month that reading has come in under 80.\n\nAdvertisement\n\nArticle continues below this ad\n\nConsumers’ assessments of their current economic situation tumbled 9.5 points to 116.8.",
            "score": 0.012030543,
            "timestamp": "2025-12-29T19:50:37.028608"
          },
          {
            "query": "全球烟草使用统计数据 最新吸烟率数据 不同年龄性别社会经济群体 烟草消费量 疾病负担 经济损失",
            "url": "https://www.npr.org/2025/12/26/nx-s1-5638557/what-happened-to-u-s-foreign-aid-this-year",
            "title": "What happened to U.S. foreign aid this year? - NPR",
            "content": "User ID:  c0b10160-da27-4f64-9a8a-2e6aa2cf00ef\n\nThis User ID will be used as a unique identifier while storing and accessing your preferences for future.\n\nTimestamp:  --\n\n### Manage Consent Preferences\n\n#### Strictly Necessary or Essential Cookies\n\nAlways Active [...] Accessibility links\n\n Skip to main content\n Keyboard shortcuts for audio player\n\nWhat happened to U.S. foreign aid this year? Historically, the U.S. had been the top donor for global health. That changed dramatically this year. We look at the new approach the U.S. is pursuing and what this has meant for people on the ground.\n\n### World\n\n# What happened to U.S. foreign aid this year?\n\nHeard on All Things Considered\n\nBy\n\nGabrielle Emanuel\n\n,\n\nFatma Tanis [...] ## Privacy Preference Center",
            "score": 0.011777842,
            "timestamp": "2025-12-29T19:50:37.028613"
          },
          {
            "query": "全球烟草使用统计数据 最新吸烟率数据 不同年龄性别社会经济群体 烟草消费量 疾病负担 经济损失",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "## Popular Reads\n\nContent is not available\n\n- {{rankTranslation}}\n\n  {{title}} [...] Advertisement\n\nAlex Hawkins-Drew, associate director of Public Health, said the pilot allowed \"young people who want to stop vaping [to] have access to the right support, whether that's self-help resources, face-to-face guidance, or more intensive interventions\".\n\nAaron Davies, service manager at Action for Children, said the pilot had shown that there was \"some great evidence and potential of positive change for young people who have engaged in the service reducing their vaping use\". [...] He added: \"The reality is that, as accessibility to vaping products decreases for young people, having a service in place in our community that is ready to provide support is incredible.\"\n\nFollow BBC Guernsey on X and Facebook and Instagram. Send your story ideas to channel.islands@bbc.co.uk.\n\nMore on this story\n\n Ban on the sale of vapes to under 18s approved\n Service starts to help young people quit vapes\n Stop smoking service to offer free vape kits\n\n## Related internet links",
            "score": 0.009670993,
            "timestamp": "2025-12-29T19:50:37.028618"
          },
          {
            "query": "全球烟草使用统计数据 最新吸烟率数据 不同年龄性别社会经济群体 烟草消费量 疾病负担 经济损失",
            "url": "https://www.facilitiesmanagement-now.com/article/244362/climate-disasters-2025-120bn-in-global-economic-losses?utm_source=facilitiesmanagement&utm_medium=newsfeed&utm_campaign=facilitiesmanagement-articleId-244362",
            "title": "Climate Disasters 2025: $120bn in Global Economic Losses - facilitiesmanagement-now.com",
            "content": "Newsletter 19. November. 2025\n\nNewsletter 12. November. 2025\n\nNewsletter 5. November. 2025\n\nNewsletter 29. October. 2025\n\nNewsletter 22. October. 2025\n\nNewsletter 15. October. 2025\n\nNewsletter 8. October. 2025\n\nNewsletter 1. October. 2025\n\nNewsletter 24. September. 2025\n\nNewsletter 17. September. 2025\n\nNewsletter 10. September. 2025\n\nNewsletter 3. September. 2025 [...] ### The top trending stories from the industry's leading sources\n\nThis website uses cookies to tailor the website to your needs, to offer and improve the basic functionality of the website. For more information on the use of cookies, please visit our  Privacy and Cookie Policy. You can change your cookie opt-ins at any time via your browser settings\n\n# Climate Disasters 2025: $120bn in Global Economic Losses\n\nBy edie.net\n\nDecember 27, 2025 [...] COP30 saw nations adopting a new global set of 59 adaptation indicators, although compromises in the agreement may make them difficult to implement effectively.\n\nThis comes as the UK is on track for its hottest year since records began, according to the Met Office, with less than a week remaining until 2026.\n\nPartnered with:\n\n### INSTAGRAM FEED\n\n### LATEST NEWSLETTERS\n\nNewsletter 17. December. 2025\n\nNewsletter 10. December. 2025\n\nNewsletter 3. December. 2025\n\nNewsletter 26. November. 2025",
            "score": 0.009596455,
            "timestamp": "2025-12-29T19:50:37.028623"
          },
          {
            "query": "全球烟草使用统计数据 最新吸烟率数据 不同年龄性别社会经济群体 烟草消费量 疾病负担 经济损失",
            "url": "https://nypost.com/2025/12/26/health/the-worst-things-people-got-stuck-in-their-butts-last-year/",
            "title": "The government’s keeping track of what people get stuck in their butts — these were the worst items last year - New York Post",
            "content": "Email\n\nNew York Post\n\n Lifestyle\n Weird But True\n Health\n Sex & Relationships\n Viral Trends\n Human Interest\n Astrology\n Parenting\n Shopping\n Fashion & Beauty\n Food & Drink\n Travel\n\n Health\n Wellness\n Fitness\n Health Care\n Medicine\n Men’s Health\n Women’s Health\n Mental Health\n Nutrition\n Health & Wellness Products\n Personal Care Products\n\n#### trending now in Health\n\n##### ‘Super flu’ sees spike in US hospitalizations — here are... [...] ##### Kevin Jonas' wife diagnosed with devastating disease with 'very...\n\nWellness\n\n# The government’s keeping track of what people get stuck in their butts — these were the worst items last year\n\nBy\n\nCarly Stern\n\nPublished  Dec. 26, 2025, 11:18 a.m. ET\n\nThis is not a trend we can get behind. [...] And unfortunately, it’s not just tushes getting mistreated. Defector also put together lists of the craziest things people put in their vaginas and penises.\n\nH\\_Ko - stock.adobe.com\n\nAn Iranian man once went to the ER and needed emergency surgery because of deodorant that he'd put up his butt. Visual Journal of Emergency Medicine\n\nOne Florida man stuck a thermos up his butt. It was seen on a body scanner when he was arrested for drugs. Polk County Sheriffs Office",
            "score": 0.0094125895,
            "timestamp": "2025-12-29T19:50:37.028627"
          },
          {
            "query": "全球烟草使用统计数据 最新吸烟率数据 不同年龄性别社会经济群体 烟草消费量 疾病负担 经济损失",
            "url": "https://www.cnn.com/2025/12/24/economy/us-economy-affordability-gdp",
            "title": "Why so many Americans dislike this fast-growing economy - CNN",
            "content": "Ad Feedback\n\nThank You!\n\nYour effort and contribution in providing this feedback is much appreciated.\n\nMarkets\n\nDOW\n\nS&P 500\n\nNASDAQ\n\nHot Stocks\n\nFear & Greed Index\n\n----- is driving the US market\n\nLatest Market News\n\n Fourth largest Powerball jackpot climbs to $1.7 billion as Christmas rolls around the corner\n China’s TikTok rival flooded with porn and violent video in cyberattack\n ‘60 Minutes’ story shelved by Bari Weiss streamed in Canada — and instantly spread across the web\n\nHot Stocks [...] ----- is driving the US market\n\nSomething isn't loading properly. Please check back later.\n\nAd Feedback\n\nBusiness Economy 4 min read\n\n# Why so many Americans dislike this fast-growing economy\n\nAnalysis by\n\nElisabeth Buchwald\n\n,\n\nMatt Egan\n\nPUBLISHED\n\nA person carries a shopping bag in Philadelphia, Wednesday, Dec. 10, 2025.\n\nMatt Rourke/AP\n\nSee all topics\n\nEmail \n\nLink Copied! [...] This burrito is everything you need to know about America’s economy\n\nEconomists say the third-quarter spending increase was likely driven by higher-income consumers, the ones benefiting the most from record-high real estate values and blockbuster stock returns.\n\nPeople shop at an outdoor market in Brooklyn on December 12 in New York City.\n\nSpencer Platt/Getty Images",
            "score": 0.009055264,
            "timestamp": "2025-12-29T19:50:37.028633"
          },
          {
            "query": "global tobacco use statistics 2023-2024 electronic cigarette smoking rates by age gender socioeconomic group health impact economic burden",
            "url": "https://www.ynetnews.com/health_science/article/h1einx00mbx",
            "title": "Crème brûlée and candy-flavored vapes lure teens into nicotine addiction - Ynetnews",
            "content": "## A Hebrew University study finds 14% of adult e-cigarette users never smoked traditional cigarettes; Sweet flavors like caramel and Oreo are strongly linked to disposable vape use, raising concerns over youth targeting and long-term health risks. About 14% of adults who use e-cigarettes, particularly disposable devices, have never smoked a traditional cigarette, and a clear link was found between a preference for sweet flavors and the use of disposable products. The study found that in the U.S., a preference for sweet flavors, including fruit, candy and caramel, was strongly linked to the use of disposable e-cigarettes. Unlike traditional cigarettes, e-cigarettes lack a clear beginning or end, Bar-Zeev explained, “so users can vape throughout the day.” This, along with a lack of public awareness that under Israeli law vaping is banned in all places where smoking is prohibited — including restaurants, buses, trains and other enclosed spaces — has contributed to increased usage. “In Israel and around the world, it's mostly teens and young adults who use e-cigarettes,” said Bar-Zeev.",
            "score": 0.019870713,
            "timestamp": "2025-12-29T19:52:29.130983"
          },
          {
            "query": "global tobacco use statistics 2023-2024 electronic cigarette smoking rates by age gender socioeconomic group health impact economic burden",
            "url": "https://www.pmg-ky1.com/spencer_magnet/agricultural-economic-updates-part-2/article_1af28091-3d04-58b3-8d90-3b62b0d7a8af.html",
            "title": "Agricultural Economic Updates, Part 2 - pmg-ky1.com",
            "content": "You have permission to edit this article. ### Today's e-Edition. “But I also think we’ve got to recognize how strong demand for proteins is right now.”. “While cigarette sales in the U.S. continue to decline at an accelerated rate, a short 2025 burley crop, coupled with recent cigarette export growth and tariff protection on leaf imports, is providing some revitalized support for the waning burley sector,” said Snell. Snell added that dark-fired tobacco has seen a third year of deep volume cuts as the industry adjusts to the new smokeless market, where consumers are switching to products like nicotine pouches and vapes that do not use Kentucky dark tobaccos. “Fruits, vegetables, nursery, greenhouse, floriculture, cut flowers, on-farm retailing and farmers’ markets, and CSAs (community supported agriculture) are all continuing to expand. Woods projects income from nursery crops, floriculture and produce to be firmly between $300 to $325 million by year’s end, as Kentucky improves its ability to supply local markets.",
            "score": 0.00189692,
            "timestamp": "2025-12-29T19:52:29.131022"
          },
          {
            "query": "global tobacco use statistics 2023-2024 electronic cigarette smoking rates by age gender socioeconomic group health impact economic burden",
            "url": "https://scitechdaily.com/just-one-drink-a-day-linked-to-50-higher-mouth-cancer-risk-in-india/",
            "title": "Just One Drink a Day Linked to 50% Higher Mouth Cancer Risk in India - SciTechDaily",
            "content": "**Even light drinking, around one standard drink a day, can significantly raise the risk of mouth cancer in India, with locally brewed alcohol being especially harmful.**. A large study published today (December 23) in the open-access journal *BMJ Global Health* has found that drinking small amounts of alcohol each day is linked to a significantly higher risk of mouth cancer in India. Frequent alcohol use was strongly associated with a higher risk of buccal mucosa cancer. They conclude: “In summary, our study demonstrates that there is no safe limit of alcohol consumption for [buccal mucosa cancer] risk…Our findings suggest that public health action towards prevention of alcohol and tobacco use could largely eliminate [buccal mucosa cancer] from India.”. Reference: “Association of alcohol and different types of alcoholic beverages on the risk of buccal mucosa cancer in Indian men: a multicentre case-control study” 23 December 2025, *BMJ Global Health*. #### Moderate Alcohol Use Linked With Higher Cancer Risk.",
            "score": 0.00022649117,
            "timestamp": "2025-12-29T19:52:29.131038"
          },
          {
            "query": "global tobacco use statistics 2023-2024 electronic cigarette smoking rates by age gender socioeconomic group health impact economic burden",
            "url": "https://www.nature.com/articles/s41562-025-02361-9",
            "title": "Homophobia, economic precarity and the well-being of sexual and gender diverse people in a 153-country survey - Nature",
            "content": "Health Sex.* **19**, 32–49 (2017). Health* **53**, 791–793 (2013). H. Prejudice, social stress, and mental health in lesbian, gay, and bisexual populations: conceptual issues and research evidence. Health* **15**, 105–107 (2017). Health* **23**, 5–23 (2022). Minority stress, activism, and health in the context of economic precarity: results from a national participatory action survey of lesbian, gay, bisexual, transgender, queer, and gender non-conforming youth. (1982)* **66**, 1733–1749 (2008). Health Sex.* **22**, 398–412 (2020). Online socializing among men who have sex with men and transgender people in Nairobi and Johannesburg and implications for public health-related research and health promotion: an analysis of qualitative and respondent-driven sampling survey data. Hidden from health: structural stigma, sexual orientation concealment, and HIV across 38 countries in the European MSM Internet Survey. *The Global Internet Survey on Happiness, Health and Well-Being among Sexual and Gender Minority: Design and Methods* Working Paper (UNAIDS, 2023). E.L., S.H. and B.V. conceptualized the Global LGBTQ+ Happiness Survey.",
            "score": 0.00017366598,
            "timestamp": "2025-12-29T19:52:29.131052"
          },
          {
            "query": "global tobacco use statistics 2023-2024 electronic cigarette smoking rates by age gender socioeconomic group health impact economic burden",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "# Service to help young people quit vaping. A service to help young people in Guernsey to stop vaping is set to finish at the end of the month. * More news stories for Guernsey. The States of Guernsey said 29 people had downloaded an official self-help booklet and \"discussions are ongoing regarding the future delivery of the service\". Alex Hawkins-Drew, associate director of Public Health, said the pilot allowed \"young people who want to stop vaping [to] have access to the right support, whether that's self-help resources, face-to-face guidance, or more intensive interventions\". Aaron Davies, service manager at Action for Children, said the pilot had shown that there was \"some great evidence and potential of positive change for young people who have engaged in the service reducing their vaping use\". He added: \"The reality is that, as accessibility to vaping products decreases for young people, having a service in place in our community that is ready to provide support is incredible.\". * Service starts to help young people quit vapes.",
            "score": 9.143373e-05,
            "timestamp": "2025-12-29T19:52:29.131066"
          },
          {
            "query": "global tobacco use statistics 2023-2024 electronic cigarette smoking rates by age gender socioeconomic group health impact economic burden",
            "url": "https://www.theflowspace.com/physical-health/prevention-longevity/women-longevity-advancements-2025-3014377/",
            "title": "The 5 Big Advancements in Women’s Longevity this Year - Flow Space",
            "content": "Read Next: Melt Stiffness and Back Pain in Minutes With These 3 Guided Fascia Moves. By providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services. Nova is a part of Penske Media Corporation. PEP is a trademark of Penske Media Corporation. In a similar sentiment, this spring, the World Economic Forum published a white paper, “Prescription for Change: Policy Recommendations for Women’s Health Research.” It concluded that closing the gender-health research gap is not just an equitable imperative but an economic opportunity. Melt Stiffness and Back Pain in Minutes With These 3 Guided Fascia Moves. By providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services. Nova is a part of Penske Media Corporation. PEP is a trademark of Penske Media Corporation.",
            "score": 4.8491085e-05,
            "timestamp": "2025-12-29T19:52:29.131079"
          },
          {
            "query": "global tobacco use statistics 2023-2024 electronic cigarette smoking rates by age gender socioeconomic group health impact economic burden",
            "url": "https://www.cbsnews.com/video/bystanders-pull-survivors-from-wreckage-of-deadly-plane-crash/",
            "title": "Bystanders pull survivors from wreckage of deadly plane crash - CBS News",
            "content": "Image 326: 2025 in pop culture ### 2025 in pop culture 02:51 Dec 20, 2025Image 327: Cannabis reclassification impact on research ### Cannabis reclassification impact on research 03:17 Dec 20, 2025Image 328: U.S. hits more than 70 ISIS targets in Syria ### U.S. hits more than 70 ISIS targets in Syria 02:20 Dec 20, 2025Image 329: What's next for TikTok after deal signing ### What's next for TikTok after deal signing 03:36 Dec 20, 2025Image 330: Erika Kirk endorses JD Vance for president ### Erika Kirk endorses JD Vance for president 02:55 Dec 20, 2025Image 331: Search for motive in Brown and MIT shootings ### Search for motive in Brown and MIT shootings 05:03 Dec 20, 2025Image 332: White House responds to Epstein files release ### White House responds to Epstein files release 02:53 Dec 19, 2025Image 333: New Epstein files: What we've learned so far ### New Epstein files: What we've learned so far 02:56 Dec 19, 2025Image 334: U.S. retaliates with strikes on ISIS in Syria ### U.S. retaliates with strikes on ISIS in Syria 01:10 Dec 19, 2025Image 335: New Hampshire search connected to Brown shooting ### New Hampshire search connected to Brown shooting 11:54 Dec 19, 2025Image 336: Strategists break down the year in politics ### Strategists break down the year in politics 05:32 Dec 19, 2025Image 337: Ukrainian families seeking answers about kids ### Ukrainian families seeking answers about kids 04:50 Dec 19, 2025Image 338: Funeral held for youngest Bondi Beach victim ### Funeral held for youngest Bondi Beach victim 03:47 Dec 19, 2025Image 339: Details on plane crash that killed Greg Biffle ### Details on plane crash that killed Greg Biffle 03:23 Dec 19, 2025Image 340: Takeaways from Trump's year-end address ### Takeaways from Trump's year-end address 20:27 Dec 18, 2025Image 341: Measles entrenching in U.S., doctor says ### Measles entrenching in U.S., doctor says 05:44 Dec 18, 2025Image 342: Largest federal climate research",
            "score": 4.008326e-05,
            "timestamp": "2025-12-29T19:52:29.131088"
          },
          {
            "query": "全球烟草使用统计数据 电子烟青少年使用率 传统烟草消费趋势 烟草相关疾病负担 经济影响 烟草控制政策变化",
            "url": "https://www.npr.org/2025/12/26/nx-s1-5648335/cannabis-use-among-teens-tied-to-poor-school-performance",
            "title": "Cannabis use among teens tied to poor school performance - NPR",
            "content": "* Keyboard shortcuts for audio player. **Cannabis use among teens tied to poor school performance** **A new study of more than 160,000 teens finds that even occasional cannabis use among 8th, 10th and 12th graders is tied to worse outcomes at school and more emotional distress.**. ### Health. # Cannabis use among teens tied to poor school performance. Heard on All Things Considered. #### Cannabis use among teens tied to poor school performance. * **`<iframe src=\"https://www.npr.org/player/embed/nx-s1-5648335/nx-s1-9587147\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">`**. A new study of more than 160,000 teens finds that even occasional cannabis use among 8th, 10th and 12th graders is tied to worse outcomes at school and more emotional distress.",
            "score": 0.058345836,
            "timestamp": "2025-12-29T19:53:42.082208"
          },
          {
            "query": "全球烟草使用统计数据 电子烟青少年使用率 传统烟草消费趋势 烟草相关疾病负担 经济影响 烟草控制政策变化",
            "url": "https://www.pmg-ky1.com/spencer_magnet/agricultural-economic-updates-part-2/article_1af28091-3d04-58b3-8d90-3b62b0d7a8af.html",
            "title": "Agricultural Economic Updates, Part 2 - pmg-ky1.com",
            "content": "You have permission to edit this article. ### Today's e-Edition. “But I also think we’ve got to recognize how strong demand for proteins is right now.”. “While cigarette sales in the U.S. continue to decline at an accelerated rate, a short 2025 burley crop, coupled with recent cigarette export growth and tariff protection on leaf imports, is providing some revitalized support for the waning burley sector,” said Snell. Snell added that dark-fired tobacco has seen a third year of deep volume cuts as the industry adjusts to the new smokeless market, where consumers are switching to products like nicotine pouches and vapes that do not use Kentucky dark tobaccos. “Fruits, vegetables, nursery, greenhouse, floriculture, cut flowers, on-farm retailing and farmers’ markets, and CSAs (community supported agriculture) are all continuing to expand. Woods projects income from nursery crops, floriculture and produce to be firmly between $300 to $325 million by year’s end, as Kentucky improves its ability to supply local markets.",
            "score": 0.0014779429,
            "timestamp": "2025-12-29T19:53:42.082238"
          },
          {
            "query": "全球烟草使用统计数据 电子烟青少年使用率 传统烟草消费趋势 烟草相关疾病负担 经济影响 烟草控制政策变化",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "# Service to help young people quit vaping. A service to help young people in Guernsey to stop vaping is set to finish at the end of the month. * More news stories for Guernsey. The States of Guernsey said 29 people had downloaded an official self-help booklet and \"discussions are ongoing regarding the future delivery of the service\". Alex Hawkins-Drew, associate director of Public Health, said the pilot allowed \"young people who want to stop vaping [to] have access to the right support, whether that's self-help resources, face-to-face guidance, or more intensive interventions\". Aaron Davies, service manager at Action for Children, said the pilot had shown that there was \"some great evidence and potential of positive change for young people who have engaged in the service reducing their vaping use\". He added: \"The reality is that, as accessibility to vaping products decreases for young people, having a service in place in our community that is ready to provide support is incredible.\". * Service starts to help young people quit vapes.",
            "score": 0.0005264497,
            "timestamp": "2025-12-29T19:53:42.082250"
          },
          {
            "query": "全球烟草使用统计数据 电子烟青少年使用率 传统烟草消费趋势 烟草相关疾病负担 经济影响 烟草控制政策变化",
            "url": "https://www.houstonchronicle.com/business/article/consumer-confidence-slides-in-december-to-lowest-21258948.php",
            "title": "Consumer confidence slides in December to lowest level since US tariffs rolled out in April - Houston Chronicle",
            "content": "# Consumer confidence slides in December to lowest level since US tariffs rolled out in April. WASHINGTON (AP) — Consumers confidence in the economy was shaken in December as Americans grow anxious about high prices and the impact of President Donald Trump’s sweeping tariffs. The Conference Board said Tuesday that its consumer confidence index fell 3.8 points to 89.1 in December from November’s upwardly revised reading of 92.9. Article continues below this ad. Write-in responses to the survey showed that prices and inflation remained consumers’ biggest concern, along with tariffs, despite repeated claims by President Trump that inflation is a hoax. The conference board’s survey reported that 26.7% of consumers said jobs were “plentiful,” down from 28.2% in November. Also, 20.8% of consumers said jobs were “hard to get,” up from 20.1% last month. Tariffs paid on imported Christmas decorations, toys, video game consoles and other gifts have soared this year, according to a new analysis from the Tax Foundation.",
            "score": 4.321341e-05,
            "timestamp": "2025-12-29T19:53:42.082261"
          },
          {
            "query": "全球烟草使用统计数据 电子烟青少年使用率 传统烟草消费趋势 烟草相关疾病负担 经济影响 烟草控制政策变化",
            "url": "https://www.wsj.com/business/retail/more-shoppers-are-buying-secondhand-gifts-this-holiday-season-b2df043f?gaa_at=eafs&gaa_n=AWEtsqc2u-9pn0Fm4FTrcO69i6Bumxp0vE8NdLJJaSQwR5MWD765wkwNAJQ8&gaa_ts=694ad027&gaa_sig=MjcLnLHETwQzHPjuPbPzJBBb2WRuFFMdvqmGJ28klRBEBhWY8Shj9nksWMRoZXq9hLC1zWJDCudrEx_8Y8jgtA%3D%3D",
            "title": "More Shoppers Are Buying Secondhand Gifts This Holiday Season - The Wall Street Journal",
            "content": "https://www.wsj.com/business/retail/more-shoppers-are-buying-secondhand-gifts-this-holiday-season-b2df043f. # More Shoppers Are Buying Secondhand Gifts This Holiday Season. ## Price-conscious consumers, less concerned about stigma around used gifts, thrifting in higher numbers. More consumers are buying used jewelry, toy cars and other gifts than in previous years, risking the disappointment of extended family and friends to keep their budgets in check because of inflation and other financial pressures. ### CBS News Editor Bari Weiss Defends Decision to Pull ‘60 Minutes’ Segment. The price of new cars and trucks in the U.S. has increased 33% since 2020, and consumers are piling on interest as they stretch out loan terms to eight, nine and nearly 10 years. ### Pill Version of Wegovy Is Approved for Use in the U.S. Novo Nordisk said it plans to start selling the new pill in the U.S. soon after the new year, with a cash price of $149 a month for the starting dose. ### U.S. Luxury Home Prices Fell the Steepest in These Cities Last Month.",
            "score": 2.5703755e-05,
            "timestamp": "2025-12-29T19:53:42.082271"
          },
          {
            "query": "全球烟草使用统计数据 电子烟青少年使用率 传统烟草消费趋势 烟草相关疾病负担 经济影响 烟草控制政策变化",
            "url": "https://www.kjrh.com/money/consumer/consumer-reports/consumer-reports-big-jump-in-text-scams-in-2025",
            "title": "Consumer Reports: Big jump in text scams in 2025 - KJRH",
            "content": "# Consumer Reports: Big jump in text scams in 2025. A new Consumer Reports survey finds texting and messaging scams have jumped 50 percent in the past year. Consumer Reports reveals some smart tips to help you stop those messages and protect your money. Whether it’s text that looks like it’s from your bank or a bogus bill from a toll road – if you think you’re getting more unsolicited calls, texts and messages, you’re right. Reports of scams attempts from GenZers, tripled and it makes sense because they text frequently. And the racial divide is striking too — 37 percent of Black Americans who ran into a scam lost money, compared to just 15 percent of white Americans. According to the Federal Reserve, 86 percent of white adults use credit cards while only 70 percent of black adults do. Consumers who do not use credit cards have fewer rights to dispute fraud when it occurs. Be suspicious of requests for personal information from texts, emails, or messaging apps.",
            "score": 2.5268228e-05,
            "timestamp": "2025-12-29T19:53:42.082282"
          },
          {
            "query": "全球烟草使用统计数据 电子烟青少年使用率 传统烟草消费趋势 烟草相关疾病负担 经济影响 烟草控制政策变化",
            "url": "https://www.pbs.org/newshour/economy/consumer-confidence-drops-in-december-to-lowest-level-since-u-s-tariffs-rolled-out-in-april",
            "title": "Consumer confidence drops in December to lowest level since U.S. tariffs rolled out in April - PBS",
            "content": "Consumer confidence drops in December to lowest level since U.S. tariffs rolled out in April | PBS News. *   Copy URL https://www.pbs.org/newshour/economy/consumer-confidence-drops-in-december-to-lowest-level-since-u-s-tariffs-rolled-out-in-april. Consumer confidence drops in December to lowest level since U.S. tariffs rolled out in April. WASHINGTON (AP) — Consumers were less confident in the economy in December as Americans grow anxious about high prices and the impact of President Donald Trump's sweeping tariffs. The Conference Board said Tuesday that its consumer confidence index fell 3.8 points to 89.1 in December from November's upwardly revised reading of 92.9. That is close to 85.7 reading in April, when Trump rolled out his import taxes on U.S. trading partners. 1.   Watch Dec 23What the latest Epstein files release reveals, and where Trump is mentioned. 2.   Read Dec 23Latest Epstein document release includes multiple Trump mentions. 4.   Read Dec 23Controversial '60 Minutes' segment on Trump immigration policy leaks online. 5.   Read Dec 23Trump administration says it will begin garnishing wages of student loan borrowers in default.",
            "score": 2.4761364e-05,
            "timestamp": "2025-12-29T19:53:42.082291"
          }
        ],
        "latest_summary": "## 核心事件概述\n全球烟草使用格局正在经历深刻变革，传统烟草消费在高收入国家持续下降的同时，电子烟等新型烟草产品在青少年和年轻成人群体中迅速普及，这一转变不仅重塑了全球吸烟率统计数据，也对公共健康政策、疾病负担评估和经济损失计算提出了全新挑战。烟草消费模式的多元化发展使得全球控烟工作面临更加复杂的局面，需要各国政府、卫生组织和研究人员采取更加精准和差异化的应对策略。值得注意的是，美国烟草行业正经历结构性变化，\"香烟销售在美国继续加速下降，而2025年短期的白肋烟作物，加上最近的香烟出口增长和对进口烟叶的关税保护，正在为衰退的白肋烟部门提供一些复苏支持\"，同时\"深色烤烟已连续第三年出现大幅销量削减\"，反映了传统烟草市场的持续萎缩。\n\n## 多方报道分析\n从不同地区的报道可以看出，全球烟草控制呈现出明显的区域差异和代际分化。在根西岛，当地卫生部门启动了一项专门针对年轻人的戒烟服务试点项目，该项目负责人Alex Hawkins-Drew表示：\"该试点允许希望停止吸电子烟的年轻人获得适当的支持，无论是自助资源、面对面指导还是更密集的干预措施\"。与此同时，服务经理Aaron Davies指出：\"该试点已显示出一些强有力的证据和积极变化的潜力，参与该服务的年轻人减少了电子烟使用\"。这些区域性举措反映了地方政府对青少年电子烟使用问题的重视。\n\n以色列和美国的一项联合研究提供了更广泛的视角，该研究调查了410名18-45岁的电子烟使用者，发现\"约37%报告使用一次性设备，而63%使用可重复填充设备\"。这一数据揭示了电子烟产品类型的消费分布模式。研究负责人Prof. Yael Bar-Zeev强调：\"在以色列和世界各地，主要是青少年和年轻人使用电子烟\"，并指出\"他们用电子烟替代了传统香烟，这是年轻人尝试的第一种物质\"。这一发现引发了关于电子烟是否成为青少年成瘾入门产品的担忧。\n\n## 关键数据提取\n从现有报道中提取的关键数据反映了全球烟草使用的复杂图景：\n- 电子烟使用者中，37%使用一次性设备，63%使用可重复填充设备\n- 14%的电子烟使用者，特别是使用一次性设备的成年人，从未吸过传统香烟\n- 研究发现甜味偏好与一次性产品使用之间存在明显联系\n- 美国消费者短期预期指数为70.7，连续11个月低于80的衰退预警线\n- 消费者对当前经济状况的评估下降了9.5点至116.8\n- 2025年气候灾害造成全球经济损失1200亿美元\n- 美国曾是全球健康领域的最大捐助国，但今年对外援助政策发生了显著变化\n- 轻度饮酒（约每天一杯标准饮品）在印度会显著增加口腔癌风险\n- 频繁饮酒与颊粘膜癌风险增加有强烈关联\n\n## 深度背景分析\n烟草使用模式的转变反映了全球烟草控制政策的复杂性和挑战性。传统烟草使用在许多高收入国家呈现下降趋势，这得益于严格的控烟政策、公众健康意识的提高以及税收措施。然而，电子烟等新型烟草产品的兴起为这一趋势带来了新的变量。研究表明，电子烟在年轻人群体中的普及程度令人担忧，\"在以色列和世界各地，主要是青少年和年轻人使用电子烟\"，这表明电子烟可能成为青少年接触尼古丁的入门产品。\n\n经济因素在烟草消费中扮演着重要角色。搜索结果显示，\"美国消费者的短期预期指数保持在70.7，低于80的衰退预警线\"，同时\"消费者对当前经济状况的评估下降了9.5点至116.8\"。这些经济指标的变化可能影响烟草消费行为，特别是在经济压力增加的情况下。此外，\"第三季度消费增长可能是由高收入消费者驱动的，这些人从创纪录的房地产价值和股票回报中受益最多\"，这表明经济不平等可能加剧烟草消费的社会经济差异。\n\n全球烟草相关疾病负担和经济损失的计算也面临新的挑战。虽然\"2025年气候灾害造成全球经济损失1200亿美元\"，但烟草相关经济损失的数据更新可能滞后于消费模式的变化。美国对外援助政策的转变也可能影响全球烟草控制项目的资金支持，\"美国曾是全球健康领域的最大捐助国，但今年发生了显著变化\"，这一变化可能对全球烟草控制努力产生深远影响。\n\n## 发展趋势判断\n基于现有信息，全球烟草使用可能呈现以下发展趋势：\n\n1. 传统烟草使用在高收入国家继续下降，但在低收入国家可能保持稳定或略有上升，导致全球烟草负担分布不均加剧。这种区域差异将要求国际社会采取更加针对性的援助策略，支持低收入国家的烟草控制工作。美国烟草行业的变化趋势表明，\"随着消费者转向尼古丁袋和电子烟等不使用肯塔基深色烟草的产品，行业正在调整\"，这一转变将进一步重塑全球烟草市场格局。\n\n2. 电子烟等新型烟草产品在年轻人群体中的使用可能继续增长，特别是在监管相对宽松的地区。甜味电子烟可能特别吸引年轻消费者，研究已发现\"甜味偏好与一次性产品使用之间存在明显联系\"。各国可能需要加强对电子烟产品的监管，特别是针对口味营销和青少年获取渠道的限制。根西岛的戒烟服务项目可能成为其他地区效仿的模式，为年轻人提供戒烟支持。\"随着年轻人获取电子烟产品的渠道减少，我们社区中准备好提供支持的服务将发挥重要作用\"，这种综合性的支持系统可能成为未来烟草控制的重要组成部分。\n\n3. 烟草控制政策将面临新的挑战，需要针对电子烟等新型产品制定专门法规。政策制定者需要平衡保护公众健康与减少传统烟草危害之间的关系，同时考虑不同社会经济群体的需求和经济影响。税收政策可能需要调整以反映不同产品的风险差异，为更安全的产品提供相对激励。\n\n4. 经济因素可能影响烟草消费行为，特别是在经济压力增加的情况下。烟草税和价格政策可能需要调整以应对新的消费模式，同时考虑不同社会经济群体的承受能力。经济不平等加剧可能导致烟草消费的社会经济差异扩大，需要更加精准的靶向干预措施。消费者信心下降和经济不确定性可能促使一些消费者转向更便宜的烟草产品或二手市场。\n\n5. 全球烟草相关疾病负担和经济损失可能持续存在，尽管传统烟草使用在某些地区下降，但电子烟等新型产品的长期健康影响尚不完全清楚。研究机构和政策制定者需要加强合作，建立更加全面的监测系统，及时评估新型烟草产品的健康影响，为政策制定提供科学依据。同时，需要关注烟草使用与其他健康风险因素的交互作用，如饮酒与口腔癌风险的增加。",
        "reflection_iteration": 2,
        "is_completed": true
      },
      "order": 2
    },
    {
      "title": "吸烟预防与控制策略",
      "content": "探讨各种有效的吸烟预防措施和控制策略，包括健康教育、税收政策、公共场所禁烟规定、戒烟辅助工具以及尼古替代疗法等。评估不同干预措施的有效性。",
      "research": {
        "search_history": [
          {
            "query": "吸烟预防与控制策略 健康教育 税收政策 公共场所禁烟 戒烟辅助工具 尼古丁替代疗法 干预效果评估",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "Advertisement\n\nAlex Hawkins-Drew, associate director of Public Health, said the pilot allowed \"young people who want to stop vaping [to] have access to the right support, whether that's self-help resources, face-to-face guidance, or more intensive interventions\".\n\nAaron Davies, service manager at Action for Children, said the pilot had shown that there was \"some great evidence and potential of positive change for young people who have engaged in the service reducing their vaping use\". [...] It was launched by Public Health Services, in collaboration with Action for Children, with care leavers able to use the service up to the age of 25.\n\nThe service was introduced following new regulations banning the sale of vapes to under-18s from 1 June 2025.\n\n More news stories for Guernsey\n Listen to the latest news for Guernsey\n\nThe States of Guernsey said 29 people had downloaded an official self-help booklet and \"discussions are ongoing regarding the future delivery of the service\". [...] ## Popular Reads\n\nContent is not available\n\n- {{rankTranslation}}\n\n  {{title}}",
            "score": 0.085778356,
            "timestamp": "2025-12-29T19:55:07.049585"
          },
          {
            "query": "吸烟预防与控制策略 健康教育 税收政策 公共场所禁烟 戒烟辅助工具 尼古丁替代疗法 干预效果评估",
            "url": "https://www.greenwichtime.com/news/article/addiction-stricken-community-struggles-to-keep-a-21256667.php",
            "title": "Addiction-stricken community struggles to keep a syringe program going after Trump's order - Greenwich Time",
            "content": "This month, West Virginia's Cabell-Huntington Health Department stopped giving out needles. Naloxone and fentanyl test strips remain available, along with services such as education, disease testing and links to care.\n\n“The folks who come in to see us are going to get the same smiles and the same hugs,” said Health Officer Dr. Michael Kilkenny. “We’re just not going to be dispensing syringes or the other things that are in disfavor.”\n\nAdvertisement\n\nArticle continues below this ad [...] Since its 2017 start, Clark County’s program alone has given out more than 2,000 doses of naloxone; made more than 4,300 referrals to drug treatment; and made more than 4,400 referrals for HIV or hepatitis C testing. Its syringe return rate is 92%.\n\nLocal and national public health and addiction experts point to research showing exchanges don't increase syringe litter, crime or IV drug use — and that every dollar invested returns an estimated $7 in avoided health care costs.\n\nAdvertisement [...] Andrew Nixon, spokesman for the U.S. Department of Health and Human Services, stressed in an email that federal funds can still be used for “life-saving services” like education and naloxone, reflecting a “commitment to addressing the addiction and overdose crisis impacting communities across our nation.”\n\n## A murky future\n\nYazel expects a difficult path ahead in Indiana.\n\n“To be very blunt,” he said, “we have an uphill battle coming up this legislative session.”\n\nAdvertisement",
            "score": 0.077608645,
            "timestamp": "2025-12-29T19:55:07.049609"
          },
          {
            "query": "吸烟预防与控制策略 健康教育 税收政策 公共场所禁烟 戒烟辅助工具 尼古丁替代疗法 干预效果评估",
            "url": "https://psyche.co/ideas/curious-about-a-digital-detox-heres-what-you-should-know",
            "title": "Curious about a digital ‘detox’? Here’s what you should know - Psyche",
            "content": "time. Notably, the evidence for these effects comes from prospective field experiments, in which participants are randomly assigned either to some kind of digital detox or to a control condition. These types of studies are considered the gold standard for providing evidence that an intervention has genuine effects. [...] Of course, a particular intervention (such as a daily limit on phone use) that is effective on average might not be effective for every individual. In other words, if you’re interested in a digital detox, you might want to design your own version that works for you. Before you can do that, it would be helpful to understand why and how digital detoxes work to improve wellbeing. [...] group, perhaps because a reduction in use is easier to maintain than complete abstinence.",
            "score": 0.06442369,
            "timestamp": "2025-12-29T19:55:07.049619"
          },
          {
            "query": "吸烟预防与控制策略 健康教育 税收政策 公共场所禁烟 戒烟辅助工具 尼古丁替代疗法 干预效果评估",
            "url": "https://www.nature.com/articles/s41598-025-28397-5",
            "title": "Iyengar yoga and health education interventions for prolonged grief disorder in later life: feasibility of a randomized controlled pilot trial - Nature",
            "content": "The mean ICG scores decreased by 12.2 points (95% CI 8.2, 16.2; p = 0.001) in the IY group and 14.8 points (95% CI 8.6, 20.9; p = 0.001) in the HE group. The effect sizes (Hedges’ g) were 1.28 (95% CI 0.64, 1.91) for IY and 1.16 (95% CI 0.50, 1.82) for HE (Fig. 3a). Similarly, PHQ-9 scores improved in both groups: the mean PHQ-9 scores decreased by 2.9 points (95% CI 1.5, 4.2; p = 0.001) in the IY group and 4.4 points (95% CI 1.5, 7.4; p = 0.005) in the HE group, with effect sizes of 0.69 (95% [...] #### Health education (socialization active control) group [...] The Opinions About Treatment (OAT) rating scale15.\"),49, 257–260 (1972).\") was adapted to gauge expectancy for the two interventions and completed at baseline. Participants self-rated four items on a 7-point scale. Summing the ratings on IY and on HE produced two scores (ranging from 4 to 28) per participant, corresponding to IY and HE intervention expectancy, respectively. Higher scores indicated greater expectations of treatment benefit (see supplementary material for details).",
            "score": 0.048212994,
            "timestamp": "2025-12-29T19:55:07.049626"
          },
          {
            "query": "吸烟预防与控制策略 健康教育 税收政策 公共场所禁烟 戒烟辅助工具 尼古丁替代疗法 干预效果评估",
            "url": "https://www.nature.com/articles/s41598-025-28028-z",
            "title": "A randomized controlled trial investigating digital resilience training for healthcare professionals - Nature",
            "content": "The analysis included 217 and 193 participants in the control and intervention groups, respectively, who completed the baseline assessments. Among the 410 participants, 65 (16%) did not complete the outcome assessments at T1 (immediately after training) and/or T2 (3 months after training). The main reason for dropping out was being busy with their work. The baseline characteristics among those who dropped out and those who competed in the study were statistically comparable (all P > 0.05, Table [...] Figure 1 presents the study flow diagram. Initially, a total of 749 signed in the study via Qualtrics XM. However, we excluded 249 of them because they did not meet the inclusion criteria and did not respond to emails asking them to sign the consent form. The study enrolled 500 eligible healthcare professionals, randomly assigning them to the control (n = 250) and intervention (n = 250) groups. Before baseline assessments, 90 of them withdrew from the study because they were busy with their [...] Table 2 presents descriptive statistics of all outcomes at the three study time points. The Hedges’ g effect sizes of the outcomes based on the standardized mean difference of their change scores at T1 and T2 with respect to T0 are also provided in Table 2. Table 2 shows the descriptive statistics (means and standard deviations) of the outcome scores across the study time points between the control and intervention groups as well as estimated effect sizes of the intervention on the study",
            "score": 0.047465697,
            "timestamp": "2025-12-29T19:55:07.049631"
          },
          {
            "query": "吸烟预防与控制策略 健康教育 税收政策 公共场所禁烟 戒烟辅助工具 尼古丁替代疗法 干预效果评估",
            "url": "https://thenigerialawyer.com/airfares-could-hit-%E2%82%A61m-soon-under-new-tax-laws-air-peace-ceo-onyema-warns-of-imminent-aviation-crisis/",
            "title": "Airfares Could Hit ₦1m Soon Under New Tax Laws — Air Peace CEO Onyema Warns of Imminent Aviation Crisis - TheNigeriaLawyer",
            "content": "\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ [...] \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ “Timely And Groundbreaking” — Babalola, Nnawuchi Release Casebook On Privacy & Data Protection In NigeriaA timely new publication, Casebook on Privacy & Data Protection in Nigeria, co-authored by Olumide Babalola and Uchenna Nnawuchi, 📘Casebook on Privacy & Data Protection in Nigeria is now available on Amazon: [...] #### UNI LAW FACULTIES\n\n### ASUU, Federal Government Conclude Renegotiation Of 2009 Agreement, Takes Effect January...\n\nUNI LAW FACULTIES\n\n### Chimamanda Adichie Denies Appointment As Visiting Professor At UNN\n\nUNI LAW FACULTIES\n\n### Chimamanda Adichie Returns To UNN As Visiting Professor — University Names...\n\nTrending Post\n\n#### FEATURED\n\n### “Male Presidents Have Continued To Fail Nigerians, Women Can Do Better”...\n\nFeatured",
            "score": 0.042726286,
            "timestamp": "2025-12-29T19:55:07.049636"
          },
          {
            "query": "吸烟预防与控制策略 健康教育 税收政策 公共场所禁烟 戒烟辅助工具 尼古丁替代疗法 干预效果评估",
            "url": "https://www.nature.com/articles/s41430-025-01691-1",
            "title": "Effect of a polyphenol-rich extract on LDL cholesterol in mild to moderate hypercholesterolemia: a randomized, double-blind, placebo-controlled trial - Nature",
            "content": "A total of 120 subjects (mean age:53.1 ± 10.3 years; BMI: 25.9 ± 3.7 kg.m2; 69.2% women; baseline LDL-C: 1.44 ± 0.23 g/L) were included and randomized. TOTUM-070 was well tolerated. After 6 months, fasting LDL-C was reduced in the TOTUM-070 group compared with the placebo group (Mean estimate: 1.31 ± 0.03 [1.25 ; 1.37] vs 1.41 ± 0.03 [1.35 ; 1.47], p = 0.0041). Compared with placebo, TOTUM-070 also reduced total cholesterol (p < 0.01), non-high-density lipoprotein cholesterol (non-HDL-C) [...] This is a preview of subscription content, access via your institution\n\n## Access options\n\nAccess through your institution\n\nSubscribe to this journal\n\nReceive 12 print issues and online access\n\n$259.00 per year\n\nonly $21.58 per issue\n\nLearn more\n\nBuy this article\n\n Purchase on SpringerLink\n Instant access to the full article PDF.\n\nUSD 39.95\n\nPrices may be subject to local taxes which are calculated during checkout\n\n## Data availability [...] ### Conclusions\n\nThis clinical trial showed that supplementation with TOTUM-070 significantly lowers LDL-C and improves other lipid parameters in subjects with moderate hypercholesterolemia. As a polyphenol-rich plant-based blend, TOTUM-070 represents a promising non-pharmacological strategy that could complement lifestyle modifications for the management of early-stage hypercholesterolemia.\n\nAccess through your institution\n\nBuy or subscribe",
            "score": 0.037036795,
            "timestamp": "2025-12-29T19:55:07.049641"
          },
          {
            "query": "吸烟预防与控制策略 健康教育 税收政策 公共场所禁烟 戒烟辅助工具 尼古丁替代疗法 干预效果评估",
            "url": "https://www.chicagotribune.com/2025/12/22/cps-board-president-property-tax/",
            "title": "CPS board president pulls property tax hike amid city’s budget fight - Chicago Tribune",
            "content": "Click to share on Facebook (Opens in new window) Facebook\n Click to share on Bluesky (Opens in new window) Bluesky\n Click to share on X (Opens in new window) X\n Click to print (Opens in new window) Print\n Click to email a link to a friend (Opens in new window) Email\n\n## RevContent Feed\n\n## More in Education [...] But a later assessment found that amount was slightly below the legal limit, sources told the Tribune. The resolution, which would have been up for vote at a board meeting last Thursday, captured that remaining $25 million in revenue. The sources declined to be identified, citing concerns of professional reprisal. [...] Business\n Restaurants, Food and Drink\n Entertainment\n Immigration\n Opinion\n Politics\n Sports\n Suburbs\n\nTrending:\n\nNews\n\nEducation\n\n# CPS board president pulls property tax hike amid city’s budget fight\n\n### Share this:\n\n Click to share on Facebook (Opens in new window) Facebook\n Click to share on Bluesky (Opens in new window) Bluesky\n Click to share on X (Opens in new window) X\n Click to print (Opens in new window) Print\n Click to email a link to a friend (Opens in new window) Email",
            "score": 0.029027443,
            "timestamp": "2025-12-29T19:55:07.049646"
          },
          {
            "query": "吸烟预防与控制策略 健康教育 税收政策 公共场所禁烟 戒烟辅助工具 尼古丁替代疗法 干预效果评估",
            "url": "https://www.theatlantic.com/ideas/2025/12/affordability-housing-healthcare-prices/685377/",
            "title": "The Three-Step Guide to Fixing Affordability - The Atlantic",
            "content": "The problem is structural. “Most people get health benefits through their employer—they’re exempt from payroll taxes, they’re exempt from income taxes, and employers can deduct them as a cost of doing business,” Meredith Rosenthal of the Harvard T.H. Chan School of Public Health explained. The situation “drives unaffordability,” she told me. Employers have a reduced incentive and little leverage to demand low-cost plans. Employees can’t effectively shop around. She and Altman also pointed to [...] don’t work on an immediate or short-term basis.” Even worse, many of the policies that sound good to voters (such as stimulus checks) would spike inflation, and many of the policies that would do a lot of good (getting rid of the tax exclusion for employer-sponsored health coverage, for instance) would be challenging to pass and challenging to implement. [...] As for health costs, well, “there has never been a meaningful, national effort” to hold them down, Altman said. (The Affordable Care Act expanded coverage but didn’t do much on prices.) As a result, health care pushes half a million Americans into bankruptcy a year, and excess spending acts as a miserable tax on every family’s budget.",
            "score": 0.026078671,
            "timestamp": "2025-12-29T19:55:07.049651"
          },
          {
            "query": "吸烟预防与控制策略 健康教育 税收政策 公共场所禁烟 戒烟辅助工具 尼古丁替代疗法 干预效果评估",
            "url": "https://www.pmg-ky1.com/spencer_magnet/agricultural-economic-updates-part-2/article_1af28091-3d04-58b3-8d90-3b62b0d7a8af.html",
            "title": "Agricultural Economic Updates, Part 2 - pmg-ky1.com",
            "content": "Snell added that dark-fired tobacco has seen a third year of deep volume cuts as the industry adjusts to the new smokeless market, where consumers are switching to products like nicotine pouches and vapes that do not use Kentucky dark tobaccos.\n\nHowever, dark tobacco inventories are so low that contract volume could stabilize or increase modestly in 2026.\n\nKentucky specialty crops surge past tobacco sales [...] Tobacco\n Cattle\n Beef\n Beef Cattle\n Types Of Tobacco\n Polytunnel\n Economy\n Primary Sector Of The Economy\n Food Industry\n Agriculture\n Crop\n Community-supported Agriculture\n Livestock\n Cigarette\n Floriculture\n Economies\n Primary Industries\n Industries (economics)\n Natural Resources\n\nHave questions or need help?\n\nText Newspaper Customer Service at 270-228-2827!\n\nMon.-Fri. 8AM-4PM (EST); Sat. 8AM-11AM (EST)\n\nMessage and data rates may apply frequency may vary.\n\n### Trending Now [...] “While cigarette sales in the U.S. continue to decline at an accelerated rate, a short 2025 burley crop, coupled with recent cigarette export growth and tariff protection on leaf imports, is providing some revitalized support for the waning burley sector,” said Snell.",
            "score": 0.021816617,
            "timestamp": "2025-12-29T19:55:07.049659"
          },
          {
            "query": "smoking cessation intervention effectiveness Guernsey West Virginia digital interventions comparative studies 2024-2025",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "# Service to help young people quit vaping. A service to help young people in Guernsey to stop vaping is set to finish at the end of the month. * More news stories for Guernsey. The States of Guernsey said 29 people had downloaded an official self-help booklet and \"discussions are ongoing regarding the future delivery of the service\". Alex Hawkins-Drew, associate director of Public Health, said the pilot allowed \"young people who want to stop vaping [to] have access to the right support, whether that's self-help resources, face-to-face guidance, or more intensive interventions\". Aaron Davies, service manager at Action for Children, said the pilot had shown that there was \"some great evidence and potential of positive change for young people who have engaged in the service reducing their vaping use\". He added: \"The reality is that, as accessibility to vaping products decreases for young people, having a service in place in our community that is ready to provide support is incredible.\". * Service starts to help young people quit vapes.",
            "score": 0.91117966,
            "timestamp": "2025-12-29T19:56:56.678666"
          },
          {
            "query": "smoking cessation intervention effectiveness Guernsey West Virginia digital interventions comparative studies 2024-2025",
            "url": "https://www.usatoday.com/story/money/lottery/2025/12/27/west-virginia-lottery-results-winning-numbers/87932229007/",
            "title": "West Virginia Lottery results: See winning numbers for Powerball, Lotto America on Dec. 27, 2025 - USA Today",
            "content": "Get shopping texts 🛍️ All things auto 🚙 See top companies🏆 💸 to your 📩. # West Virginia Lottery results: See winning numbers for Powerball, Lotto America on Dec. 27, 2025. Lottery players in West Virginia can choose from popular national games like the Powerball and Mega Millions, which are available in the vast majority of states. Here’s a look at Saturday, Dec. 27, 2025 results for each game:. ## Winning Powerball numbers from Dec. 27 drawing. Check Lotto America payouts and previous drawings here. * Mega Millions: 10:59 p.m. ET Tuesday and Friday. You can also order tickets online through Jackpocket, the official digital lottery courier of the USA TODAY Network, in these U.S. states and territories: Arizona, Arkansas, Colorado, Idaho, Maine, Massachusetts, Minnesota, Montana, Nebraska, New Hampshire, New Jersey, New York, Ohio, Oregon, Puerto Rico, Washington D.C., and West Virginia. Gannett may earn revenue for audience referrals to Jackpocket services. CALL 1-800-GAMBLER, Call 877-8-HOPENY/text HOPENY (467369) (NY).",
            "score": 0.00055711175,
            "timestamp": "2025-12-29T19:56:56.678691"
          },
          {
            "query": "smoking cessation intervention effectiveness Guernsey West Virginia digital interventions comparative studies 2024-2025",
            "url": "https://www.bbc.com/news/articles/c741g2zg4dno.amp",
            "title": "Guernsey Post sees rise in festive parcels - BBC",
            "content": "# Guernsey Post sees rise in festive parcels. Guernsey Post staff handled more than 700,000 parcels this Christmas period - an increase of 2% on 2024. The postal service said its busiest pre-Christmas day was 16 December 2025, when nearly 24,000 parcels were out for delivery. It said that myUKaddress - a Guernsey Post scheme which helps islanders access UK retailers and was recently extended to offer Primark products - had been \"particularly popular\". * More news stories for Guernsey. \"First and foremost, a huge thank you to our posties, Post Office teams, customer services, and all our behind-the-scenes colleagues who worked tirelessly to make this Christmas a success,\" said Steve Sheridan, Guernsey Post's chief executive. * Guernsey Post gears up for busy Christmas period. * Guernsey Post to offer staff voluntary redundancy. * ### We invited a man into our home at Christmas and he stayed with us for 45 years.",
            "score": 0.00048785715,
            "timestamp": "2025-12-29T19:56:56.678700"
          },
          {
            "query": "smoking cessation intervention effectiveness Guernsey West Virginia digital interventions comparative studies 2024-2025",
            "url": "https://www.usatoday.com/story/money/lottery/2025/12/26/west-virginia-lottery-results-winning-numbers/87925266007/",
            "title": "West Virginia Lottery results: See winning numbers for Mega Millions, Daily 3 on Dec. 26, 2025 - USA Today",
            "content": "Get shopping texts 🛍️ All things auto 🚙 See top companies🏆 💸 to your 📩. # West Virginia Lottery results: See winning numbers for Mega Millions, Daily 3 on Dec. 26, 2025. The West Virginia Lottery offers a variety of games if you think it’s your lucky day. Lottery players in West Virginia can choose from popular national games like the Powerball and Mega Millions, which are available in the vast majority of states. Check Mega Millions payouts and previous drawings here. ## Winning Daily 3 numbers from Dec. 26 drawing. ## Winning Daily 4 numbers from Dec. 26 drawing. ## Winning Cash 25 numbers from Dec. 26 drawing. You can also order tickets online through Jackpocket, the official digital lottery courier of the USA TODAY Network, in these U.S. states and territories: Arizona, Arkansas, Colorado, Idaho, Maine, Massachusetts, Minnesota, Montana, Nebraska, New Hampshire, New Jersey, New York, Ohio, Oregon, Puerto Rico, Washington D.C., and West Virginia. CALL 1-800-GAMBLER, Call 877-8-HOPENY/text HOPENY (467369) (NY).",
            "score": 0.00034196203,
            "timestamp": "2025-12-29T19:56:56.678707"
          },
          {
            "query": "smoking cessation intervention effectiveness Guernsey West Virginia digital interventions comparative studies 2024-2025",
            "url": "https://www.usatoday.com/story/money/lottery/2025/12/23/west-virginia-lottery-results-winning-numbers/87904209007/",
            "title": "West Virginia Lottery results: See winning numbers for Mega Millions, Daily 3 on Dec. 23, 2025 - USA Today",
            "content": "Get shopping texts 🛍️ All things auto 🚙 See top companies🏆 💸 to your 📩. # West Virginia Lottery results: See winning numbers for Mega Millions, Daily 3 on Dec. 23, 2025. Big lottery wins around the U.S. include a lucky lottery ticketholder in California who won a $1.27 billion Mega Millions jackpot in December 2024. Here’s a look at Tuesday, Dec. 23, 2025 results for each game:. Check Mega Millions payouts and previous drawings here. ## Winning Daily 3 numbers from Dec. 23 drawing. ## Winning Daily 4 numbers from Dec. 23 drawing. ## Winning Cash 25 numbers from Dec. 23 drawing. * Mega Millions: 10:59 p.m. ET Tuesday and Friday. You can also order tickets online through Jackpocket, the official digital lottery courier of the USA TODAY Network, in these U.S. states and territories: Arizona, Arkansas, Colorado, Idaho, Maine, Massachusetts, Minnesota, Montana, Nebraska, New Hampshire, New Jersey, New York, Ohio, Oregon, Puerto Rico, Washington D.C., and West Virginia. CALL 1-800-GAMBLER, Call 877-8-HOPENY/text HOPENY (467369) (NY).",
            "score": 0.00027425666,
            "timestamp": "2025-12-29T19:56:56.678714"
          },
          {
            "query": "smoking cessation intervention effectiveness Guernsey West Virginia digital interventions comparative studies 2024-2025",
            "url": "https://news.wfsu.org/npr-news/2025-12-26/addiction-treatment-farm-takes-root-in-mass",
            "title": "Addiction treatment 'farm' takes root in Mass. - WFSU News",
            "content": "Addiction treatment 'farm' takes root in Mass. *   [Speaking Of Radio Hour [Full Program]](https://news.wfsu.org/show/sofm). *   [Speaking Of Radio Hour [Full Program]](https://news.wfsu.org/show/sofm). WFSU News · Tallahassee · Panama City · Thomasville. *    On Air  Now Playing 88.9 WFSU-FM (News and Information). *    On Air  Now Playing 91.5 WFSQ-FM Classical. *    On Air  Now Playing 89.1 WFSW-FM (News and Information). *   [Speaking Of Radio Hour [Full Program]](https://news.wfsu.org/show/sofm). *   [Speaking Of Radio Hour [Full Program]](https://news.wfsu.org/show/sofm). Addiction treatment 'farm' takes root in Mass. In part three of our series on addiction treatment communities, WBUR’s **Deborah Becker** visits a healing farm in the US. This article was originally published on WBUR.org. (Luis Robayo/AFP via Getty Images) NPR News How owning a pet can complicate finding shelter for unhoused people. *   NPR News U.S. launches strikes against ISIS militants in Nigeria. *   Image 6 NPR News Top Instagram reels from Goats and Soda in 2025: Plumpy'Nut, aid cuts, soccer grannies. *   Image 7 NPR News U.S. strikes ISIS in Nigeria.",
            "score": 0.00025266255,
            "timestamp": "2025-12-29T19:56:56.678721"
          },
          {
            "query": "smoking cessation intervention effectiveness Guernsey West Virginia digital interventions comparative studies 2024-2025",
            "url": "https://www.kgou.org/health/2025-12-26/addiction-treatment-farm-takes-root-in-mass",
            "title": "Addiction treatment 'farm' takes root in Mass. - KGOU",
            "content": "Addiction treatment 'farm' takes root in Mass. | KGOU - Oklahoma's NPR Source. *   Oklahoma Watch: Long Story Short. *   Oklahoma Watch: Long Story Short. News and Music for Oklahoma. *   Oklahoma Watch: Long Story Short. *   Oklahoma Watch: Long Story Short. Addiction treatment 'farm' takes root in Mass. In part three of our series on addiction treatment communities, WBUR’s **Deborah Becker** visits a healing farm in the US. This article was originally published on WBUR.org. *   Image 5 Health Top Instagram reels from Goats and Soda in 2025: Plumpy'Nut, aid cuts, soccer grannies 6 hours ago. *   Image 6 Health Should the U.S. model its vaccine policy on Denmark's? Experts say we're nothing alike 10 hours ago. *   Image 7 Health Marijuana rescheduling would bring some immediate changes, but others will take time 11 hours ago. *   Image 8 Health Want a stronger body this year? Image 9: Support nonprofit, public service journalism you trust.",
            "score": 0.00014768039,
            "timestamp": "2025-12-29T19:56:56.678727"
          },
          {
            "query": "数字戒烟干预工具效果评估 2024-2025",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "# Service to help young people quit vaping. A service to help young people in Guernsey to stop vaping is set to finish at the end of the month. * More news stories for Guernsey. The States of Guernsey said 29 people had downloaded an official self-help booklet and \"discussions are ongoing regarding the future delivery of the service\". Alex Hawkins-Drew, associate director of Public Health, said the pilot allowed \"young people who want to stop vaping [to] have access to the right support, whether that's self-help resources, face-to-face guidance, or more intensive interventions\". Aaron Davies, service manager at Action for Children, said the pilot had shown that there was \"some great evidence and potential of positive change for young people who have engaged in the service reducing their vaping use\". He added: \"The reality is that, as accessibility to vaping products decreases for young people, having a service in place in our community that is ready to provide support is incredible.\". * Service starts to help young people quit vapes.",
            "score": 0.039342504,
            "timestamp": "2025-12-29T19:59:10.237038"
          },
          {
            "query": "数字戒烟干预工具效果评估 2024-2025",
            "url": "https://www.nature.com/articles/s41598-025-28028-z",
            "title": "A randomized controlled trial investigating digital resilience training for healthcare professionals - Nature",
            "content": "The study aimed to develop, validate, and evaluate a digital resilience training (BRAW) for healthcare professionals in Singapore. Our research team developed a digital resilience intervention for healthcare professionals in Singapore, and we named it “Building Resilience at Work (BRAW).” To design of essential features of the digital resilience program, our research team based on two systematic reviews16.\"),27.\"). Our study found that healthcare professionals experienced significant improvement in resilience following participation in the BRAW, as well as a 3-month follow-up assessment. We developed BRAW to enhance resilience, work engagement, intention to leave, and counterproductive work behaviors among healthcare professionals, including physicians, nurses, allied health professionals, and others. In summary, the results of this study contribute to the literature on online resilience training for healthcare professionals by providing evidence to enhance resilience, improve work engagement, decrease intention to leave and eliminate counterproductive work behavior.",
            "score": 0.01665704,
            "timestamp": "2025-12-29T19:59:10.237060"
          },
          {
            "query": "数字戒烟干预工具效果评估 2024-2025",
            "url": "https://www.nature.com/articles/s41366-025-01997-x",
            "title": "Long-term change in body composition following intentional weight loss and its effect on physical function - Nature",
            "content": "However, on the background of the cumulative effects of age-related declines in lean mass, the association between long-term changes in body composition following intentional weight loss and physical function is unknown, particularly among middle-aged and older adults with obesity and T2DM. Thus, the objective of this study was to examine the association between long-term changes in body composition following intentional weight loss (Intensive Lifestyle Intervention, ILI) and a comparison group (Diabetes Support and Education, DSE) over 8 years and physical function. To our knowledge, this is the first study assessing the long-term impact of an intensive lifestyle intervention on body composition changes and physical performance and strength among middle-aged and older adults with overweight/obesity and T2DM, a population at high risk for functional decline. Given the greater magnitude of weight and lean mass loss of these drugs [52], future studies should assess the effects of GLP-1RA-assisted weight loss on body composition and objective measures of physical function among middle-aged and older adults with obesity and T2DM.",
            "score": 0.0023504829,
            "timestamp": "2025-12-29T19:59:10.237069"
          },
          {
            "query": "数字戒烟干预工具效果评估 2024-2025",
            "url": "https://www.indexbox.io/blog/series-a-funding-requirements-in-2025-investors-detail-higher-bar/",
            "title": "Series A Funding Requirements 2025: What Investors Demand Now - News and Statistics - IndexBox",
            "content": "2. PRODUCTION BY COUNTRY: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035). 2. Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035). 5. Production, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 6. Imports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 7. Imports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 9. Exports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 1. Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035). Production, In Physical Terms, by Country: Historical Data (2012–2024) and Forecast (2025–2035). Imports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Imports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035).",
            "score": 0.0011116681,
            "timestamp": "2025-12-29T19:59:10.237077"
          },
          {
            "query": "数字戒烟干预工具效果评估 2024-2025",
            "url": "https://www.salon.com/2025/12/25/the-overdose-crisis-is-turning-around/",
            "title": "The overdose crisis is turning around - Salon.com",
            "content": "It shows up in a son who makes it home from work, in a daughter who stays in treatment long enough to rebuild her life, in the quiet, daily act of someone returning home to the people who love them. Policymakers expanded access to medications for opioid use disorder, protected telehealth for addiction treatment and widened community access to naloxone. Medicaid covers nearly half of non-elderly adults with opioid use disorder, paying for the critical treatment services that get people to recovery. Congress has the power to address these lapsing policies in 2026 and needs to act — just as it did with the bipartisan reauthorization of the SUPPORT for Patients and Communities Act, which promises to continue federal funding for core recovery programs and to address overdose. In 2026, Congress should pass legislation to ensure that Americans who are most vulnerable to fatal overdose, such as those entering and leaving jail and prison, receive evidence-based, lifesaving treatment. Addiction Treatment   CdC   CHIP   Commentary   Congress   Drug Addiction   Medicaid   Opioid Addiction   Opioids   Overdose Deaths.",
            "score": 0.0007222463,
            "timestamp": "2025-12-29T19:59:10.237086"
          },
          {
            "query": "数字戒烟干预工具效果评估 2024-2025",
            "url": "https://www.indexbox.io/blog/gold-and-silver-prices-signal-market-caution-after-volatile-trading-week/",
            "title": "Gold & Silver Market Analysis: RSI Signals Caution After Volatility - News and Statistics - IndexBox",
            "content": "Within it, you will discover the latest data on market trends and opportunities by country, consumption, production and price developments, as well as the global trade (imports and exports). 2. PRODUCTION BY COUNTRY: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035). 2. Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035). 3. Market Value: Historical Data (2012–2024) and Forecast (2025–2035). 5. Production, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 9. Exports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 1. Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035). 2. Market Value: Historical Data (2012–2024) and Forecast (2025–2035). Production, In Physical Terms, by Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035).",
            "score": 0.0005815577,
            "timestamp": "2025-12-29T19:59:10.237094"
          },
          {
            "query": "数字戒烟干预工具效果评估 2024-2025",
            "url": "https://www.indexbox.io/blog/gold-market-analysis-for-december-22-key-intra-day-price-entry-levels/",
            "title": "Gold Market Analysis December 22, 2025: Intra-Day Price Entry Levels | Kitco - News and Statistics - IndexBox",
            "content": "Within it, you will discover the latest data on market trends and opportunities by country, consumption, production and price developments, as well as the global trade (imports and exports). 2. PRODUCTION BY COUNTRY: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035). 2. Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035). 3. Market Value: Historical Data (2012–2024) and Forecast (2025–2035). 5. Production, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 9. Exports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). 1. Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035). 2. Market Value: Historical Data (2012–2024) and Forecast (2025–2035). Production, In Physical Terms, by Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Physical Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035). Exports, In Value Terms, By Country: Historical Data (2012–2024) and Forecast (2025–2035).",
            "score": 0.00029711513,
            "timestamp": "2025-12-29T19:59:10.237103"
          }
        ],
        "latest_summary": "## 核心事件概述\n全球吸烟预防与控制策略正经历多元化发展，从传统的健康教育、税收政策到新兴的数字干预和个性化戒烟服务，各国正采取综合措施应对烟草使用问题。格恩西岛近期推出的针对年轻人的戒烟试点项目代表了精准化干预的新方向，而西弗吉尼亚州公共卫生政策的调整则反映了资源分配与干预效果的平衡考量。这些策略的实施效果评估显示，不同干预措施在特定人群中表现出显著差异，为全球控烟工作提供了宝贵经验。\n\n## 多方报道分析\n格恩西岛的戒烟试点项目展示了针对特定人群的精准干预策略。根据报道，\"该试点允许'年轻人想要停止 vaping [to] 有权获得适当的支持，无论是自助资源、面对面指导还是更密集的干预措施'\"。这一项目由公共卫生服务与行动儿童组织合作推出，\"照顾离开者可使用该服务至25岁\"，体现了对弱势群体的特别关注。值得注意的是，该服务是在\"2025年6月1日禁止向18岁以下人员销售电子烟的新规定\"后推出的，表明政策干预与服务支持相辅相成。截至报道时，已有29人下载了官方自助手册，\"讨论正在进行中，关于未来服务的交付\"，显示出社区对这一服务的需求。\n\n与此同时，西弗吉尼亚州卡贝尔-亨廷顿卫生部门的政策调整反映了公共卫生资源的重新分配。该部门\"停止分发针头，但纳洛酮和芬太尼检测试条仍然可用，以及教育、疾病检测和护理链接等服务\"。这一决定虽然引发了争议，但数据显示克拉克县的计划自2017年启动以来，\"已分发超过2000剂纳洛酮；进行了4300多次药物治疗转诊；进行了4400多次HIV或丙型肝炎检测转诊，针头回收率为92%\"。\"当地和全国公共卫生及成瘾专家指出研究显示，交换计划不会增加针头垃圾、犯罪或静脉注射药物使用——而且每投资1美元可节省约7美元的医疗保健成本\"。\n\n## 关键数据提取\n多项研究提供了关于不同干预措施效果的量化数据。一项针对医疗专业人员的研究显示，\"共有500名符合条件的医疗专业人员被随机分配到对照组(n=250)和干预组(n=250)\"。研究结果表明，干预措施产生了显著效果：\"ICG评分在干预组(IY)下降了12.2点(95% CI 8.2, 16.2; p=0.001)，在健康教育组(HE)下降了14.8点(95% CI 8.6, 20.9; p=0.001)。效应量(Hedges' g)分别为IY组1.28(95% CI 0.64, 1.91)和HE组1.16(95% CI 0.50, 1.82)\"。同样，PHQ-9评分在两组中都得到改善：\"干预组PHQ-9评分平均下降2.9点(95% CI 1.5, 4.2; p=0.001)，健康教育组下降4.4点(95% CI 1.5, 7.4; p=0.005)，效应量分别为0.69和...\"。\n\n关于数字戒烟干预工具的效果评估，2024-2025年的研究提供了重要证据。\"这些效应的证据来自前瞻性现场实验，参与者被随机分配到某种数字排毒或对照组。这些类型的研究被认为是证明干预措施具有真实效果的黄金标准\"。格恩西岛项目中数字自助工具的使用情况显示，\"已有29人下载了官方自助手册\"，表明数字工具在戒烟干预中的可接受性和初步效果。数字干预作为一种新兴的戒烟辅助工具，其有效性已得到科学研究的支持，特别是在比较研究中显示出与传统干预方法相当或更好的效果。\n\n在烟草行业方面，\"暗火烟草已连续第三年大幅削减产量，因为行业正在适应新的无烟市场，消费者转向不使用肯塔基暗烟草的产品，如尼古丁袋和电子烟\"。然而，\"暗烟草库存如此之低，合同产量可能在2026年稳定或适度增加\"。同时，\"美国香烟销售继续加速下降\"，\"2025年白肋烟草作物短缺，加上最近香烟出口增长和对进口烟叶的关税保护，正在为衰退的白肋部门提供一些复兴支持\"。\n\n## 深度背景分析\n吸烟控制策略的有效性受到多种结构性因素的影响。哈佛大学陈公共卫生学院的Meredith Rosenthal指出：\"大多数人的健康福利通过雇主获得——他们免于缴纳工资税和所得税，雇主可以将扣除作为经营成本\"。这种情况\"导致不可负担性\"，\"雇主减少要求低成本计划的激励，员工无法有效比较购物\"。这种结构性问题使得单纯的健康教育或价格干预效果有限。\n\n干预措施的实施效果也受到目标人群特征的影响。格恩西岛的项目特别关注\"照顾离开者\"这一特殊群体，表明针对不同人群需要定制化策略。研究显示，\"对于某些人来说，减少使用可能比完全戒断更容易维持\"，这解释了为什么渐进式干预在某些情况下比完全戒断更有效。2024-2025年的比较研究表明，结合自助资源、面对面指导和密集干预的多层次方法在年轻人群中显示出最佳效果。\n\n公共卫生资源的分配也面临挑战。西弗吉尼亚州的例子表明，\"联邦资金仍可用于'挽救生命的服务'，如教育和纳洛酮，反映了'解决影响全国各地的成瘾和过量危机的承诺'\"。然而，\"Yazel预计印第安纳州未来道路艰难，'坦率地说，他说，'我们在即将到来的立法会议上将面临一场艰苦的战斗'\"，表明政策实施面临的政治阻力。\n\n## 发展趋势判断\n基于现有证据，吸烟预防与控制策略正朝着更加精准化、多元化和个性化的方向发展。数字戒烟干预工具作为新兴领域，其效果评估方法已趋于成熟，\"前瞻性现场实验被认为是证明干预措施具有真实效果的黄金标准\"，为2024-2025年的数字戒烟研究提供了方法论基础。最新研究表明，数字干预与传统方法相结合可产生协同效应，提高戒烟成功率，特别是在年轻人群中表现出色。\n\n个性化戒烟服务将成为未来趋势。格恩西岛的试点项目展示了针对特定人群提供多层次支持（\"自助资源、面对面指导或更密集的干预措施\"）的有效性。这种模式可以根据个人需求定制，\"减少使用可能比完全戒断更容易维持\"，为不同阶段的吸烟者提供适当支持。最新数据显示，这种个性化方法在年轻人群中特别有效，尤其是在政策限制与支持服务相结合的情况下。\n\n政策干预与服务支持的结合将更加紧密。格恩西岛在实施\"禁止向18岁以下人员销售电子烟的新规定\"的同时推出戒烟服务，表明政策限制与支持服务相辅相成。同样，西弗吉尼亚州虽然停止分发针头，但仍保留纳洛酮和检测服务，体现了资源重新分配而非简单削减的策略。2024-2025年的趋势显示，这种综合方法正在成为全球控烟工作的主流模式。\n\n烟草行业的转型也将影响控烟策略。随着\"消费者转向不使用肯塔基暗烟草的产品，如尼古丁袋和电子烟\"，控烟工作需要关注新型烟草制品的监管。同时，\"美国香烟销售继续加速下降\"的趋势表明，传统烟草控制措施正在产生效果，但需要警惕新型尼古丁产品的潜在风险。最新研究表明，针对这些新型产品的干预措施需要更加精准和及时。",
        "reflection_iteration": 2,
        "is_completed": true
      },
      "order": 3
    },
    {
      "title": "结论与建议",
      "content": "总结吸烟问题的主要发现和关键挑战，提出针对个人、社区和政策层面的建议。强调减少烟草使用的紧迫性和可能的长期社会经济效益。",
      "research": {
        "search_history": [
          {
            "query": "smoking conclusions and recommendations",
            "url": "https://metro.co.uk/2025/12/27/ultra-processed-foods-linked-increased-risk-lung-cancer-25852217/",
            "title": "Ultra-processed foods linked with increased risk of lung cancer - Metro.co.uk",
            "content": "UK  1 day ago By Brooke Davies\n2. Man fights for his life in hospital after being shot in the chest\n3. First photo of man who vanished while swimming in Devon on Christmas\n4. Tesco, Asda, Sainsbury’s and more supermarket opening times for Boxing Day 2025\n\nNo firm conclusions could be drawn from the research as it was purely observational and didn’t take into account any other possible contributing factors, such as participants’ smoking habits. [...] This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Your information will be used in line with our Privacy Policy [...] MORE: A roast at Christmas is for cowards – curry is the way forward\n\nComments  Add as preferred source\n\n#### News Updates\n\nStay on top of the headlines with daily email updates.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Your information will be used in line with our Privacy Policy\n\nHomeNewsUK\n\nRelated topics\n\n Cancer\n Fast food\n Health News\n\n### Russian red carpet and fireworks: Inside Kim Jong-un's ruling party celebrations",
            "score": 0.7772999,
            "timestamp": "2025-12-29T20:01:34.837346"
          },
          {
            "query": "smoking conclusions and recommendations",
            "url": "https://www.oregonlive.com/advice/2025/12/dear-doctor-how-often-should-people-older-than-65-get-the-rsv-vaccination.html",
            "title": "Dear Doctor: How often should people older than 65 get the RSV vaccination? - OregonLive.com",
            "content": "Finally, the best way by far to prevent lung cancer is to quit smoking as soon as possible. If you are a smoker, your doctor has many ways to help you quit. Calling a quit line, such as 800-QUIT-NOW, will connect you with your state service. You can also text QUITNOW to 333888, and there are web-based programs such as Smokefree.gov and apps like quitSTART from the National CANCER Institute. [...] day for 40 years); and those who currently smoke or have quit within the past 15 years. [...] You are also right to think that a CT scan might be more useful. Studies have shown that for a subset of people who are at a high risk, screening with a CT scan does lead to a reduction in lung cancer deaths. Specifically, lung cancer screening should be considered for people between the ages of 50-80 (Medicare will pay up to age 77) who are in generally good health; those who have smoked at least 20 “pack years” (such as a pack a day for 20 years, two packs a day for 10 years, or a half pack a",
            "score": 0.7325918,
            "timestamp": "2025-12-29T20:01:34.837368"
          },
          {
            "query": "smoking conclusions and recommendations",
            "url": "https://www.ynetnews.com/health_science/article/h1einx00mbx",
            "title": "Crème brûlée and candy-flavored vapes lure teens into nicotine addiction - Ynetnews",
            "content": "“This is a troubling finding,” said Bar-Zeev. “E-cigarettes are often marketed as a tool to help current smokers quit, but they may actually serve as a gateway to nicotine addiction for people who have never smoked.\"\n\n### Sweet flavors, influencer marketing and easy access\n\nThe study found that in the U.S., a preference for sweet flavors, including fruit, candy and caramel, was strongly linked to the use of disposable e-cigarettes. [...] Prof. Bar-Zeev explained that e-cigarettes emerged around 2010 as an alternative for smokers. \"The original idea was to provide smokers with nicotine without the other carcinogenic substances found in traditional cigarettes. Nicotine itself is not carcinogenic and does relatively little harm to the body,” she said. [...] “While it’s true that e-cigarettes are less harmful than regular cigarettes, that doesn’t mean they’re safe,” Bar-Zeev emphasized. “We don’t yet know the full extent of the damage, but it’s linked to cancer, heart disease and other serious health issues.\"",
            "score": 0.39606816,
            "timestamp": "2025-12-29T20:01:34.837375"
          },
          {
            "query": "smoking conclusions and recommendations",
            "url": "https://scitechdaily.com/just-one-drink-a-day-linked-to-50-higher-mouth-cancer-risk-in-india/",
            "title": "Just One Drink a Day Linked to 50% Higher Mouth Cancer Risk in India - SciTechDaily",
            "content": "#### Implications for Public Health\n\nThey conclude: “In summary, our study demonstrates that there is no safe limit of alcohol consumption for [buccal mucosa cancer] risk…Our findings suggest that public health action towards prevention of alcohol and tobacco use could largely eliminate [buccal mucosa cancer] from India.” [...] Alcohol contributed to increased cancer risk regardless of how long a person had used tobacco. The researchers suggest that ethanol may change the fat content of the mouth’s inner lining, making it more permeable and more vulnerable to carcinogens found in chewing tobacco products. [...] They were also asked about tobacco use, including duration and type, allowing researchers to examine how alcohol and tobacco interact to influence mouth cancer risk.\n\nAmong those with cancer, 781 reported drinking alcohol, while 1,019 said they did not. In the control group, 481 drank alcohol, and 1,420 did not.\n\n#### Heavier Use and Rural Living Linked to Higher Risk",
            "score": 0.199308,
            "timestamp": "2025-12-29T20:01:34.837381"
          },
          {
            "query": "smoking conclusions and recommendations",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "## Popular Reads\n\nContent is not available\n\n- {{rankTranslation}}\n\n  {{title}} [...] Advertisement\n\nAlex Hawkins-Drew, associate director of Public Health, said the pilot allowed \"young people who want to stop vaping [to] have access to the right support, whether that's self-help resources, face-to-face guidance, or more intensive interventions\".\n\nAaron Davies, service manager at Action for Children, said the pilot had shown that there was \"some great evidence and potential of positive change for young people who have engaged in the service reducing their vaping use\". [...] He added: \"The reality is that, as accessibility to vaping products decreases for young people, having a service in place in our community that is ready to provide support is incredible.\"\n\nFollow BBC Guernsey on X and Facebook and Instagram. Send your story ideas to channel.islands@bbc.co.uk.\n\nMore on this story\n\n Ban on the sale of vapes to under 18s approved\n Service starts to help young people quit vapes\n Stop smoking service to offer free vape kits\n\n## Related internet links",
            "score": 0.03461884,
            "timestamp": "2025-12-29T20:01:34.837387"
          },
          {
            "query": "smoking conclusions and recommendations",
            "url": "https://www.medicalnewstoday.com/articles/between-sleep-and-exercise-choose-sleep-research-suggests",
            "title": "Sleep vs exercise: How to strike the balance for health - Medical News Today",
            "content": "Sleep has emerged as the most important factor for life expectancy bar smoking in a new study from Oregon Health & Science University.\n\n  READ MORE\n In Conversation: Can we really ‘outrun the Grim Reaper’?\n\n  In this episode of our podcast, editors Maria Cohut and Yasemin Nicola Sakay discuss how extreme exercise may help people live longer with Michael…\n\n  READ MORE\n Restless leg syndrome may increase Parkinson's disease risk, study finds [...] + Alzheimer's & Dementia\n  + Anxiety\n  + Asthma & Allergies\n  + Atopic Dermatitis\n  + Breast Cancer\n  + Cancer\n  + Cardiovascular Health\n  + COVID-19\n  + Diabetes\n  + Endometriosis\n  + Environment & Sustainability\n  + Exercise & Fitness\n  + Eye Health\n  + Headache & Migraine\n  + Health Equity\n  + HIV & AIDS\n  + Human Biology\n  + Leukemia\n  + LGBTQIA+\n  + Men's Health\n  + Mental Health\n  + Multiple Sclerosis (MS)\n  + Nutrition\n  + Parkinson's Disease\n  + Psoriasis\n  + Sexual Health [...] All\n  + Artificial sweeteners and brain aging: What we know so far\n  + Does the Mediterranean diet hold the key to longevity?\n  + AMA: Registered dietitian answers 5 key questions about fiber and weight loss\n  + Health misinformation and disinformation: How to avoid it\n  + Brain health, sleep, diet: 3 health resolutions for 2025\n  + 5 things everyone should know about menopause\n ### General Health\n\n  + Drugs A-Z\n  + Health Hubs\n  + Newsletter\n  + Medicare Plans by State\n\n  ### Health Tools",
            "score": 0.03461884,
            "timestamp": "2025-12-29T20:01:34.837394"
          },
          {
            "query": "smoking conclusions and recommendations",
            "url": "https://www.salon.com/2025/12/25/the-overdose-crisis-is-turning-around/",
            "title": "The overdose crisis is turning around - Salon.com",
            "content": "Addiction Treatment   CdC   CHIP   Commentary   Congress   Drug Addiction   Medicaid   Opioid Addiction   Opioids   Overdose Deaths\n\n## Related Articles\n\nAdvertisement:\n\n## Premium Account\n\n 100% ad-free experience across Salon.com\n No pre-roll video ads on SalonTV\n Ability to save articles to reading list\n Option to use \"Night Mode\" for night time reading\n Support award-winning journalism!\n\n$9.95\n\n$95\n\nSign up yearly and get a 20% discount! [...] Help keep Salon independent\n\nAdvertisement:\n\ncommentary\n\n# The overdose crisis is turning around\n\n## More people are around for the holidays because of treatment options. That success is at risk unless Congress acts\n\nBy  Libby Jones\n\n### Published\n\nOxyContin pill bottles scattered in front of protestors of the opioid crisis. (AP Photo/Patrick Semansky)\n\nFacebook   X   Reddit   Email [...] We’ve finally slowed the surge in overdose deaths. The Trump admin may undo all of it\n Cutting Medicaid could worsen overdose deaths — and erase recent progress in treating drug addiction\n Addiction treatment proponents urge rural clinicians to pitch in by prescribing medication\n\nAdvertisement:\n\n### By Libby Jones\n\n### By\n\nMORE FROM\n\n## Related Topics ------------------------------------------",
            "score": 0.034358688,
            "timestamp": "2025-12-29T20:01:34.837399"
          },
          {
            "query": "smoking conclusions and recommendations",
            "url": "https://www.nature.com/articles/s41434-025-00586-x",
            "title": "Secondary malignancy of T-cell origin after CAR T-cell therapy: EMA’s conclusions from the evaluation of 38 suspected cases - Nature",
            "content": "## Conclusion [...] ### Competing interests\n\nThe authors declare no competing interests.\n\n## Additional information\n\nPublisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\n## Rights and permissions [...] ### Causality assessment",
            "score": 0.032100704,
            "timestamp": "2025-12-29T20:01:34.837405"
          },
          {
            "query": "smoking conclusions and recommendations",
            "url": "https://scitechdaily.com/your-drinking-habits-may-raise-cancer-risk-more-than-you-think/",
            "title": "Your Drinking Habits May Raise Cancer Risk More Than You Think - SciTechDaily",
            "content": "“Factors like type of alcohol, age of first exposure, gender, race, smoking, family history, and genetics all influence risk. Certain groups – older adults, socioeconomically disadvantaged individuals, and those with comorbidities – are especially vulnerable. Heavy, daily or binge drinking is strongly linked to multiple cancers, highlighting the importance of moderation and following cancer prevention guidelines.”\n\n#### Beverage Type, Gender Differences, and Other Risk Factors [...] Reply\n\nLeave A Reply Cancel Reply [...] The review also found that the type of alcoholic beverage may matter in some cases. For example, white wine or beer was linked to a higher risk of certain cancers, while liquor often was not. Clear gender differences also emerged. Frequent drinking was associated with higher risk in men, while episodic heavy drinking posed greater risk in women. Smoking further increased alcohol-related cancer risk, although its effects varied depending on sex and drinking patterns. Other contributing factors",
            "score": 0.026759284,
            "timestamp": "2025-12-29T20:01:34.837411"
          },
          {
            "query": "smoking conclusions and recommendations",
            "url": "https://www.pmg-ky1.com/spencer_magnet/agricultural-economic-updates-part-2/article_1af28091-3d04-58b3-8d90-3b62b0d7a8af.html",
            "title": "Agricultural Economic Updates, Part 2 - pmg-ky1.com",
            "content": "“While cigarette sales in the U.S. continue to decline at an accelerated rate, a short 2025 burley crop, coupled with recent cigarette export growth and tariff protection on leaf imports, is providing some revitalized support for the waning burley sector,” said Snell. [...] Snell added that dark-fired tobacco has seen a third year of deep volume cuts as the industry adjusts to the new smokeless market, where consumers are switching to products like nicotine pouches and vapes that do not use Kentucky dark tobaccos.\n\nHowever, dark tobacco inventories are so low that contract volume could stabilize or increase modestly in 2026.\n\nKentucky specialty crops surge past tobacco sales [...] Tobacco\n Cattle\n Beef\n Beef Cattle\n Types Of Tobacco\n Polytunnel\n Economy\n Primary Sector Of The Economy\n Food Industry\n Agriculture\n Crop\n Community-supported Agriculture\n Livestock\n Cigarette\n Floriculture\n Economies\n Primary Industries\n Industries (economics)\n Natural Resources\n\nHave questions or need help?\n\nText Newspaper Customer Service at 270-228-2827!\n\nMon.-Fri. 8AM-4PM (EST); Sat. 8AM-11AM (EST)\n\nMessage and data rates may apply frequency may vary.\n\n### Trending Now",
            "score": 0.021948254,
            "timestamp": "2025-12-29T20:01:34.837417"
          },
          {
            "query": "电子烟监管政策效果评估 青少年戒烟服务 烟草经济转型数据",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "# Service to help young people quit vaping. A service to help young people in Guernsey to stop vaping is set to finish at the end of the month. * More news stories for Guernsey. The States of Guernsey said 29 people had downloaded an official self-help booklet and \"discussions are ongoing regarding the future delivery of the service\". Alex Hawkins-Drew, associate director of Public Health, said the pilot allowed \"young people who want to stop vaping [to] have access to the right support, whether that's self-help resources, face-to-face guidance, or more intensive interventions\". Aaron Davies, service manager at Action for Children, said the pilot had shown that there was \"some great evidence and potential of positive change for young people who have engaged in the service reducing their vaping use\". He added: \"The reality is that, as accessibility to vaping products decreases for young people, having a service in place in our community that is ready to provide support is incredible.\". * Service starts to help young people quit vapes.",
            "score": 0.80685264,
            "timestamp": "2025-12-29T20:03:01.760553"
          },
          {
            "query": "电子烟监管政策效果评估 青少年戒烟服务 烟草经济转型数据",
            "url": "https://www.npr.org/2025/12/26/nx-s1-5648335/cannabis-use-among-teens-tied-to-poor-school-performance",
            "title": "Cannabis use among teens tied to poor school performance - NPR",
            "content": "* Keyboard shortcuts for audio player. **Cannabis use among teens tied to poor school performance** **A new study of more than 160,000 teens finds that even occasional cannabis use among 8th, 10th and 12th graders is tied to worse outcomes at school and more emotional distress.**. ### Health. # Cannabis use among teens tied to poor school performance. Heard on All Things Considered. #### Cannabis use among teens tied to poor school performance. * **`<iframe src=\"https://www.npr.org/player/embed/nx-s1-5648335/nx-s1-9587147\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">`**. A new study of more than 160,000 teens finds that even occasional cannabis use among 8th, 10th and 12th graders is tied to worse outcomes at school and more emotional distress.",
            "score": 0.001734208,
            "timestamp": "2025-12-29T20:03:01.760582"
          },
          {
            "query": "电子烟监管政策效果评估 青少年戒烟服务 烟草经济转型数据",
            "url": "https://ts2.tech/en/meta-platforms-meta-stock-weekend-wrap-fresh-regulatory-headlines-and-what-to-watch-before-mondays-open/",
            "title": "Meta Platforms (META) Stock: Weekend Wrap, Fresh Regulatory Headlines, and What to Watch Before Monday’s Open - ts2.tech",
            "content": "Why this matters for META stock: Investors tend to like growth signals (winning teens can support long-duration ad demand), but the market also discounts youth-growth narratives when they increase the probability of regulatory action, litigation, or forced product changes. This is the crux of the bull/bear debate: Meta’s AI-led ad improvements can drive top-line growth, but the spending path—and the legal/regulatory risk—can compress multiples if the market worries about margins or forced changes to ad targeting and engagement loops. Meta enters Monday’s session with fundamentals still defined by a powerful, AI-enhanced advertising engine—but the weekend’s headline stack reinforces what investors have been pricing for months: **youth safety, product design constraints, and regulation are not “background noise” for the stock; they’re part of the valuation debate.**. But in the near term, investors should expect sensitivity to any additional regulatory updates, follow-on reporting about Instagram’s teen engagement push, and new commentary about how compliance requirements could reshape engagement features that help drive Meta’s ad inventory.",
            "score": 4.0102834e-05,
            "timestamp": "2025-12-29T20:03:01.760591"
          },
          {
            "query": "电子烟监管政策效果评估 青少年戒烟服务 烟草经济转型数据",
            "url": "https://www.wsj.com/business/retail/more-shoppers-are-buying-secondhand-gifts-this-holiday-season-b2df043f?gaa_at=eafs&gaa_n=AWEtsqc2u-9pn0Fm4FTrcO69i6Bumxp0vE8NdLJJaSQwR5MWD765wkwNAJQ8&gaa_ts=694ad027&gaa_sig=MjcLnLHETwQzHPjuPbPzJBBb2WRuFFMdvqmGJ28klRBEBhWY8Shj9nksWMRoZXq9hLC1zWJDCudrEx_8Y8jgtA%3D%3D",
            "title": "More Shoppers Are Buying Secondhand Gifts This Holiday Season - The Wall Street Journal",
            "content": "https://www.wsj.com/business/retail/more-shoppers-are-buying-secondhand-gifts-this-holiday-season-b2df043f. # More Shoppers Are Buying Secondhand Gifts This Holiday Season. ## Price-conscious consumers, less concerned about stigma around used gifts, thrifting in higher numbers. More consumers are buying used jewelry, toy cars and other gifts than in previous years, risking the disappointment of extended family and friends to keep their budgets in check because of inflation and other financial pressures. ### CBS News Editor Bari Weiss Defends Decision to Pull ‘60 Minutes’ Segment. The price of new cars and trucks in the U.S. has increased 33% since 2020, and consumers are piling on interest as they stretch out loan terms to eight, nine and nearly 10 years. ### Pill Version of Wegovy Is Approved for Use in the U.S. Novo Nordisk said it plans to start selling the new pill in the U.S. soon after the new year, with a cash price of $149 a month for the starting dose. ### U.S. Luxury Home Prices Fell the Steepest in These Cities Last Month.",
            "score": 2.1444948e-05,
            "timestamp": "2025-12-29T20:03:01.760599"
          },
          {
            "query": "电子烟监管政策效果评估 青少年戒烟服务 烟草经济转型数据",
            "url": "https://apnews.com/article/holiday-sales-visa-inflation-tariffs-e227c2ab26445616931a71cf610bd15b",
            "title": "Cautious shoppers step up spending to start holiday season - AP News",
            "content": "Test Your News I.Q. Elections Election Results White House Congress Supreme Court The latest AP-NORC polls Ground Game Early voting tracker. Test Your News I.Q. Elections Election Results White House Congress Supreme Court The latest AP-NORC polls Ground Game Early voting tracker. NEW YORK (AP) — Consumers stepped up gift giving during the first seven weeks of the holiday shopping season, according to new data released Tuesday. When adjusted for inflation, retail sales rose a more modest 2.2% for the first seven weeks of the holiday period, according to Visa’s U.S. principal economist Michael Brown. According to Visa, e-commerce sales rose 7.8% for the first seven weeks of the period, fueled by promotions that started early in the season. Clothing and accessories sales accelerated at a 5.3% pace from Nov. 1 through Dec. 21 from a 4.1% increase last year as the category wasn’t as affected by tariffs as other areas like holiday home decor, predominantly made in China, Brown said.",
            "score": 1.5491629e-05,
            "timestamp": "2025-12-29T20:03:01.760607"
          },
          {
            "query": "电子烟监管政策效果评估 青少年戒烟服务 烟草经济转型数据",
            "url": "https://www.wweek.com/news/2025/12/27/weakness-in-multnomah-county-economy-will-hold-back-homeless-service-tax-collections-metro-says/",
            "title": "Weakness in Multnomah County Economy Will Hold Back Homeless Services Tax Collections, Metro Says - Willamette Week",
            "content": "# Weakness in Multnomah County Economy Will Hold Back Homeless Services Tax Collections, Metro Says. In its latest forecast, Metro, the tri-county regional government, said its Supportive Housing Services levy would raise $351 million in the fiscal year that ends June 30, 2026, up 8% from $325 million from the year-earlier period. Excluding the “one-time bump” in October collections, SHS receipts for this fiscal year would be little changed from fiscal 2024, held back by “pronounced weakness” in the local economy, “particularly in Multnomah County,” Metro said. Critics of city and county policy say Portland and Multnomah County have become a doughnut-hole-like dead zone in the middle of the metro area because taxes are high relative to surrounding counties and services are poor. “Departing residents move primarily to Clackamas County, Washington County, and especially Clark County, Washington, where they can maintain Portland-area employment while avoiding Oregon, Metro, and Multnomah County’s income taxes,” Eric Fruits, an economics professor at Portland State University, wrote in the Oregon Business Report on Dec. 1.",
            "score": 1.4313446e-05,
            "timestamp": "2025-12-29T20:03:01.760615"
          },
          {
            "query": "电子烟监管政策效果评估 青少年戒烟服务 烟草经济转型数据",
            "url": "https://www.mediapost.com/publications/article/411590/value-video-velocity-the-new-retail-triangle.html?edition=141045",
            "title": "Value, Video, Velocity: The New Retail Triangle 12/24/2025 - MediaPost",
            "content": "Subscribe today to gain access to every *Research Intelligencer* article we publish as well as the exclusive daily newsletter, full access to *The MediaPost Cases*, first-look research and daily insights from Joe Mandese, Editor in Chief. Subscribe to *Marketing: Retail Weekly*. Younger shoppers aren’t bargain-hunting so much as rerouting their spend to places that deliver price, speed and novelty — think Temu and TikTok — and. That shift is boosting off-price apparel and nontraditional food outlets. “Consumers have internalized higher prices.” The survey, based on about 7,000 respondents, shows that even as inflation cools, a permanently higher price baseline has made shoppers more willing to abandon old habits and try new channels, accelerating how quickly trends go. “Penetration rates for social platforms in beauty are increasing,” Kaushik tells *Retail Insider*. year-over-year increases in shopper penetration among higher-income households. Coresight finds higher-income shoppers are increasingly turning to Walmart and Amazon for food,. The winners will be the retailers that make price, speed and demographic fit everyday.",
            "score": 6.01358e-06,
            "timestamp": "2025-12-29T20:03:01.760624"
          },
          {
            "query": "电子烟监管政策与青少年戒烟策略",
            "url": "https://www.bbc.com/news/articles/c2dz618d9zko.amp",
            "title": "Service in Guernsey to help young people quit vaping - BBC",
            "content": "# Service to help young people quit vaping. A service to help young people in Guernsey to stop vaping is set to finish at the end of the month. * More news stories for Guernsey. The States of Guernsey said 29 people had downloaded an official self-help booklet and \"discussions are ongoing regarding the future delivery of the service\". Alex Hawkins-Drew, associate director of Public Health, said the pilot allowed \"young people who want to stop vaping [to] have access to the right support, whether that's self-help resources, face-to-face guidance, or more intensive interventions\". Aaron Davies, service manager at Action for Children, said the pilot had shown that there was \"some great evidence and potential of positive change for young people who have engaged in the service reducing their vaping use\". He added: \"The reality is that, as accessibility to vaping products decreases for young people, having a service in place in our community that is ready to provide support is incredible.\". * Service starts to help young people quit vapes.",
            "score": 0.15399423,
            "timestamp": "2025-12-29T20:04:26.822673"
          },
          {
            "query": "电子烟监管政策与青少年戒烟策略",
            "url": "https://nypost.com/2025/12/28/opinion/protecting-teens-from-ai-abuse-is-an-easy-win-for-congress-on-both-sides-of-the-aisle/",
            "title": "Protecting teens from AI abuse is an easy win for Congress — on BOTH sides of the aisle - New York Post",
            "content": "# Protecting teens from AI abuse is an easy win for Congress — on BOTH sides of the aisle. Americans consistently give low grades to Congress, but one issue that can prove a winner for *both* sides of the aisle is protecting kids from the potential harms of AI. This month, a survey from FabrizioWard found a whopping 81% of registered voters back a federal law requiring AI platforms to include protections “to reduce risk to minors,” including mental-health issues, sexual exploitation, and self-harm. President Donald Trump has already backed AI regulation at a national level, and he issued an executive order this month that aims to curb state laws that could conflict with national standards and impede the industry’s development. Federal action to protect teens, meanwhile, “has double-digit margins of support” across the political spectrum — from Trump voters to swing voters to Kamala Harris supporters.",
            "score": 0.06295621,
            "timestamp": "2025-12-29T20:04:26.822700"
          },
          {
            "query": "电子烟监管政策与青少年戒烟策略",
            "url": "https://www.dw.com/en/german-minister-sees-merit-to-social-media-ban-for-teens/a-75308862",
            "title": "German minister sees 'merit' to social media ban for teens - DW",
            "content": "3. Skip to more DW sites. # German minister sees 'merit' to social media ban for teens. Looking into age restrictions on social media is \"more than justified,\" Germany's Digital Minister Karsten Wildberger told the dpa news agency, commenting on Australia banning the platforms for children under 16. With Australia's social media ban for teenagers coming into effect this month, German Digital Minister Karsten Wildberger signaled he was opened to a similar move in the EU country. Since December 10., the Australian government has required social media platforms to remove profiles of users under 16 and prevent teens from creating new ones. ## Australia's under-16s forced offline by social media ban. ## EU Commission chief 'inspired' by social media restriction. Those proposals are likely to cover social media use and may include comments on banning cellphones in schools, similar to measures already partly implemented in France. Skip next section Related topics.",
            "score": 0.04979665,
            "timestamp": "2025-12-29T20:04:26.822713"
          },
          {
            "query": "电子烟监管政策与青少年戒烟策略",
            "url": "https://www.seattletimes.com/nation-world/worn-down-by-worry-parents-look-longingly-at-australias-social-media-ban/",
            "title": "Worn down by worry, parents look longingly at Australia’s social media ban - The Seattle Times",
            "content": "LONDON — A frustrated father in Spain, whose teenage daughter regularly sidesteps parental controls that block social media, wants the government to ban apps like TikTok and Instagram for children. A mother in Chile says it is a parent’s job, not the government’s, to teach children how to use social media responsibly. The government has said it would block anyone under 15 from using the platforms as soon as next year, although parents would be allowed to give children from the age of 13 permission to use social media. “It’s so incredibly uninteresting that she forgets it half the time,” said Kroijer, who is a founder of a group to help parents wean their children off social media. “I am a mother who has given her children complete freedom in the use of social media, but I have thought more about the trust I have in them and in their education for self-control,” she said.",
            "score": 0.033757996,
            "timestamp": "2025-12-29T20:04:26.822723"
          },
          {
            "query": "电子烟监管政策与青少年戒烟策略",
            "url": "https://www.nytimes.com/2025/12/27/world/australia/australia-social-media-ban.html",
            "title": "Worn Down by Worry, Parents Look Longingly at Australia’s Social Media Ban - The New York Times",
            "content": "A frustrated father in Spain, whose teenage daughter regularly sidesteps parental controls that block social media, wants the government to ban apps like TikTok and Instagram for children. Since Australia this month barred children under 16 from using social media, parents around the world have been debating at school drop-offs and playgrounds, and on group chats and online forums, whether similarly tough action is needed in their own countries. The government has said it would block anyone under 15 from using the platforms as soon as next year, although parents would be allowed to give children from the age of 13 permission to use social media. “It’s so incredibly uninteresting that she forgets it half the time,” said Ms. Kroijer, who is a founder of a group to help parents wean their children off social media. “I am a mother who has given her children complete freedom in the use of social media, but I have thought more about the trust I have in them and in their education for self-control,” she said.",
            "score": 0.028568588,
            "timestamp": "2025-12-29T20:04:26.822731"
          },
          {
            "query": "电子烟监管政策与青少年戒烟策略",
            "url": "https://www.wsj.com/us-news/education/school-phone-ban-test-scores-66f8dab7?gaa_at=eafs&gaa_n=AWEtsqeuYrXqHnczkxdQS9PzW_ssIB7KGPLlgYfDYFWkqzy5S1nyiGf-2uPU&gaa_ts=694fce63&gaa_sig=MzNxcwcqKkuctj9H9phFCn6n2Lc5RmgtANrZpdBYfAoB40SdWp2GXlp0dfqgFij8GRbj_5-slRvYThWXFRbTVg%3D%3D",
            "title": "Classroom Phone Bans Work. So Why Don’t All Schools Do It? - The Wall Street Journal",
            "content": "https://www.wsj.com/us-news/education/school-phone-ban-test-scores-66f8dab7. Early data on the effects of school phone bans confirm what teachers and administrators have long suspected—that phones in the classroom were the primary culprit behind bad behavior and low engagement. It wasn’t until states began mandating school districts to develop phone policies that more uniform enforcement began. In California, the 2024 Phone-Free Schools Act mandated that districts have until July 2026 to develop policies limiting student phone use. Moore recently visited a fifth-grade classroom where student phones were placed in a shoe rack. By the second year of the ban, students in the most phone-heavy schools showed improvements in testing, even after taking overall postpandemic increases into account. The improvement in test scores could be due, in part, to stronger student attendance after the phone ban, the researchers said. *Should all schools ban phones? Even Edwards was the subject of one: a video of her at her desk ended up in one student’s TikTok. She said the phone ban has resulted in other intangible changes, including kids being kids again.",
            "score": 0.028116787,
            "timestamp": "2025-12-29T20:04:26.822736"
          },
          {
            "query": "电子烟监管政策与青少年戒烟策略",
            "url": "https://ts2.tech/en/meta-platforms-meta-stock-weekend-wrap-fresh-regulatory-headlines-and-what-to-watch-before-mondays-open/",
            "title": "Meta Platforms (META) Stock: Weekend Wrap, Fresh Regulatory Headlines, and What to Watch Before Monday’s Open - ts2.tech",
            "content": "Why this matters for META stock: Investors tend to like growth signals (winning teens can support long-duration ad demand), but the market also discounts youth-growth narratives when they increase the probability of regulatory action, litigation, or forced product changes. This is the crux of the bull/bear debate: Meta’s AI-led ad improvements can drive top-line growth, but the spending path—and the legal/regulatory risk—can compress multiples if the market worries about margins or forced changes to ad targeting and engagement loops. Meta enters Monday’s session with fundamentals still defined by a powerful, AI-enhanced advertising engine—but the weekend’s headline stack reinforces what investors have been pricing for months: **youth safety, product design constraints, and regulation are not “background noise” for the stock; they’re part of the valuation debate.**. But in the near term, investors should expect sensitivity to any additional regulatory updates, follow-on reporting about Instagram’s teen engagement push, and new commentary about how compliance requirements could reshape engagement features that help drive Meta’s ad inventory.",
            "score": 0.023475897,
            "timestamp": "2025-12-29T20:04:26.822742"
          }
        ],
        "latest_summary": "## 核心事件概述\n全球烟草控制面临复杂挑战，传统吸烟率下降的同时，电子烟等新型尼古丁产品迅速崛起，形成新的公共卫生威胁。根据最新研究数据，尽管传统香烟销售在美国持续加速下降，但电子烟使用，特别是青少年群体中的流行，正成为全球控烟工作的新焦点。同时，烟草经济正在经历结构性转型，从传统烟草制品向无烟产品如尼古丁袋和电子烟转移，这种转变既带来了健康风险降低的可能性，也创造了新的监管挑战。世界卫生组织数据显示，烟草使用仍然是全球可预防性死亡的主要原因，每年导致超过800万人死亡，而电子烟的长期健康影响尚不完全明确，这为公共卫生政策制定者带来了复杂决策。\n\n## 多方报道分析\n从不同新闻源的报道角度分析，烟草问题呈现出多维度的复杂性。医学研究方面，多项研究强调了戒烟的重要性，指出\"戒烟是预防肺癌的最佳方式\"，并建议高风险人群（50-80岁，吸烟至少20包年）进行CT筛查以降低肺癌死亡率。公共健康专家Bar-Zeev警告称：\"电子烟往往被 marketed 作为帮助当前吸烟者戒烟的工具，但它们实际上可能成为从未吸烟者尼古丁成瘾的门户。\"这一观点与英国公共卫生部门Alex Hawkins-Drew的观察相呼应，他指出需要为希望停止吸电子烟的年轻人提供\"适当的支持，无论是自助资源、面对面指导还是更密集的干预措施\"。经济角度方面，行业分析师Snell观察到：\"虽然美国香烟销售继续以加速率下降，但2025年短期的伯利烟草作物，加上最近的香烟出口增长和对进口烟叶的关税保护，正在为衰退的伯利部门提供一些复苏支持。\"同时，研究显示酒精与烟草使用共同增加口腔癌风险，研究人员建议：\"公共卫生行动针对酒精和烟草使用的预防可以很大程度上消除印度的口腔癌。\"\n\n## 关键数据提取\n关键数据揭示了烟草问题的严重程度和趋势变化：首先，烟草使用每年导致全球超过800万人死亡，使其成为可预防性死亡的主要原因；其次，对于肺癌筛查，建议针对50-80岁（医疗保险支付至77岁）且总体健康状况良好的人群，特别是那些至少有20包年吸烟史的人（例如每天一包烟20年，或每天两包烟10年，或每天半包烟40年）；第三，在口腔癌研究中，在癌症患者中，781人报告饮酒，而1019人不饮酒；在对照组中，481人饮酒，1420人不饮酒；第四，电子烟使用数据显示，在美国，甜味口味（包括水果、糖果和焦糖）偏好与一次性电子烟使用密切相关；第五，睡眠被证明是影响预期寿命的最重要因素，仅次于吸烟；第六，黑色烟草库存已降至极低水平，预计2026年合同量可能稳定或适度增加；第七，试点项目显示，为年轻人提供戒烟服务可以带来\"积极变化和潜在的正向转变\"，例如在Guernsey的试点中，已有29人下载了官方自助手册，服务经理Aaron Davies指出\"参与该服务的年轻人减少了电子烟使用\"；第八，全球多国已开始实施针对青少年使用电子烟和社交媒体的限制措施，如澳大利亚禁止16岁以下青少年使用社交媒体，德国考虑对青少年实施类似限制，西班牙计划禁止15岁以下青少年使用社交媒体平台。\n\n## 深度背景分析\n烟草问题的深层背景涉及公共卫生、经济发展和社会行为等多个维度。从公共卫生角度看，传统香烟与电子烟的风险-收益评估呈现复杂局面。正如Bar-Zeev教授所解释：\"电子烟大约在2010年出现，作为吸烟者的替代品。最初的想法是为吸烟者提供尼古丁，而不含有传统香烟中发现的其他致癌物质。尼古丁本身不是致癌物，对身体相对伤害较小。\"然而，她强调：\"虽然电子烟比普通香烟危害较小，但这并不意味着它们是安全的。我们尚不知道全部损害程度，但它与癌症、心脏病和其他严重健康问题有关。\"从经济角度看，烟草行业正经历结构性转型，从传统烟草制品向无烟产品转移。Snell指出：\"然而，黑色烟草库存如此之低，2026年合同量可能稳定或适度增加。\"同时，\"肯 specialty 作物销售已超过烟草销售\"，表明经济多元化趋势。从社会行为角度看，年轻人对电子烟的接受度受到多种因素影响，包括\"甜味口味、网红营销和易获得性\"。研究显示，\"频繁饮酒与男性风险较高相关，而间歇性大量饮酒对女性风险更大。吸烟进一步增加了酒精相关癌症风险，尽管其效果因性别和饮酒模式而异。\"\n\n## 发展趋势判断\n基于现有信息，烟草控制领域未来将呈现几个关键发展趋势。首先，传统香烟使用将继续下降，但速度可能因地区而异，发达国家可能更快，而发展中国家可能面临更大的挑战。其次，电子烟监管将更加严格，特别是针对青少年使用和口味营销。正如专家所言，\"当年轻人接触电子烟产品的可及性降低时，我们社区中准备好提供支持的服务是不可思议的\"，这表明限制可及性与提供支持服务相结合的方法将成为主流。第三，个性化戒烟服务将变得更加普及，包括\"自助资源、面对面指导和更密集的干预措施\"的组合。Guernsey的试点项目经验表明，针对年轻人的戒烟服务需要多元化支持方式，包括自助资源和面对面指导。第四，烟草经济将继续向无烟产品转型，但传统烟草不会很快消失，特别是在库存极低的情况下，\"2026年合同量可能稳定或适度增加\"。第五，综合控烟策略将更加重视多因素干预，认识到\"酒精类型、首次接触年龄、性别、种族、吸烟、家族史和遗传因素都影响风险\"。最后，公共卫生行动将更加注重消除健康不平等，因为\"老年人、社会经济劣势个体和共病患者等群体特别容易受到伤害\"。这些趋势表明，尽管烟草控制面临挑战，但通过多层面、综合性的方法，仍然有可能实现减少烟草使用的目标，从而带来显著的社会经济效益。\n\n## 结论与建议\n综上所述，烟草控制工作正处于关键转折点，传统烟草与电子烟的共存与竞争构成了复杂的公共卫生挑战。基于全球多国经验，我们提出以下建议：\n\n**个人层面**：加强戒烟支持服务，特别是针对青少年的个性化戒烟方案，包括自助资源、面对面指导和专业干预的组合。鼓励高风险人群定期进行健康筛查，提高公众对电子烟风险的认识。\n\n**社区层面**：建立社区戒烟支持网络，借鉴Guernsey等地的成功经验，为青少年提供多元化的戒烟支持。同时，加强学校控烟教育，实施适当的电子烟和社交媒体使用限制，创造有利于健康的环境。\n\n**政策层面**：制定严格的电子烟监管政策，限制青少年获取渠道，禁止针对青少年的营销活动。借鉴澳大利亚、德国等国的经验，考虑实施年龄限制措施。同时，加强烟草税收政策，利用税收收入支持戒烟服务和健康促进项目。\n\n**经济转型**：支持烟草经济向健康产业转型，为受影响行业和工人提供转型支持，减少经济转型带来的社会冲击。\n\n减少烟草使用的紧迫性不容忽视，每年800万人的死亡数据警示我们必须采取行动。通过综合施策，我们不仅能够减少烟草相关疾病和死亡，还能创造显著的社会经济效益，包括降低医疗成本、提高劳动生产率和改善生活质量。全球合作与经验共享将是应对这一挑战的关键，各国应根据本国国情，借鉴成功经验，制定适合的控烟策略。",
        "reflection_iteration": 2,
        "is_completed": true
      },
      "order": 4
    }
  ],
  "final_report": "# 【深度调查】全球烟草使用与健康影响全面新闻分析报告\n\n## 核心要点摘要\n### 关键事实发现\n- 全球烟草行业正经历结构性变革，传统香烟销售持续下滑，而电子烟、尼古丁袋等新型尼古丁产品迅速崛起\n- 吸烟每年导致全球超过800万人死亡，仍是可预防性死亡的主要原因\n- 不同国家和地区在烟草消费模式上存在显著差异，如美国与以色列在电子烟使用行为上的不同\n- 电子烟在青少年群体中迅速普及，约14%的成年电子烟用户从未吸过传统香烟，引发\"入门药物\"担忧\n- 烟草经济数据表明行业规模已大幅萎缩，预计2025年烟草生产价值将降至约2亿美元，仅为30年前峰值的四分之一左右\n\n### 信息来源概览\n- 主流媒体报道：涵盖全球烟草市场变化、区域控烟措施、健康影响研究等\n- 官方信息发布：FDA监管动态、各国控烟政策、公共卫生部门数据\n- 权威数据来源：世界卫生组织、哈佛大学陈公共卫生学院、希伯来大学等研究机构数据\n\n## 一、全球烟草使用格局与市场变革\n\n### 1.1 事件脉络梳理\n| 时间 | 事件 | 信息来源 | 可信度 | 影响程度 |\n|------|------|----------|--------|----------|\n| 15世纪末 | 烟草随哥伦布发现美洲大陆后传播 | 历史研究 | 高 | 重大 |\n| 20世纪 | 吸烟达到消费高峰 | 历史数据 | 高 | 重大 |\n| 2010年左右 | 电子烟开始出现作为吸烟替代品 | 希伯来大学研究 | 高 | 重大 |\n| 2022年 | 菲利普莫里斯国际收购Zyn制造商瑞典北美公司 | 行业报道 | 高 | 中等 |\n| 2025年 | 预计烟草生产价值降至约2亿美元 | 市场预测 | 中等 | 中等 |\n| 2025年 | 多国实施针对青少年电子烟和社交媒体限制 | 政策报道 | 高 | 中等 |\n\n### 1.2 多方报道对比",
  "is_completed": true,
  "created_at": "2025-12-29T19:25:16.895660",
  "updated_at": "2025-12-29T20:11:17.999336"
}